Процедура Запуск()
	//_Организация   = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	//СписокКонстант = ВСД.ЗагрузитьПараметры( _Организация );
	////ПолноеИмяФайлаОбработки = СписокКонстант.Получить("ПолноеИмяФайлаОбработки");
	//КаталогИнтеграции = СписокКонстант.Получить("КаталогИнтеграции");
	КаталогИнтеграции = "D:\OBMEN\1c\";
	ПолноеИмяФайлаОбработки = КаталогИнтеграции + "Интеграция_ГИС_Меркурий.epf";
	
	ВнешняяОбработка = ВнешниеОбработки.Создать(ПолноеИмяФайлаОбработки);
	Форма = ВнешняяОбработка.ПолучитьФорму();
	Форма.Открыть();
КонецПроцедуры

Запуск();