
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВСД") Тогда
		массивВСД = Параметры.ВСД;
		//СтандартнаяОбработка = Ложь;
		Для Каждого ВСД из массивВСД Цикл
			стрТоварНаСВХ = Объект.ГрузыНаСВХ.Добавить();
			ЗаполнитьЗначенияСвойств(стрТоварНаСВХ, ВСД);
			стрТоварНаСВХ.Количество = стрТоварНаСВХ.ВСД_Партия.Количество;
			стрТоварНаСВХ.КлючСтроки = Новый УникальныйИдентификатор;
			стрТоварНаСВХ.ВидПродукции = стрТоварНаСВХ.ВСД_Партия.ВидПродукции;
			стрТоварНаСВХ.ДатаИзготовления = стрТоварНаСВХ.ВСД_Партия.ДатаИзготовления1;
			стрТоварНаСВХ.ДатаСрокГодности = стрТоварНаСВХ.ВСД_Партия.ДатаСрокГодности1;
			//ВСД.ВСД_Партия
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьСтруктуруСтрокиСВХ()
	
	Возврат Новый Структура("Продукция_Элемент,
	                        |Количество,
	                        |КоличествоУпаковок,
	                        |НомерУровняУпаковки,
	                        |ФормаУпаковки,
	                        |Партия,
	                        |КоличествоСписания,
	                        |ДатаСрокГодности,
	                        |ДатаИзготовления");
	
КонецФункции

&НаКлиенте
Процедура кнГотово(Команда)
	
	ОчиститьСообщения();
	Если Не ЗначениеЗаполнено(ПриходуемаяПродукция) Тогда
		кб99_ВСД.СообщитьПользователю("Укажите продукцию",, "ПриходуемаяПродукция", "ЭтаФорма.ПриходуемаяПродукция");
		Возврат;
	КонецЕсли;
	
	МассивВСД = Новый Массив;
	
	Для Каждого СтрСВХ Из Объект.ГрузыНаСВХ Цикл
		
		СтрИнв = СформироватьСтруктуруСтрокиСВХ();
		СтрИнв.Партия = СтрСВХ.ВСД_Партия;
		СтрИнв.КоличествоСписания = 0;
		СтрИнв.Количество = СтрСВХ.Количество;
		СтрИнв.Продукция_Элемент = ПриходуемаяПродукция;
		МассивВСД.Добавить(СтрИнв);
		
	КонецЦикла;
	
	Закрыть(МассивВСД);
	
КонецПроцедуры

&НаСервере
Функция СоздатьДокВСД(элемПродукция, ДокВСД)
	
	Попытка
		обДокВСД = ДокВСД.ПолучитьОбъект();
		обДокВСД.Продукция_Элемент = элемПродукция.Продукция_Элемент;
		обДокВСД.Количество = элемПродукция.Количество;
		обДокВСД.КоличествоПринять = элемПродукция.Количество;
		обДокВСД.НаименованиеПродукции = элемПродукция.Продукция_Элемент.Наименование;
		ОбДокВСД.УровниУпаковки.Очистить();
		стрУпаковки = ОбДокВСД.УровниУпаковки.Добавить();
		стрУпаковки.НомерУровня = элемПродукция.НомерУровняУпаковки;
		стрУпаковки.ФормаУпаковки = элемПродукция.ФормаУпаковки;
		стрУпаковки.Количество = элемПродукция.КоличествоУпаковок;
		обДокВСД.Записать();
	Исключение
		кб99_ВСД.кб99_СообщитьОбОшибке(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат обДокВСД.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура ПриходуемаяПродукцияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	стрВСД = Элементы.ГрузыНаСВХ.ТекущиеДанные;
	СтруктураОтбора = Новый Структура("ВидПродукции", стрВСД.ВидПродукции);
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора, МножественныйВыбор, Отбор", Истина, Истина, Ложь, СтруктураОтбора);
	ОткрытьФорму("Справочник.ВСД_Продукция_Элемент.ФормаВыбора", ПараметрыПодбора, ЭтаФорма.Элементы.ПриходуемаяПродукция);
	
КонецПроцедуры
