
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВСД") Тогда
		массивВСД = Параметры.ВСД;
		СтандартнаяОбработка = Ложь;
		Для Каждого ВСД из массивВСД Цикл
			стрТоварНаСВХ = Объект.ГрузыНаСВХ.Добавить();
			ЗаполнитьЗначенияСвойств(стрТоварНаСВХ, ВСД);
			стрТоварНаСВХ.КлючСтроки = Новый УникальныйИдентификатор;
			стрТоварНаСВХ.ВидПродукции = стрТоварНаСВХ.ДокВСД.ВидПродукции;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура кнПодбор(Команда)
	
	стрВСД = Элементы.ГрузыНаСВХ.ТекущиеДанные;
	СтруктураОтбора = Новый СТруктура("ВидПродукции", стрВСД.ВидПродукции);
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора, МножественныйВыбор, Отбор", Истина, Истина, Истина, СтруктураОтбора);
	ОткрытьФорму("Справочник.ВСД_Продукция_Элемент.ФормаВыбора", ПараметрыПодбора, ЭтаФорма.Элементы.РаспределеннаяПродукцияНаСВХ);
	
КонецПроцедуры

&НаСервере
Процедура РаспределеннаяПродукцияНаСВХОбработкаВыбораНаСервере(ВыбранноеЗначение, КлючСтроки)
	
	Для Каждого Знч Из ВыбранноеЗначение Цикл
        Если объект.РаспределеннаяПродукцияНаСВХ.НайтиСтроки(Новый Структура("Продукция_Элемент", Знч)).Количество() = 0 Тогда
           нСтр = объект.РаспределеннаяПродукцияНаСВХ.Добавить();
           нСтр.Продукция_Элемент = Знч.Ссылка;
		   нСтр.Количество =  НадписьОсталосьРаспределить;
		   нСтр.стрПродукции = КлючСтроки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределеннаяПродукцияНаСВХОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	стрВСД = Элементы.ГрузыНаСВХ.ТекущиеДанные;
	КлючСтроки = стрВСД.КлючСтроки;
	РаспределеннаяПродукцияНаСВХОбработкаВыбораНаСервере(ВыбранноеЗначение, КлючСтроки);
	ГрузыНаСВХПриАктивизацииСтроки(Элементы.ГрузыНаСВХ.ТекущийЭлемент.Родитель);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузыНаСВХПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		ЭтаФорма.Элементы.РаспределеннаяПродукцияНаСВХ.ОтборСтрок = Новый ФиксированнаяСтруктура("стрПродукции", "");
	Иначе
		ЭтаФорма.Элементы.РаспределеннаяПродукцияНаСВХ.ОтборСтрок = Новый ФиксированнаяСтруктура("стрПродукции", Элемент.ТекущиеДанные.КлючСтроки);
	КонецЕсли;
	РаспределеноеКоличество = 0;
	Для Каждого стрРаспределеннаяПродукция Из Объект.РаспределеннаяПродукцияНаСВХ Цикл
		Если стрРаспределеннаяПродукция.стрПродукции = 	Элемент.ТекущиеДанные.КлючСтроки Тогда
			РаспределеноеКоличество = РаспределеноеКоличество + стрРаспределеннаяПродукция.Количество;
		КонецЕсли;
	КонецЦикла;
			
	ОбновитьНадписьОсталосьРаспределить(РаспределеноеКоличество);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузыНаСВХПередУдалением(Элемент, Отказ)
	
	СтруктураДляПоиска = Новый Структура("стрПродукции", Элемент.ТекущиеДанные.КлючСтроки); 
	МассивПустыхСтрок = Объект.РаспределеннаяПродукцияНаСВХ.НайтиСтроки(СтруктураДляПоиска); 
	Для Каждого Строка Из МассивПустыхСтрок Цикл 
		Объект.РаспределеннаяПродукцияНаСВХ.Удалить(Строка); 
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура кнГотово(Команда)
	
	Если НЕ ЗначениеЗаполнено(выбПлощадкаПолучатель) Тогда
		ТекстОшибки = "Выберите площадку получателя продукции!";
		кб99_ВСД.СообщитьПользователю(ТекстОшибки,,"выбПлощадкаПолучатель");
		Возврат;
	КонецЕсли;
	
	МассивВСД = Новый Массив;
	ГрузыНаСВХ = Объект.ГрузыНаСВХ;
	Для А=0 По ГрузыНаСВХ.Количество()-1 Цикл
		ПараметрыОтбораСтрок = Новый Структура("стрПродукции", ГрузыНаСВХ[А].КлючСтроки);
		РаспределеннаяПродукция = Объект.РаспределеннаяПродукцияНаСВХ.НайтиСтроки(ПараметрыОтбораСтрок);	
		Если РаспределеннаяПродукция.Количество() > 0 Тогда
			Для Каждого элем ИЗ РаспределеннаяПродукция Цикл
				Если элем.Количество <> ГрузыНаСВХ[А].Количество Тогда
					ТекстОшибки = "Гашение импортного ВСД сертификат возможно только в полном объеме!";
					кб99_ВСД.СообщитьПользователю(ТекстОшибки,,"элем.Количество");
					Возврат;		
				КонецЕсли;
				стрРаспределеннаяПродукция = Новый Структура("Отметка, Продукция_Элемент, Количество, КоличествоУпаковок, НомерУровняУпаковки, ФормаУпаковки",
															  Истина, элем.Продукция_Элемент, элем.Количество, элем.КоличествоУпаковок, элем.НомерУровняУпаковки, элем.ФормаУпаковки);
				обДокВСД = СоздатьДокВСД(стрРаспределеннаяПродукция, ГрузыНаСВХ[А].ДокВСД);
				стрРаспределеннаяПродукция.Вставить("ДокВСД", обДокВСД); 
				МассивВСД.Добавить(стрРаспределеннаяПродукция);
			КонецЦикла;
		Иначе
			НаименованиеПродукции = ПолучитьНаименованиеНаСервере(ГрузыНаСВХ[А].ДокВСД);
			ТекстОшибки = "Распределите продукцию для "+НаименованиеПродукции;
			кб99_ВСД.СообщитьПользователю(ТекстОшибки,,"ГрузыНаСВХ[А].ДокВСД");
		КонецЕсли;
	КонецЦикла;
	Закрыть(МассивВСД);
	
КонецПроцедуры

&НаСервере
Функция СоздатьДокВСД(элемПродукция, ДокВСД)
	
	Попытка
		обДокВСД = ДокВСД.ПолучитьОбъект();
		обДокВСД.Получатель_Площадка = выбПлощадкаПолучатель;
		обДокВСД.Продукция_Элемент = элемПродукция.Продукция_Элемент;
		обДокВСД.Количество = элемПродукция.Количество;
		обДокВСД.КоличествоПринять = элемПродукция.Количество;
		обДокВСД.НаименованиеПродукции =  элемПродукция.Продукция_Элемент.Наименование;
		ОбДокВСД.УровниУпаковки.Очистить();
		стрУпаковки = ОбДокВСД.УровниУпаковки.Добавить();
		стрУпаковки.НомерУровня = элемПродукция.НомерУровняУпаковки;
		стрУпаковки.ФормаУпаковки = элемПродукция.ФормаУпаковки;
		стрУпаковки.Количество = элемПродукция.КоличествоУпаковок;
		обДокВСД.Записать();
	Исключение
		кб99_ВСД.СообщитьОбОшибке(ОписаниеОшибки());	
	КонецПопытки;
	
	Возврат обДокВСД.Ссылка;
	
КонецФункции

&НаСервере
Функция  ПолучитьНаименованиеНаСервере(спрСсылка)
	Рез = спрСсылка.Наименование;
	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура РаспределеннаяПродукцияНаСВХКоличествоПриИзменении(Элемент)
	
	стрРаспределеннаяПродукция = Элементы.РаспределеннаяПродукцияНаСВХ.ТекущиеДанные;
	ОбновитьНадписьОсталосьРаспределить(стрРаспределеннаяПродукция.Количество)
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьОсталосьРаспределить (Распределено = 0)
	
	стрГрузыНаСВХ = Элементы.ГрузыНаСВХ.ТекущиеДанные;
	НадписьОсталосьРаспределить = стрГрузыНаСВХ.Количество - Распределено;
	
КонецПроцедуры