
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДокСсылка = ПараметрКоманды;
	
	Организация = кб99_ВСД.ПолучитьЗначениеРевизитаОбъекта_НаСервере(ДокСсылка, "Организация");
	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры( Организация );

	Если НЕ ЗначениеЗаполнено(ПараметрыОрганизации["ПарамРазрешитьВводНаОснованииБолееОдногоВСД"] ) Тогда
		кб99_ВСД.СообщитьИнфо("Сохраните параметры для Организации " + Организация);
		Возврат;
	КонецЕсли;			
	
	Если НЕ ПараметрыОрганизации["ПарамРазрешитьВводНаОснованииБолееОдногоВСД"] Тогда		
		ДокВСД = кб99_ВСД.НайтиВСД_Производство( ДокСсылка );
		Если ЗначениеЗаполнено(ДокВСД) Тогда
			кб99_ВСД.СообщитьИнфо("Уже создан "+ДокВСД, ДокВСД);				
			мНеОткрыватьФормуДокумента = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыОрганизации["ПроизводствоРазбиватьПострочно"] Тогда
		мсДокументов = кб99_ВСД_Производство.ОформитьПроизводствоПострочно(ПараметрыОрганизации, ДокСсылка);
		Для Каждого Документ Из мсДокументов Цикл
			ОткрытьФорму("Документ.ВСД2_Производство.ФормаОбъекта", Новый Структура("Ключ", Документ));	
		КонецЦикла;
	Иначе
		ОткрытьФорму("Документ.ВСД2_Производство.ФормаОбъекта", Новый Структура("Основание", ДокСсылка));
	КонецЕсли;
	
КонецПроцедуры
