&НаСервере
Процедура ВыполнитьНаСервере(ПараметрКоманды)
	
	Организация = кб99_ВСД_Общий.ПолучитьОрганизациюПоУмолчанию();	
	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры( Организация );
	
	Для Каждого элемент Из ПараметрКоманды Цикл
		кб99_ВСД_Запросы.Продукция_Элемент_Изменить( ПараметрыОрганизации, элемент, "UPDATE" );
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтвета(Ответ, ПараметрПроцедуры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Состояние("Выполняем запрос Изменение Продукции",,"Ожидайте...",БиблиотекаКартинок.kb99_wrench);
		
		ВыполнитьНаСервере( ПараметрПроцедуры.ПараметрКоманды );
		ПараметрПроцедуры.ПараметрыВыполненияКоманды.Источник.ЭтаФорма.ОбновитьОтображениеДанных();	
		ПоказатьОповещениеПользователя("Операция завершена");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТВопроса = "Изменить Продукцию в Меркурий ?";
	ПараметрПроцедуры = Новый Структура("ПараметрКоманды,ПараметрыВыполненияКоманды", ПараметрКоманды, ПараметрыВыполненияКоманды);
    Оповещение = Новый ОписаниеОповещения("ОбработкаОтвета", ЭтотОбъект, ПараметрПроцедуры);	
    ПоказатьВопрос(Оповещение, ТВопроса, РежимДиалогаВопрос.ДаНет,  0, КодВозвратаДиалога.Да, ""   );
	
КонецПроцедуры
