//Групповое Создание ВСД_Продукция_Элемент api 2.0 ver от 26/05/18
// ред от 26.05.18
//KB99 Дмитрий Жуков zhukov@kb99.pro


Функция ЗаполнитьНоменклатуруВТЗ() Экспорт
	//Проверим, все ли заполнено
	//mitmond
	выбНоменклатура=?(ЗначениеЗаполнено(ВыбГруппаНоменклатуры), ВыбГруппаНоменклатуры, ВыбСписокНоменклатуры);
	//Если (НЕ ЗначениеЗаполнено(ВыбГруппаНоменклатуры)) или
	Если (НЕ ЗначениеЗаполнено(ВыбНоменклатура)) или
    //end
		(НЕ ЗначениеЗаполнено(ВыбПродукция)) или
		(НЕ ЗначениеЗаполнено(ВыбВидПродукции)) или
		//(НЕ ЗначениеЗаполнено(ВыбЕдиницаИзмерения)) или     //mitmond
		//(НЕ ЗначениеЗаполнено(ВыбСрокГодности)) или         //mitmond
		(НЕ ЗначениеЗаполнено(ВыбТермическиеУсловия)) 	Тогда
		Предупреждение("Не все праметры для заполнения указаны");
		Возврат "";
	КонецЕсли;
	
	ВСДЭлементы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|Номенклатура.Ссылка
	|ИЗ
	|Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|Номенклатура.Ссылка В ИЕРАРХИИ(&Папка)";

//mitmond
//Запрос.УстановитьПараметр("Папка",ВыбГруппаНоменклатуры);
Запрос.УстановитьПараметр("Папка",ВыбНоменклатура);	
//end
	//ВСДЭлементы.Загрузить(Запрос.Выполнить().Выгрузить());
	Выборка = Запрос.Выполнить().Выбрать();
	//Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Ном=выборка.ссылка;//mitmond
		Если Выборка.Ссылка.ЭтоГруппа тогда
			Продолжить;
		КонецЕсли;
		
		СтрЭлемент = ВСДЭлементы.Добавить();
		СтрЭлемент.Номенклатура = Ном;
		СтрЭлемент.Продукция_Элемент = ВСД.Получить_ВСД_Продукция_Элемент(Выборка.Ссылка); //Проверим на наличие соответствия
		СтрЭлемент.Продукция = ?(ЗначениеЗаполнено(СтрЭлемент.Продукция_Элемент),СтрЭлемент.Продукция_Элемент.Продукция,ВыбПродукция);
		СтрЭлемент.ВидПродукции = ?(ЗначениеЗаполнено(СтрЭлемент.Продукция_Элемент),СтрЭлемент.Продукция_Элемент.ВидПродукции,ВыбВидПродукции);
		//mitmond
		//СтрЭлемент.ЕдиницаИзмерения = ?(ЗначениеЗаполнено(СтрЭлемент.Продукция_Элемент),СтрЭлемент.Продукция_Элемент.ЕдиницаИзмерения,ВыбЕдиницаИзмерения);
		//СтрЭлемент.СрокГодности = ?(ЗначениеЗаполнено(СтрЭлемент.Продукция_Элемент),СтрЭлемент.Продукция_Элемент.СрокГодности,ВыбСрокГодности);
		если Ном.базоваяЕдиницаИзмерения.наименование="кг" тогда
			ЕдИзм = справочники.ВСД_ЕдиницыИзмерения.НайтиПоКоду( "000000006");
		иначе
			ЕдИзм = справочники.ВСД_ЕдиницыИзмерения.НайтиПоКоду( "000000025");
		конецесли;
		СтрЭлемент.ЕдиницаИзмерения = ?(ЗначениеЗаполнено(СтрЭлемент.Продукция_Элемент),СтрЭлемент.Продукция_Элемент.ЕдиницаИзмерения,ЕдИзм);

		СрокГодности=выбСрокГодности;//это если не определился
		зпр=новый запрос;
		зпр.Текст= "ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Объект = &Объект
		|	И ЗначенияСвойствОбъектов.Свойство = &Свойство" ;
		зпр.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000018"));//тут срок годности
		зпр.УстановитьПараметр("Объект",Ном);
		выб=зпр.Выполнить().Выбрать();
		если выб.Следующий() тогда
			СрокГодности = выб.значение;
		конецесли;
		СтрЭлемент.СрокГодности = ?(ЗначениеЗаполнено(СтрЭлемент.Продукция_Элемент),СтрЭлемент.Продукция_Элемент.СрокГодности,СрокГодности);
		//end mitmond
		СтрЭлемент.ТермическиеУсловияПеревозки = ?(ЗначениеЗаполнено(СтрЭлемент.Продукция_Элемент),СтрЭлемент.Продукция_Элемент.ТермическиеУсловияПеревозки,ВыбТермическиеУсловия);
		Стрэлемент.GUID = СтрЭлемент.Продукция_Элемент.GUID;
		//Сообщить(Выборка);
	КонецЦикла;	
	Возврат "";
КонецФункции

Функция СоздатьПродукцияЭлемент(ВыбСтрЭлемент)
	// Берем данные из ТЧ - Не все м.б. одинаковые, пользователь поправил например
	НовПродукцияЭлемент = Справочники.ВСД_Продукция_Элемент.СоздатьЭлемент();
	НовПродукцияЭлемент.Продукция = ВыбСтрЭлемент.Продукция;
	НовПродукцияЭлемент.ВидПродукции = ВыбСтрЭлемент.ВидПродукции;
	НовПродукцияЭлемент.Наименование = ВыбСтрЭлемент.Номенклатура.Наименование;
	НовПродукцияЭлемент.Площадка = Отправитель_Площадка;
	НовПродукцияЭлемент.ЕдиницаИзмерения = ВыбСтрЭлемент.ЕдиницаИзмерения;
	НовПродукцияЭлемент.ТермическиеУсловияПеревозки = ВыбСтрЭлемент.ТермическиеУсловияПеревозки;
	НовПродукцияЭлемент.СрокГодности = ВыбСтрЭлемент.СрокГодности;	
	НовПродукцияЭлемент.Записать();
	Возврат НовПродукцияЭлемент.Ссылка;
КонецФункции

Функция СоздатьВСДЭлементы() Экспорт
	// Создает элемент справочника ВСД_Продукция_Элемент при отсутствии
	// Устанавливает Соответствие с Номенклатурой
	// Создает в Меркурии Продукццию
	Если (Не ЗначениеЗаполнено(Отправитель_Площадка)) или (Не ЗначениеЗаполнено(Организация)) Тогда
		Сообщить("Укажите Организацию и Площадку");
		Возврат "";
	КонецЕсли;
	//Подготовим к отправке/получению основной модуль
	Обработка = ВСД.ИнициализацияОбработки(Организация);
	Если типЗнч(Обработка) = Тип("Строка") тогда
		Сообщить("Не удалось инициализировать обработку Интеграция");
		Возврат "";
	КонецЕсли;
	
	Для каждого СтрЭлемент из ВСДЭлементы Цикл
		Если (НЕ Стрэлемент.Отметка) или (ЗначениеЗаполнено(СтрЭлемент.GUID)) Тогда
			Продолжить; // Уже создан в Меркурий
		КонецЕсли;
		// Юзер наколбасил в ТЧ
		Если НЕ ЗначениеЗаполнено(СтрЭлемент.Продукция) или
			НЕ ЗначениеЗаполнено(СтрЭлемент.ВидПродукции) или
			НЕ ЗначениеЗаполнено(СтрЭлемент.Номенклатура) или 
			НЕ ЗначениеЗаполнено(СтрЭлемент.ЕдиницаИзмерения)	Тогда
				Сообщить("Обязательные реквизиты не заполнены !!!");
				Продолжить;
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрЭлемент.Продукция_Элемент) Тогда
			СтрЭлемент.Продукция_Элемент = СоздатьПродукцияЭлемент(СтрЭлемент);
			Если НЕ ЗначениеЗаполнено(СтрЭлемент.Продукция_Элемент) Тогда
				Сообщить("Что-то пошло не так. Не создался Продукция Элемент для "+СтрЭлемент.Номенклатура);
				Продолжить;
			КонецЕсли;
			ВСД.Установить_Соответствие_ВСД_Продукция_Элемент(СтрЭлемент.Номенклатура,СтрЭлемент.Продукция_Элемент);
		КонецЕсли;
		
		Если НЕ (СтрЭлемент.Продукция_Элемент.Площадка = Отправитель_Площадка) Тогда
			Сообщить("Не совпадает Площадка с установленной у "+СтрЭлемент.Продукция_Элемент+" -> ПРОПУСКАЮ");
			Продолжить;
		КонецЕсли;
		
		Попытка 
			Обработка.Изменить_Продукцию(СтрЭлемент.Продукция_Элемент,"CREATE");
			СтрЭлемент.GUID = СтрЭлемент.Продукция_Элемент.GUID;
		Исключение
			Сообщить("Что-то пошло не так. Не удалось создать в Меркурий "+СтрЭлемент.Продукция_Элемент);
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	//Перечитаем
	//ЗаполнитьНоменклатуруВТЗ();
КонецФункции

Функция ИзменитьВСДЭлементы() Экспорт
	// Создает элемент справочника ВСД_Продукция_Элемент при отсутствии
	// Устанавливает Соответствие с Номенклатурой
	// Создает в Меркурии Продукццию
	Если (Не ЗначениеЗаполнено(Отправитель_Площадка)) или (Не ЗначениеЗаполнено(Организация)) Тогда
		Сообщить("Укажите Организацию и Площадку");
		Возврат "";
	КонецЕсли;
	//Подготовим к отправке/получению основной модуль
	Обработка = ВСД.ИнициализацияОбработки(Организация);
	Если типЗнч(Обработка) = Тип("Строка") тогда
		Сообщить("Не удалось инициализировать обработку Интеграция");
		Возврат "";
	КонецЕсли;
	
	Для каждого СтрЭлемент из ВСДЭлементы Цикл
		Если (НЕ Стрэлемент.Отметка) или НЕ(ЗначениеЗаполнено(СтрЭлемент.GUID)) Тогда
			Продолжить; // Уже создан в Меркурий
		КонецЕсли;
		// Юзер наколбасил в ТЧ
		Если НЕ ЗначениеЗаполнено(СтрЭлемент.Продукция) или
			НЕ ЗначениеЗаполнено(СтрЭлемент.ВидПродукции) или
			НЕ ЗначениеЗаполнено(СтрЭлемент.Номенклатура) или 
			НЕ ЗначениеЗаполнено(СтрЭлемент.ЕдиницаИзмерения)	Тогда
				Сообщить("Обязательные реквизиты не заполнены !!!");
				Продолжить;
			Продолжить;
		КонецЕсли;
		
		Если НЕ (СтрЭлемент.Продукция_Элемент.Площадка = Отправитель_Площадка) Тогда
			Сообщить("Не совпадает Площадка с установленной у "+СтрЭлемент.Продукция_Элемент+" -> ПРОПУСКАЮ");
			Продолжить;
		КонецЕсли;
		
		Попытка 
			Обработка.Изменить_Продукцию(СтрЭлемент.Продукция_Элемент,"UPDATE");
			СтрЭлемент.GUID = СтрЭлемент.Продукция_Элемент.GUID;
		Исключение
			Сообщить("Что-то пошло не так. Не удалось создать в Меркурий "+СтрЭлемент.Продукция_Элемент);
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	//Перечитаем
	//ЗаполнитьНоменклатуруВТЗ();
КонецФункции
