&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭлементОтбора = ЭтаФорма.дсЗапросы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ; 
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	
	Если НЕ ЗначениеЗаполнено( Объект.ДатаИзготовления2 ) Тогда 
		ЭтаФорма.Элементы.ДатаИзготовления2.Видимость = Ложь;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено( Объект.ДатаИзготовления ) Тогда 
		ЭтаФорма.Элементы.ДатаИзготовления.Видимость = Ложь;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено( Объект.ДатаСрокГодности2 ) Тогда 
		ЭтаФорма.Элементы.ДатаСрокГодности2.Видимость = Ложь;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено( Объект.ДатаСрокГодности ) Тогда 
		ЭтаФорма.Элементы.ДатаСрокГодности.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры
