&НаКлиенте
Процедура ОбновитьСоответствия()
	ЭтаФорма.дсСоответствия.Отбор.Элементы.Очистить();
	ЭлементОтбора = ЭтаФорма.дсСоответствия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозСубъект");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ; // Опционально
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьСоответствия();
КонецПроцедуры

&НаКлиенте
Процедура дсСоответствияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
    Отказ = Истина;
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", Истина, Истина);	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыПодбора, Элементы.дсСоответствия);
КонецПроцедуры
