
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
// для 8.2 с общим модулем  РаботаСДиалогами
// Вывести команду в Общий журнал
//	РаботаСДиалогами.ПоказатьСтруктуруПодчиненностиДокумента(ПараметрКоманды);
	
//		ОткрытьФорму("ОбщаяФорма.СтруктураПодчиненности",Новый Структура("ОбъектОтбора", ПараметрКоманды),
//				ПараметрыВыполненияКоманды.Источник,
//				ПараметрыВыполненияКоманды.Источник.КлючУникальности,
//				ПараметрыВыполненияКоманды.Окно);	
КонецПроцедуры
