Перем мНеОткрыватьФормуДокумента Экспорт;  //Запрешает открывать форму при вводе на основании, если уже введен ВСД 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг")  или
		(ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров")) Тогда

			// Заполнение шапки
			ДокументОснование = ДанныеЗаполнения.Ссылка;
			ПараметрыОрганизации = ВСД.ЗагрузитьПараметры( ДанныеЗаполнения.Организация );
		Если НЕ ЗначениеЗаполнено(ПараметрыОрганизации.Получить("ПарамРазрешитьВводНаОснованииБолееОдногоВСД")) Тогда
			Сообщить("Проверьте и пересохраните параметры для Организации "+ДанныеЗаполнения.Организация);
			Возврат;
		КонецЕсли;			
			Если НЕ ПараметрыОрганизации.Получить("ПарамРазрешитьВводНаОснованииБолееОдногоВСД") Тогда
			
				ДокВСД = ВСД.НайтиВСД_Производство(ДанныеЗаполнения.Ссылка);
				Если ЗначениеЗаполнено(ДокВСД) Тогда
					//Сообщить("Уже создан "+ДокВСД);
					мНеОткрыватьФормуДокумента = Истина;
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
			Дата =  ДанныеЗаполнения.Дата;
			Организация = ДанныеЗаполнения.Организация;
			
			Обработка = ВСД.ИнициализацияОбработки(Организация,ложь);   // воспользуемся ф-цией ЗаполнитьТЧВСД() или РассчитатьКоличествоДляВСД()
			
			Если типЗнч(Обработка) = Тип("Строка") тогда
				Сообщить("Не удалось инициализировать обработку Интеграция - документ не будет автоматически заполнен!!!");
				ЕстьОбработка = Ложь;
			Иначе
			    ЕстьОбработка = Истина;
			КонецЕсли;
			
			Попытка	
				СписокПараметров = Обработка.ПолучитьДанныеДляСозданияВСДПроизводство(ДанныеЗаполнения.Ссылка);
				Обработка.ВСД_Производство_ВводНаОсновании(ЭтотОбъект, СписокПараметров, ПараметрыОрганизации);
				Возврат;
				//Обработка.ЗаполнитьШапку_ВСД_Производство(ЭтотОбъект, СписокПараметров, ПараметрыОрганизации);
				//Обработка.ЗаполнитьТЧПроизводство(СписокПараметров.ДокОснование, ЭтотОбъект,,,,СписокПараметров.СтрокиВСД);
			Исключение
				Сообщить("Не удалось заполнить документ обработкой -> заполняем вводом на основании");
				Сообщить(ОписаниеОшибки(),СтатусСообщения.Важное);
				ЕстьОбработка = Ложь;
			КонецПопытки;
			
			Если Не ЕстьОбработка Тогда
				Производитель_ХозСубъект = ПараметрыОрганизации.Получить("Отправитель_ХозСубъект");//ВСД.НайтиХозСубъект(КонтрагентОрганизации);
				Попытка
					Производитель_Площадка = ВСД.НайтиПлощадкуПоСкладу(ДокументОснование.Склад, Производитель_ХозСубъект);
				Исключение
					Производитель_Площадка = ПараметрыОрганизации.Получить("Отправитель_Площадка");
				КонецПопытки;
				ЗавершитьОперацию = true;
				cargoInspected = true;
				РезультатыИсследований = ПараметрыОрганизации.Получить("ВСД_РезультатыИсследований");//Перечисления.ВСД_РезультатИсследования.VSEFULL;
			
				ПропускатьПустыеСвойства = ПараметрыОрганизации.Получить("ПропускатьПустыеСвойства");
				
				Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
					Продукция_Элемент = ВСД.Получить_ВСД_Продукция_Элемент( ТекСтрокаТовары.Номенклатура );
					Если ПропускатьПустыеСвойства Тогда
						Если НЕ ЗначениеЗаполнено(Продукция_Элемент) Тогда
							Сообщить("Не указано соответствие для "+ТекСтрокаТовары.Номенклатура+" -> в параметрах указано Пропускать");
							Продолжить;
						КонецЕсли;
					КонецЕсли;
				
					НоваяСтрока = Продукция.Добавить();
					НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
					НоваяСтрока.Продукция_Элемент = Продукция_Элемент;//ВСД.Получить_ВСД_Продукция_Элемент( НоваяСтрока.Номенклатура );
				
					НоваяСтрока.Продукция = НоваяСтрока.Продукция_Элемент.Продукция ;
					НоваяСтрока.ВидПродукции =  НоваяСтрока.Продукция_Элемент.ВидПродукции;
					НоваяСтрока.НаименованиеПродукции =  НоваяСтрока.Продукция_Элемент.Наименование;
					НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Продукция_Элемент.ЕдиницаИзмерения;	
				    Попытка
						НоваяСтрока.Количество = Обработка.РассчитатьКоличествоДляВСД(ТекСтрокаТовары);
					Исключение
						НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
					КонецПопытки;
					НоваяСтрока.ДатаИзготовления1 = ДанныеЗаполнения.Дата;
					НоваяСтрока.ДатаСрокГодности1 = НоваяСтрока.ДатаИзготовления1+60*60*24*НоваяСтрока.Продукция_Элемент.СрокГодности;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецПроцедуры
	
	мНеОткрыватьФормуДокумента = ложь;

