
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокВидовПродукции.ЗагрузитьЗначения(Параметры.ВидыПродукции);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	СписокВидовПродукции.ЗаполнитьПометки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	СписокВидовПродукции.ЗаполнитьПометки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	Результат = Новый Массив();
	
	Для Каждого Стр Из СписокВидовПродукции Цикл
	
		Если Стр.Пометка Тогда
			Результат.Добавить(Стр.Значение);	
		КонецЕсли;
	
	КонецЦикла;

	Закрыть(Результат);
	
КонецПроцедуры
