Перем мНеОткрыватьФормуДокумента Экспорт;  //Запрешает открывать форму при вводе на основании, если уже введен ВСД Транзакция

Функция ПолучитьДанныеДляСозданияВСДТранзакции( ПараметрыОрганизации ) 
// вызов переопределения
	//Обработка = ФункцияПереопределена("ПолучитьДанныеДляСозданияВСДТранзакции");
	//Если обработка <> Неопределено Тогда
	//	Возврат Обработка.ПолучитьДанныеДляСозданияВСДТранзакции(ЭтотОбъект, ДокументОснование, Получатель_Хозсубъект, Получатель_Площадка);
	//КонецЕсли;	
	
	Рез = Новый Структура;
	
	////Если ДокументОснование <> Неопределено Тогда //Заполним все по основанию
		// При вызове из Вввод на соновании - инициализация Обработки, проведена - СписокКонстант Заполнен нужными данными 
		//_Отправитель_ХозСубъект = ПараметрыОрганизации["Отправитель_ХозСубъект");			
		//_Перевозчик_ХозСубъект = ПараметрыОрганизации["Перевозчик_ХозСубъект");
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			//Если СписокКонстант["ПарамФильтроватьРеализациюПоСкладуПлощадкиОтправителя") Тогда
			Если ПараметрыОрганизации["ПарамФильтроватьРеализациюПоСкладуПлощадкиОтправителя"] Тогда   // Определим нашу площадку по Складу
				_Отправитель_Площадка = ВСД.НайтиПлощадкуПоСкладу(ДокументОснование.Склад, ПараметрыОрганизации["Отправитель_ХозСубъект"]);
				//Отправитель_Площадка = _Отправитель_Площадка;
			Иначе
				_Отправитель_Площадка = ПараметрыОрганизации["Отправитель_Площадка"];
			КонецЕсли;
			_Получатель_ХозСубъект = ВСД.НайтиХозСубъект(ДокументОснование.Контрагент);				
			Если ПараметрыОрганизации["РеквизитГрузополучатель"] = 0 Тогда 
				//контрагент
				_Получатель_Площадка = ВСД.НайтиПлощадкуПоКонтрагенту(ДокументОснование.Контрагент);
			Иначе
				//Адрес доставки
				_Получатель_Площадка = ВСД.НайтиПлощадкуПоКонтрагенту(ДокументОснование.АдресДоставки);
			КонецЕсли;
				
		Иначе //Перемещение
			_Отправитель_Площадка = ВСД.НайтиПлощадкуПоСкладу(ДокументОснование.СкладОтправитель, ПараметрыОрганизации["Отправитель_ХозСубъект"]);
			//Отправитель_Площадка = _Отправитель_Площадка;
			_Получатель_ХозСубъект = ПараметрыОрганизации["Отправитель_ХозСубъект"];
			_Получатель_Площадка = ВСД.НайтиПлощадкуПоСкладу(ДокументОснование.СкладПолучатель, _Получатель_ХозСубъект);
		КонецЕсли;
		//Рез.Вставить("Организация",ДокументОснование.Организация);
		Рез.Вставить("Отправитель_Хозсубъект", 	ПараметрыОрганизации["Отправитель_ХозСубъект"]);  // Взяли из реквизитов обработки - активные данные
		Рез.Вставить("Отправитель_Площадка", 	_Отправитель_Площадка);
		Рез.Вставить("Получатель_Хозсубъект", 	_Получатель_Хозсубъект); // в параметре получили
		Рез.Вставить("Получатель_Площадка", 	_Получатель_Площадка);
//		Рез.Вставить("Перевозчик_ХозСубъект",_Перевозчик_ХозСубъект);
		//Рез.Вставить("ДокОснование",ДокументОснование);
		//Рез.Вставить("СтрокиВСД", ВСД_Общий.ЗаполнитьТабЧастьЭлементовДляСозданияВСД( ПараметрыОрганизации,  неопределено, ДокументОснование));
		//Рез.Вставить("СтрокиВСД", ЗаполнитьТабЧастьВсдПоОснованию( ПараметрыОрганизации,  ДокументОснование));
		
	
	Возврат Рез;
КонецФункции

Процедура ОбработкаЗаполнения( ДанныеЗаполнения, СтандартнаяОбработка)
	ОтПоставщика = ложь; // временно
	
	Если (ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг")) или
		(ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров")) Тогда
		// Заполнение шапки
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Организация = ДокументОснование.Организация;
		
		ПараметрыОрганизации = ВСД.ЗагрузитьПараметры( Организация );
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыОрганизации );
		
		ЭтоПеремещениеОтПоставщика = ОтПоставщика;
		
		//Найдем уже созданный
		Если НЕ ЗначениеЗаполнено(ПараметрыОрганизации["ПарамРазрешитьВводНаОснованииБолееОдногоВСД"]) Тогда
			Сообщить("Проверьте и сохраните параметры для Организации "+ДанныеЗаполнения.Организация);
			Возврат;
		КонецЕсли;
		Если НЕ ПараметрыОрганизации["ПарамРазрешитьВводНаОснованииБолееОдногоВСД"] Тогда
			ДокВСД = ВСД.НайтиВСД(ДанныеЗаполнения.Ссылка,ОтПоставщика);
			Если ЗначениеЗаполнено(ДокВСД) Тогда
				мНеОткрыватьФормуДокумента = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	
		//Если ОтПоставщика Тогда
		//	СписокПараметров = ВСД_Общий.ПолучитьДанныеДляСозданияВСДПеремещения( ПараметрыОрганизации,Неопределено, ДанныеЗаполнения.Ссылка);
		//	Комментарий = "Перемещение от поставщика на основании "+ДанныеЗаполнения;
		//Иначе
			ПараметрыДокумента = ПолучитьДанныеДляСозданияВСДТранзакции( ПараметрыОрганизации );  //!!!!
		//КонецЕсли;
		//ВСД_Общий.ЗаполнитьШапку_ВСД2_Транзакция( ЭтотОбъект, СписокПараметров, ПараметрыОрганизации );
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыДокумента );
		
		Дата = ?(ЗначениеЗаполнено(ДокументОснование), ДокументОснование.Дата, ТекущаяДата());			
		//Перевозчик_ХозСубъект = ПараметрыОрганизации["Перевозчик_ХозСубъект"];
		ТтнСерия = ""; 
		ТтнНомер = ВСД_Общий.ПолучитьНомерДокБезПрефикса( ДокументОснование );
		ТтнДата = Дата; 
		номерАвто = ВСД_Общий.ПолучитьНомерАвто( ДокументОснование ); 
		
		Местность 		= ПараметрыОрганизации["ВСД_Местность"];
		ОсобыеОтметки 	= ПараметрыОрганизации["ВСД_ОсобыеОтметки"];
		cargoInspected  	= истина;			
		РезультатыИсследований = ПараметрыОрганизации["ВСД_РезультатыИсследований"]; 
		//ТермическиеУсловияПеревозки = ПараметрыОрганизации["ТермическиеУсловияПеревозки"];
		
		ВСД_Общий.ЗаполнитьТабЧастьВСД( ПараметрыОрганизации, ДокументОснование, ЭтотОбъект );
		
	ИначеЕсли ( ТипЗнч(ДанныеЗаполнения) = Тип("Структура") ) Тогда 
		
		//ОтПоставщика = Ложь;
		//Если ТипЗнч(ВходДанные)=Тип("Структура") Тогда
		//	Попытка
		//    	ОтПоставщика =  ВходДанные.ОтПоставщика;
		//		ДанныеЗаполнения = ВходДанные.Основание;
		//	Исключение
		//		ДанныеЗаполнения = Неопределено;
		//	КонецПопытки;
		//Иначе
		//	ДанныеЗаполнения = ВходДанные;
		//КонецЕсли;
		
		ПараметрыДокумента = ДанныеЗаполнения.ПараметрыДокумента;
		тзАктуальныхПартий = ДанныеЗаполнения.тзАктуальныхПартий;		
		ДокументОснование  = ПараметрыДокумента.ДокОснование;
		Организация = ДокументОснование.Организация;
		
		ПараметрыОрганизации = ВСД.ЗагрузитьПараметры( Организация );
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыОрганизации );
		//ДокументОснование = ДанныеЗаполнения.Ссылка;
		//ЭтоПеремещениеОтПоставщика = ОтПоставщика;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыДокумента);
		
		Дата = ?(ЗначениеЗаполнено(ДокументОснование), ДокументОснование.Дата, ТекущаяДата());			
		//Перевозчик_ХозСубъект = ПараметрыОрганизации["Перевозчик_ХозСубъект"];
		ТтнСерия = ""; 
		ТтнНомер = ВСД_Общий.ПолучитьНомерДокБезПрефикса( ДокументОснование );
		ТтнДата = Дата; 
		номерАвто = ВСД_Общий.ПолучитьНомерАвто( ДокументОснование ); 
		
		Местность 		= ПараметрыОрганизации["ВСД_Местность"];
		ОсобыеОтметки 	= ПараметрыОрганизации["ВСД_ОсобыеОтметки"];
		cargoInspected  	= истина;			
		РезультатыИсследований = ПараметрыОрганизации["ВСД_РезультатыИсследований"]; 
		//ТермическиеУсловияПеревозки = ПараметрыОрганизации["ТермическиеУсловияПеревозки"];
		//Попытка	ЗаполнитьСвязанныеДокументы(ДокВСД); Исключение КонецПопытки; //Транзакция 1.4
			
		ВСД_Общий.ЗаполнитьТабЧастьВСД( ПараметрыОрганизации, ДокументОснование, ЭтотОбъект, тзАктуальныхПартий );
			
	КонецЕсли;
КонецПроцедуры

мНеОткрыватьФормуДокумента = ложь;
