Перем мНеОткрыватьФормуДокумента Экспорт;  //Запрешает открывать форму при вводе на основании, если уже введен ВСД Транзакция

Процедура ОбработкаЗаполнения(ВходДанные, СтандартнаяОбработка)
	ОтПоставщика = Ложь;
	Если ТипЗнч(ВходДанные)=Тип("Структура") Тогда
		Попытка
        	ОтПоставщика =  ВходДанные.ОтПоставщика;
			ДанныеЗаполнения = ВходДанные.Основание;
		Исключение
			ДанныеЗаполнения = Неопределено;
		КонецПопытки;
	Иначе
		ДанныеЗаполнения = ВходДанные;
	КонецЕсли;
	
	Если (ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг")) или
		(ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров")) Тогда
		// Заполнение шапки
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		
		ПараметрыОрганизации = ВСД.ЗагрузитьПараметры( ДанныеЗаполнения.Организация );
		ЭтоПеремещениеОтПоставщика = ОтПоставщика;
		
		//Найдем уже созданный
		Если НЕ ЗначениеЗаполнено(ПараметрыОрганизации.Получить("ПарамРазрешитьВводНаОснованииБолееОдногоВСД")) Тогда
			Сообщить("Проверьте и сохраните параметры для Организации "+ДанныеЗаполнения.Организация);
			Возврат;
		КонецЕсли;
		Если НЕ ПараметрыОрганизации.Получить("ПарамРазрешитьВводНаОснованииБолееОдногоВСД") Тогда
			ДокВСД = ВСД.НайтиВСД(ДанныеЗаполнения.Ссылка,ОтПоставщика);
			Если ЗначениеЗаполнено(ДокВСД) Тогда
				мНеОткрыватьФормуДокумента = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	
		//Если ОтПоставщика Тогда
		//	СписокПараметров = ВСД_Общий.ПолучитьДанныеДляСозданияВСДПеремещения( ПараметрыОрганизации,Неопределено, ДанныеЗаполнения.Ссылка);
		//	Комментарий = "Перемещение от поставщика на основании "+ДанныеЗаполнения;
		//Иначе
			СписокПараметров = ВСД_Общий.ПолучитьДанныеДляСозданияВСДТранзакции( ПараметрыОрганизации, ДанныеЗаполнения.Ссылка);
		//КонецЕсли;
		ВСД_Общий.ЗаполнитьШапку_ВСД2_Транзакция( ЭтотОбъект, СписокПараметров, ПараметрыОрганизации );
		ВСД_Общий.ЗаполнитьТабЧастьВСД( ПараметрыОрганизации, СписокПараметров.ДокОснование, ЭтотОбъект );
	Иначе
//		Сообщить("Не переданы данные для заполнения");
	КонецЕсли;
КонецПроцедуры

мНеОткрыватьФормуДокумента = ложь;
