Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если (ТипЗнч(ДанныеЗаполнения) = Тип("ТаблицаЗначений")) Тогда 
		
		ПараметрыОрганизации = ВСД.ЗагрузитьПараметры( Организация );
	
		Для Каждого СтрПартии из ДанныеЗаполнения Цикл
			Если СтрПартии.Количество >= СтрПартии.КоличествоСписания Тогда
			    Продолжить;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрПартии.ВСД_Продукция_Элемент)  Тогда
			    Продолжить;
			КонецЕсли;


			разница = СтрПартии.КоличествоСписания - СтрПартии.Количество;
			НоваяСтрока = Продукция.Добавить();
			НоваяСтрока.Продукция_Элемент 	= СтрПартии.ВСД_Продукция_Элемент;
			НоваяСтрока.Количество 			= разница;//тзПартии.Количество;
			НоваяСтрока.Продукция 			= НоваяСтрока.Продукция_Элемент.Продукция;
			НоваяСтрока.ВидПродукции 		= НоваяСтрока.Продукция_Элемент.ВидПродукции;
			НоваяСтрока.ЕдиницаИзмерения 	= НоваяСтрока.Продукция_Элемент.ЕдиницаИзмерения;
			Если Не ЗначениеЗаполнено( НоваяСтрока.ЕдиницаИзмерения ) Тогда 
				ВСД.СообщитьИнфо("Не заполнена ЕдиницаИзмерения в "+НоваяСтрока.Продукция_Элемент);	
			КонецЕсли;
			НоваяСтрока.НаименованиеПродукции = НоваяСтрока.Продукция_Элемент.Наименование;
			НоваяСтрока.ДатаИзготовления1 = Дата;
			//Если КонДата>НачДата Тогда
			//	НоваяСтрока.ДатаИзготовления2 = КонДата;
			//КонецЕсли;
			НоваяСтрока.ДатаСрокГодности1 = Дата + НоваяСтрока.Продукция_Элемент.СрокГодности*60*60;
			НоваяСтрока.Производитель_площадка = Владелец_Площадка;
			НоваяСтрока.Производитель_Страна = ПараметрыОрганизации["Страна"];
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
