
Процедура ЗаполнитьРеквизитыСтроки(СтрокаТЧ)
	
	Если ЗначениеЗаполнено(СтрокаТЧ.Партия) Тогда
		ЗаполнитьЗначенияСвойств( СтрокаТЧ, СтрокаТЧ.Партия);
		СтрокаТЧ.ДатаСрокГодности1 = кб99_ВСД_Запросы.СтрокаВДатаВремя( СтрокаТЧ.Партия.ДатаСрокГодности1);
		СтрокаТЧ.ДатаИзготовления1 = кб99_ВСД_Запросы.СтрокаВДатаВремя( СтрокаТЧ.Партия.ДатаИзготовления1);
		СтрокаТЧ.ДатаСрокГодности2 = кб99_ВСД_Запросы.СтрокаВДатаВремя( СтрокаТЧ.Партия.ДатаСрокГодности2);
		СтрокаТЧ.ДатаИзготовления2 = кб99_ВСД_Запросы.СтрокаВДатаВремя( СтрокаТЧ.Партия.ДатаИзготовления2);
	Иначе
		ЗаполнитьЗначенияСвойств( СтрокаТЧ, СтрокаТЧ.Продукция_Элемент)
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаТЧ.Производитель_Площадка) Тогда
		СтрокаТЧ.Производитель_Страна = СтрокаТЧ.Производитель_Площадка.Страна;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если (ТипЗнч(ДанныеЗаполнения) = Тип("ТаблицаЗначений")) Тогда 
		
		ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры( Организация );
		
		Для Каждого СтрПартии Из ДанныеЗаполнения Цикл
			Если СтрПартии.Количество >= СтрПартии.КоличествоСписания Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрПартии.Продукция_Элемент)  Тогда
				Продолжить;
			КонецЕсли;
			
			
			разница = СтрПартии.КоличествоСписания - СтрПартии.Количество;
			НоваяСтрока = Продукция.Добавить();
			НоваяСтрока.Продукция_Элемент 	= СтрПартии.Продукция_Элемент;
			НоваяСтрока.Количество 			= разница;//тзПартии.Количество;
			НоваяСтрока.Продукция 			= НоваяСтрока.Продукция_Элемент.Продукция;
			НоваяСтрока.ВидПродукции 		= НоваяСтрока.Продукция_Элемент.ВидПродукции;
			НоваяСтрока.ЕдиницаИзмерения 	= НоваяСтрока.Продукция_Элемент.ЕдиницаИзмерения;
			Если Не ЗначениеЗаполнено( НоваяСтрока.ЕдиницаИзмерения ) Тогда 
				кб99_ВСД.СообщитьИнфо("Не заполнена ЕдиницаИзмерения в "+НоваяСтрока.Продукция_Элемент);	
			КонецЕсли;
			НоваяСтрока.НаименованиеПродукции = НоваяСтрока.Продукция_Элемент.Наименование;
			НоваяСтрока.ДатаИзготовления1 = Дата;
			//Если КонДата>НачДата Тогда
			//	НоваяСтрока.ДатаИзготовления2 = КонДата;
			//КонецЕсли;
			НоваяСтрока.ДатаСрокГодности1 = Дата + НоваяСтрока.Продукция_Элемент.СрокГодности*86400;
			НоваяСтрока.Производитель_площадка = Владелец_Площадка;
			НоваяСтрока.Производитель_Страна = ПараметрыОрганизации["Страна"];
		КонецЦикла;
	ИначеЕсли ( ТипЗнч(ДанныеЗаполнения) = Тип("Структура") ) Тогда 
		ЭтотОбъект.Организация = ДанныеЗаполнения.ПараметрыДокумента.Организация;
		ЭтотОбъект.Владелец_Площадка = ДанныеЗаполнения.ПараметрыДокумента.Отправитель_Площадка;
		ЭтотОбъект.Владелец_ХозСубъект   =   ДанныеЗаполнения.ПараметрыДокумента.Отправитель_ХозСубъект;
		ЭтотОбъект.ПричинаРасхождения    =   ДанныеЗаполнения.ПараметрыДокумента.парамПричинаРасхождения;
		ЭтотОбъект.ОписаниеНесоответствия =  ДанныеЗаполнения.ПараметрыДокумента.парамОписаниеНесоответствия;
		Если ДанныеЗаполнения.Свойство("Партии") Тогда 
			Для Каждого стрПартия из ДанныеЗаполнения.Партии Цикл
				СтрТовары = ЭтотОбъект.Продукция.Добавить();
				ЗаполнитьЗначенияСвойств( стрТовары, стрПартия );
				ЗаполнитьРеквизитыСтроки(СтрТовары);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
