Функция ПечатьДокумента()
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("Макет");
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	//УПП
	ОбластьМакета.Параметры.НомерДок = СсылкаНаОбъект.Номер;
	//ОбщегоНазначения.ПолучитьНомерНаПечать(СсылкаНаОбъект);//СсылкаНаОбъект.Номер;
	//БП3
	//ОбластьМакета.Параметры.НомерДок = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СсылкаНаОбъект.Номер, Истина, Ложь);
	
	ОбластьМакета.Параметры.ДатаДок = Формат(СсылкаНаОбъект.Дата,"ДЛФ=Д");
	
	ТабДокумент.Вывести(ОбластьМакета);
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	ВСД2_транзакция.Ссылка КАК Ссылка1,
	|	ВСД2.Ссылка КАК ВСД2
	|ИЗ
	|	Документ.ВСД2 КАК ВСД2
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВСД2_транзакция КАК ВСД2_транзакция
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ПО ВСД2_транзакция.ДокументОснование = РеализацияТоваровУслуг.Ссылка
	|		ПО ВСД2.ДокументОснование = ВСД2_транзакция.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	ВСД_транзакция.Ссылка КАК Ссылка1,
	|	ВСД.Ссылка КАК ВСД2
	|ИЗ
	|	Документ.ВСД КАК ВСД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВСД_транзакция КАК ВСД_транзакция
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ПО ВСД_транзакция.ДокументОснование = РеализацияТоваровУслуг.Ссылка
	|		ПО ВСД.ДокументОснование = ВСД_транзакция.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка";
 
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект); //используем в качестве параметра реквизит обработки СсылкаНаОбъект
	ЭтоПеремещение = ложь;
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РеализацияТоваровУслуг","ПеремещениеТоваров");
		ЭтоПеремещение = истина;
	КонецЕсли;
	ОбластьМакета = Макет.ПолучитьОбласть("ОбластьШтрихкод");
	
	Шапка = Запрос.Выполнить().Выбрать();
	Пока Шапка.Следующий() цикл
		докВСД = Шапка.ВСД2;
		//БП 3
		//СведенияОГрузополучателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(докВСД.Получатель_Площадка.Контрагент,  докВСД.Дата);
		// ПечГрузополучатель = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ИНН,ФактическийАдрес");
		
		//УПП
		//СведенияОГрузополучателе  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(докВСД.Получатель_Площадка.Контрагент,  докВСД.Дата);
		//ПечГрузополучатель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ИНН,ФактическийАдрес");;
		//УПП
		ПечНомерТТН = СокрЛП(докВСД.ттнНомер);//ОбщегоНазначения.ПолучитьНомерНаПечать(СсылкаНаОбъект);
		
		//БП3
		//ПечНомерТТН = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СсылкаНаОбъект.Номер, Истина, Ложь);
		
		// для перемещения нет Контрагента, также нет контрагента при АдресеДоставки - возьмем данные из площадки
		ПечГрузополучатель   = СокрЛП(докВСД.Получатель_Площадка.Наименование)+", Адрес: " +СокрЛП(докВСД.Получатель_Площадка.Адрес);
		
		тВСД = "Ветеринарное свидетельство (оформлен) Код: "+докВСД.UUID;
		тОтправитель = "Фирма-отправитель: "+ СсылкаНаОбъект.Организация.НаименованиеПолное+", ИНН:"+ 
			СсылкаНаОбъект.Организация.ИНН+", ТТН: № "+ПечНомерТТН+" от "+СсылкаНаОбъект.Дата;
		Если ЭтоПеремещение тогда
			тПолучатель = "Фирма-получатель: "+СсылкаНаОбъект.Организация.НаименованиеПолное+", ИНН:"+СсылкаНаОбъект.Организация.ИНН; 
		иначе
			тПолучатель = "Фирма-получатель: "+СсылкаНаОбъект.Контрагент.НаименованиеПолное+", ИНН: "+СсылкаНаОбъект.Контрагент.ИНН; 
		КонецЕсли;
		//СведенияОГрузополучателе  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(докВСД.Получатель_Площадка.Контрагент,  докВСД.Дата);
		//тПлощадка = "Предприятие-получатель: "+ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ИНН,ФактическийАдрес");;
		тПлощадка = "Предприятие-получатель: "+ПечГрузополучатель;//ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ИНН,ФактическийАдрес");;
		тПродукция = "Продукция: "+докВСД.НаименованиеПродукции +", "+докВСД.Количество+" кг";
		
		Если ЗначениеЗаполнено(докВСД.ДатаИзготовления1) Тогда
			тВыработано = "Выработана: "+Формат(докВСД.ДатаИзготовления1,"ДФ=dd.MM.yyyy; ДЛФ=D; ДП=-")+"-"+Формат(докВСД.ДатаИзготовления2,"ДФ=dd.MM.yyyy; ДЛФ=D; ДП=-");					
		Иначе
			тВыработано = "Выработана: " + Сокрлп(докВСД.ДатаИзготовления);
		КонецЕсли;
		Если ЗначениеЗаполнено(докВСД.ДатаСрокГодности1) Тогда
			тВыработано = тВыработано + 
			" срок годности: "+ Формат(докВСД.ДатаСрокГодности1,"ДФ=dd.MM.yyyy; ДЛФ=D; ДП=-")+"-"+Формат(докВСД.ДатаСрокГодности2,"ДФ=dd.MM.yyyy; ДЛФ=D; ДП=-");
		Иначе
			тВыработано = тВыработано + " срок годности: "+ СокрЛП(докВСД.ДатаСрокГодности);
		КонецЕсли;
		
		тКод = "Код: "+докВСД.UUID;  
		тСгенерировано = "Сгенерировано системой '1С' "+ТекущаяДата()+" "+ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	   			 			
		шк = "http://mercury.vetrf.ru/pub/operatorui?_language=ru&_action=showVetDocumentFormByUuid&uuid= "+докВСД.UUID;	
		
		Попытка
			ОбластьМакета.Рисунки.Штрихкод.Объект.symbology = 58; // тип = QR
		    ОбластьМакета.Рисунки.Штрихкод.Объект.barcode = шк;
		исключение
			Сообщить("Не загружена ocvitabarcode.ocx - Печать QR кода невозможна");
		КонецПопытки;
		ОбластьМакета.Параметры.тВСД = тВСД;
		ОбластьМакета.Параметры.тОтправитель = тОтправитель;
		ОбластьМакета.Параметры.тПолучатель = тПолучатель;
		ОбластьМакета.Параметры.тПлощадка = тПлощадка;
		ОбластьМакета.Параметры.тПродукция = тПродукция;
		ОбластьМакета.Параметры.тВыработано = тВыработано;
		ОбластьМакета.Параметры.тКод = тКод;
		ОбластьМакета.Параметры.тСгенерировано = тСгенерировано;
		
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;

	
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ИмяПараметровПечати = "Удостоверение качества";
	
	
	Возврат ТабДокумент;
	
 
КонецФункции // ПечатьДокумента()

// Функция является точкой входа в данную обработку.
// Алгоритм заполнения печатной формы удобно размещать в отдельной(ых) функции(ях)
// Возвращаемое значение:
// Табличный документ - печатная форма накладной
//
Функция Печать() Экспорт
	
	ТабДокумент = ПечатьДокумента();
	Возврат ТабДокумент;
	
КонецФункции // Печать
	
