
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено Тогда
		ПараметрыДокумента = ДанныеЗаполнения.ПараметрыДокумента;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыДокумента);
		ЭтотОбъект.Получатель_ХозСубъект = Получатель_Площадка.ХозСубъект;
	
		ДокВСД = ДанныеЗаполнения.ДокВсд;
		тзМаршрутДоставки = ДокВСД.ТочкиМаршрута.Выгрузить();
		Для Каждого точкаМаршрута из тзМаршрутДоставки Цикл
			Если точкаМаршрута.Перегрузка И НЕ ЗначениеЗаполнено(точкаМаршрута.НомерТС) Тогда
				новаяТочка = ЭтотОбъект.ВСДВходящие.Добавить();
				новаяТочка.ДокВСД = ДокВСД;
				ЗаполнитьЗначенияСвойств( новаяТочка, точкаМаршрута );
				новаяТочка.НомерАвто = ДанныеЗаполнения.НомерАвто.НомерАвто;
				новаяТочка.номерПрицепа = ДанныеЗаполнения.НомерАвто.номерПрицепа;
			КонецЕсли;
		КонецЦикла;
		
		ВСДВходящие.Сортировать("НомерТочки");
	КонецЕсли;
	
КонецПроцедуры
