
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ПараметрыДокумента = ДанныеЗаполнения.ПараметрыДокумента;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыДокумента);
	ЭтотОбъект.Получатель_ХозСубъект = Получатель_Площадка.ХозСубъект;
	
	Для Каждого стрВсд из ДанныеЗаполнения.ДокВсд Цикл
		тзМаршрутДоставки = стрВсд.ДокВСД.ТочкиМаршрута.Выгрузить();
		Для Каждого точкаМаршрута из тзМаршрутДоставки Цикл
			//Если точкаМаршрута.Перегрузка И НЕ ЗначениеЗаполнено(точкаМаршрута.НомерТС) Тогда
			новаяТочка = ЭтотОбъект.ВСДВходящие.Добавить();
			ЗаполнитьЗначенияСвойств( новаяТочка, стрВсд );
			ЗаполнитьЗначенияСвойств( новаяТочка, точкаМаршрута );
			//КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	ВСДВходящие.Сортировать("НомерТочки");
	
КонецПроцедуры
