&НаКлиенте
Процедура ПредупреждениеПользователю(ТекстПредупреждения) Экспорт
    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждения", ЭтотОбъект);	
    ПоказатьПредупреждение( Оповещение,   ТекстПредупреждения,   0,   "Предупреждение" );
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеЗакрытияПредупреждения(Параметры) Экспорт	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыОтвет(Ответ, Парам) Экспорт
	
	ДокСсылка = Парам.ПараметрКоманды;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПоказатьОповещениеПользователя("Выполняем гашение ВСД",,"Ожидайте...",БиблиотекаКартинок.Информация32);
		// Если из журнала отправляем - закрывать его форму не нужно
		// ПараметрыВыполненияКоманды.Источник.ИмяФормы    есть ФормаСписка
		Если Парам.ЭтоОбъектВСД Тогда
			//Запишем, закроем форму, если это не форма списка
			Если Найти(Парам.ПараметрыВыполненияКоманды.Источник.ИмяФормы,"Списка") = 0 Тогда
				Парам.ПараметрыВыполненияКоманды.Источник.этаФорма.Закрыть();
			КонецЕсли;
		КонецЕсли;
		
		ТаблицаВсдДляГашения = Неопределено;
		ПараметрыОрганизации = ВСД.ЗагрузитьПараметры( ДокСсылка.Организация );				
		Ответ =  ВСД_Запросы.ПолучитьРезультат_ВСД2( ПараметрыОрганизации, ДокСсылка.applicationID, ДокСсылка, ложь, истина, ТаблицаВсдДляГашения );	
		
		Если Ответ="COMPLETED" Тогда 
			ПоказатьОповещениеПользователя("Выполняем Гашение ВСД",,"Ожидайте...",БиблиотекаКартинок.Информация32);
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("ТаблицаВсдДляГашения", ТаблицаВсдДляГашения);
			//СтруктураПараметров.Вставить("Организация", ДокСсылка.Организация );
			СтруктураПараметров.Вставить("Организация", ДокСсылка.ОрганизацияПолучатель );
			СтруктураПараметров.Вставить("Отправитель_ХозСубъект", ДокСсылка.Получатель_ХозСубъект );
			СтруктураПараметров.Вставить("Отправитель_Площадка", ДокСсылка.Получатель_Площадка );
			ОткрытьФорму("Обработка.Интеграция_ГИС_Меркурий.Форма.ФормаГашениеУФ",СтруктураПараметров,);
			
			ПоказатьОповещениеПользователя("Выполнено");
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДокСсылка = ПараметрКоманды;//ПараметрыВыполненияКоманды.Источник.Объект; ПараметрыВыполненияКоманды.Источник.ИмяФормы  // = Данные формы.Структура
	Если ВСД.ЕстьреквизитОбъекта("Статус",ДокСсылка) Тогда
		Если СокрЛП(ВСД.ПолучитьЗначениеРевизитаОбъекта_НаСервере(ДокСсылка,"Статус")) <> "COMPLETED" Тогда
			ПредупреждениеПользователю("Документ не отправлен");
			Возврат;
		КонецЕсли;
		ЭтоОбъектВСД = Истина;
	Иначе
		ЭтоОбъектВСД = Ложь;
	КонецЕсли;
	
	ТВопроса = "Погасить ВСД Поставщика ?";
	Парам = Новый Структура("ПараметрКоманды,ПараметрыВыполненияКоманды,ЭтоОбъектВСД",ПараметрКоманды, ПараметрыВыполненияКоманды, ЭтоОбъектВСД);
    Оповещение = Новый ОписаниеОповещения("ОбработкаКомандыОтвет",ЭтотОбъект,Парам);	
    ПоказатьВопрос(Оповещение, ТВопроса, РежимДиалогаВопрос.ДаНет,  0, КодВозвратаДиалога.Да, ""   );
КонецПроцедуры
