&НаСервере
Функция КомандаВыгрузитьНаСервере()
	
	ВыбРеализация = Объект;
	ЗаписьXML = Новый ЗаписьXML();
    ЗаписьXML.УстановитьСтроку();
	
	ОрганизацияXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("kb99", "СправочникОрганизации"));
	ОрганизацияXDTO.Ссылка = СериализаторXDTO.XMLСтрока(выбРеализация.Организация.Ссылка);
	ОрганизацияXDTO.Код = выбРеализация.Организация.Код;
	ОрганизацияXDTO.Наименование = выбРеализация.Организация.Наименование;
	
	КонтрагентXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("kb99", "СправочникКонтрагенты"));
	КонтрагентXDTO.Ссылка = СериализаторXDTO.XMLСтрока(выбРеализация.Контрагент.Ссылка);
	КонтрагентXDTO.Код = выбРеализация.Контрагент.Код;
	КонтрагентXDTO.Наименование = выбРеализация.Контрагент.Наименование;
	КонтрагентXDTO.НаименованиеПолное = выбРеализация.Контрагент.НаименованиеПолное;
	
	РеализацияXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("kb99", "ДокументРеализация"));
	РеализацияXDTO.Ссылка = СериализаторXDTO.XMLСтрока(выбРеализация.Ссылка);
	РеализацияXDTO.Дата = выбРеализация.Дата;
	РеализацияXDTO.Номер = выбРеализация.Номер;
	РеализацияXDTO.Контрагент = КонтрагентXDTO;
	РеализацияXDTO.Организация = ОрганизацияXDTO;
	
	ТоварыXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("kb99", "ТабличнаяЧасть"));
	
	Для Каждого сТовары Из выбРеализация.Товары Цикл
		НоменклатураXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("kb99", "СправочникНоменклатура"));
		НоменклатураXDTO.Ссылка = СериализаторXDTO.XMLСтрока(сТовары.Номенклатура);
		НоменклатураXDTO.Код = сТовары.Номенклатура.Код;
		НоменклатураXDTO.Наименование = сТовары.Номенклатура.Наименование;
		НоменклатураXDTO.НаименованиеПолное = сТовары.Номенклатура.НаименованиеПолное;
		
		сТоварыXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("kb99", "ДокументРеализацияТовары"));
		сТоварыXDTO.Номенклатура = НоменклатураXDTO;
		сТоварыXDTO.Количество = сТовары.Количество;
		сТоварыXDTO.Цена = сТовары.Цена;
		сТоварыXDTO.Сумма = сТовары.Сумма;
		
		ТоварыXDTO.Строки.Добавить(сТоварыXDTO);
	КонецЦикла;
	
	РеализацияXDTO.тчТовары = ТоварыXDTO;
				
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, РеализацияXDTO);
	ОбъектXDTO = ЗаписьXML.Закрыть();

	Соединение = WSСсылки.кб99Расш_Обмен.СоздатьWSПрокси("kb99_Obmen", "kb99_Obmen", "kb99_ObmenSoap");
	Соединение.Пользователь = "Администратор";
	Соединение.Пароль = "";
	Операция =  Соединение.ТочкаПодключения.Интерфейс.Операции.Получить("Receieve_doc");

	Возврат Соединение.Receieve_doc(ОбъектXDTO);

КонецФункции

&НаКлиенте
Процедура кб99Расш_кб99_ВыгрузитьПосле(Команда)
	
	Результат = КомандаВыгрузитьНаСервере();
		
	Сообщить(Результат);
	
КонецПроцедуры
