Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	Попытка
		ТекПользовательБазы = ПользователиИнформационнойБазы.ТекущийПользователь();
		ПользовательСпр = Справочники.Пользователи.НайтиПоНаименованию(ТекПользовательБазы.Имя);
		Если ПользовательСпр = Справочники.Пользователи.ПустаяСсылка() Тогда
			Сообщить("Пользователь "+ТекПользовательБазы.Имя+" не найден в справочнике ""Пользователи""");
			ПараметрыСеанса.ТекущийПользователь = "";
		Иначе
			ПараметрыСеанса.ТекущийПользователь = ПользовательСпр;
			//Сообщить("Текущий пользователь: "+ТекПользовательБазы.Имя);
		КонецЕсли;
	Исключение
		Сообщить("Не удалось получить текущего пользователя!");
	КонецПопытки;
	
КонецПроцедуры
