
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	кб99_ВСД_Общий.ОбновитьНадписи(ЭтаФорма);
	кб99_ВСД_Общий.УстановитьУсловноеОформление(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭлементОтбора = ЭтаФорма.дсЗапросы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСтроку()
	
	СтрокаТч = Элементы.ВСДВходящие.ТекущиеДанные;
	Если НЕ СтрокаТч.Перегрузка Тогда
		кб99_ВСД.СообщитьИнфо("Изменить Тип и Номер транспорта возможно только для точки прегрузки!");
		СтрокаТч.ТипТранспорта = Неопределено;
		СтрокаТч.НомерАвто = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВСДВходящиеТипТранспортаПриИзменении(Элемент)
	ПроверитьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ВСДВходящиеНомерТСПриИзменении(Элемент)
	ПроверитьСтроку();
КонецПроцедуры