&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Организация = Параметры.Организация;	
КонецПроцедуры

&НаКлиенте
Процедура кнСохранить(Команда)
	// Снятие модифицированности, т.к. перед закрытием признак проверяется.
	Модифицированность = Ложь;
	Отказ = Ложь;
	
	//Если НЕ ИспользоватьРеализациюПоНесколькимЗаказам Тогда
	//	Отказ = ПроверитьВыборНесколькихЗаказов();
	//КонецЕсли;
	//
	//Если Отказ Тогда
	//	ПоказатьПредупреждение(,НСтр("ru='Нельзя выбрать товары больше, чем по одному заказу.'"));
	//	Возврат
	//КонецЕсли;
	//
	//АдресТоваровВХранилище = ПоместитьТоварыВХранилище();
	
	//Закрыть();
	Если Перегрузка И НЕ ЗначениеЗаполнено(ТипТранспорта) Тогда
		кб99_ВСД.СообщитьИнфо("Заполните данные по траспортному средству!")
	Иначе
		Ответ = Новый Структура;
		//Ответ.Вставить( "SequenceNumber",SequenceNumber );
		Ответ.Вставить( "Площадка", Площадка );
		Ответ.Вставить( "ТипТранспорта", ТипТранспорта );
		Ответ.Вставить( "номерАвто", номеравто );
		Ответ.Вставить( "номерКонтейнера", номерКонтейнера );
		Ответ.Вставить( "номерПрицепа", номерПрицепа );
		Ответ.Вставить( "номерВагона", номерВагона );
		Ответ.Вставить( "НазваниеСудна", НазваниеСудна );
		Ответ.Вставить( "НомерАвиарейса", НомерАвиарейса );
		Ответ.Вставить( "Площадка", Площадка );
		Ответ.Вставить( "Страна", Страна );
		Ответ.Вставить( "Регион", Регион );
		Ответ.Вставить( "Район", Район );
		Ответ.Вставить( "Город", Город );
		Ответ.Вставить( "Улица", Улица );
		Ответ.Вставить( "Дом", Дом );
		Ответ.Вставить( "Строение", Строение );
		Ответ.Вставить( "Помещение", Помещение );
		Ответ.Вставить( "Название", Название );
		Ответ.Вставить( "Перегрузка", Перегрузка);
		ОповеститьОВыборе( Ответ );
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция кнЗагрузитьРайонНаСервере()
	
	ПараметрыФункции = кб99_ВСД.ЗагрузитьПараметры( Организация );
	Ответ = кб99_ВСД_Запросы.ИнициализацияХС_ЗагрузитьРайоны( ПараметрыФункции, Регион );
	Результат = Новый Структура;
	Результат.Вставить("ЗаданиеВыполнено", Истина);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура кнЗагрузитьРайон(Команда)
	
	Если ЗначениеЗаполнено(Регион) Тогда
		ПоказатьОповещениеПользователя("Выполняется обработка",,"Ожидайте...",БиблиотекаКартинок.kb99_wrench);
		Результат = кнЗагрузитьРайонНаСервере();
		
		Если Результат.ЗаданиеВыполнено Тогда
			ПоказатьОповещениеПользователя("Выполнено");
		КонецЕсли;
	Иначе
		кб99_ВСД.СообщитьИнфо("Выберите регион!");
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция кнЗагрузитьГородаНаСервере()
	
	ПараметрыФункции = кб99_ВСД.ЗагрузитьПараметры( Организация );
	Ответ = кб99_ВСД_Запросы.ИнициализацияХС_ЗагрузитьГорода( ПараметрыФункции, Регион );
	Результат = Новый Структура;
	Результат.Вставить("ЗаданиеВыполнено", Истина);
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура кнЗагрузитьГорода(Команда)
	
	Если ЗначениеЗаполнено(Регион) Тогда
		ПоказатьОповещениеПользователя("Выполняется обработка",,"Ожидайте...",БиблиотекаКартинок.kb99_wrench);
		Результат = кнЗагрузитьГородаНаСервере();
		
		Если Результат.ЗаданиеВыполнено Тогда
			ПоказатьОповещениеПользователя("Выполнено");
		КонецЕсли;
	Иначе
		кб99_ВСД.СообщитьИнфо("Выберите Регион!");
	КонецЕсли

КонецПроцедуры

&НаСервере
Функция кнЗагрузитьУлицыНаСервере()
	
	ПараметрыФункции = кб99_ВСД.ЗагрузитьПараметры( Организация );
	Ответ = кб99_ВСД_Запросы.ИнициализацияХС_ЗагрузитьУлицы( ПараметрыФункции, Город );
	Результат = Новый Структура;
	Результат.Вставить("ЗаданиеВыполнено", Истина);
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура кнЗагрузитьУлицы(Команда)
	
	Если ЗначениеЗаполнено(Город) Тогда
		ПоказатьОповещениеПользователя("Выполняется обработка",,"Ожидайте...",БиблиотекаКартинок.kb99_wrench);
		Результат = кнЗагрузитьУлицыНаСервере();
		
		Если Результат.ЗаданиеВыполнено Тогда
			ПоказатьОповещениеПользователя("Выполнено");
		КонецЕсли;
	Иначе
		кб99_ВСД.СообщитьИнфо("Выберите город!");
	КонецЕсли
		
КонецПроцедуры

&НаСервере
Функция кнЗагрузитьРегионыНаСервере()
	
	ПараметрыФункции = кб99_ВСД.ЗагрузитьПараметры( Организация );
	Ответ = кб99_ВСД_Запросы.ИнициализацияХС_ЗагрузитьРегионы( ПараметрыФункции, Страна );
	Результат = Новый Структура;
	Результат.Вставить("ЗаданиеВыполнено", Истина);
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура кнЗагрузитьРегионы(Команда)
	
	Если ЗначениеЗаполнено(Страна) Тогда
		ПоказатьОповещениеПользователя("Выполняется обработка",,"Ожидайте...",БиблиотекаКартинок.kb99_wrench);
		Результат = кнЗагрузитьРегионыНаСервере();
		
		Если Результат.ЗаданиеВыполнено Тогда
			ПоказатьОповещениеПользователя("Выполнено");
		КонецЕсли;
	Иначе
		кб99_ВСД.СообщитьИнфо("Выберите страну!");
	КонецЕсли

КонецПроцедуры

&НаСервере
Процедура ПлощадкаПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Площадка) Тогда
		Страна = Площадка.Страна;
		Регион = Площадка.Регион;
		Город = Площадка.Город;
		Улица = Неопределено;
		Дом = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПлощадкаПриИзменении(Элемент)
	ПлощадкаПриИзмененииНаСервере();
КонецПроцедуры



