
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Попытка
	    АдресЗагрузкиПриложения = кб99_ВСД.ПолучитьПутьКПриложениюУдаленнойПоддержки();
		Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", ЭтотОбъект);
		НачатьЗапускПриложения(Оповещение, АдресЗагрузкиПриложения.Anydesk,, Истина);		
	Исключение КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускПриложения(КодВозврата, ДополнительныйПараметр) Экспорт

    а = 1;
    
КонецПроцедуры

