Процедура СоздатьЛИ() Экспорт
	
	Для Каждого стрПартия Из Партии Цикл
		Если стрПартия.Пометка Тогда 
			Если НЕ ЗначениеЗаполнено(стрПартия.ЛабИсследования) 
				 И СокрЛП(стрПартия.СтатусПартии) = "103" 
				 ИЛИ СокрЛП(стрПартия.СтатусПартии) = "102" Тогда
				Сообщить(стрПартия.Партия);
				Док = Документы.ВСД2_ЛабораторныеИсследования.СоздатьДокумент();
				Док.Дата = ТекущаяДата();
				Док.Исследования.Загрузить( ВыбШаблон.Исследования.Выгрузить() );
				Док.Партия = стрПартия.Партия;
				Док.Организация = ВыбШаблон.Организация;
				Док.Записать();
				стрПартия.ЛабИсследования = Док.Ссылка;
			Иначе
				Сообщить("Для Партии: " + стрПартия.Партия + ", невозможно оформить лабораторные Исследования! Пропускаю...");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
