
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Параметры.Ключ.Пустая() Тогда
		Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
       		Объект.Организация   =  кб99_ВСД.ПолучитьОрганизациюПоУмолчанию();
		КонецЕсли;
	КонецЕсли;

	ЭтаФорма.Элементы.СвязанныеДокументыТипДокумента.СписокВыбора.Добавить(1,"ТТН");
	ЭтаФорма.Элементы.СвязанныеДокументыТипДокумента.СписокВыбора.Добавить(5,"ТрН");
	ЭтаФорма.Элементы.СвязанныеДокументыТипДокумента.СписокВыбора.Добавить(6,"Торг12");
	ЭтаФорма.Элементы.СвязанныеДокументыТипДокумента.СписокВыбора.Добавить(16,"Заказ");
	ЭтаФорма.Элементы.СвязанныеДокументыТипДокумента.СписокВыбора.Добавить(23,"УПД");
	ЭтаФорма.Элементы.СвязанныеДокументыТипДокумента.РежимВыбораИзСписка = Истина;	
	
	ЭлементОтбора = ЭтаФорма.дсЗапросы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ; 
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	//СписокПараметров = кб99_ВСД.ЗагрузитьПараметры( Объект.Организация );
	//Объект.Получатель_ХозСубъект = СписокПараметров.Получить("Отправитель_ХозСубъект");
	//Объект.Получатель_Площадка = СписокПараметров.Получить("Отправитель_Площадка");
	//Объект.РезультатыИсследований = СписокПараметров.Получить("ВСД_РезультатыИсследований");
	//Объект.Местность = СписокПараметров.Получить("ВСД_Местность");
	//Объект.ОсобыеОтметки = СписокПараметров.Получить("ВСД_ОсобыеОтметки");
	////Объект.ТермическоеСостояние = СписокПараметров.Получить("ТермУсловияПеревозки");
	//Объект.ТермическиеУсловияПеревозки = СписокПараметров.Получить("ТермическиеУсловияПеревозки");
	//Объект.cargoInspected = true;
	
КонецПроцедуры


