&НаКлиенте
Процедура ОбновитьСоответствия()
	ЭтаФорма.дсСоответствия.Отбор.Элементы.Очистить();
	ЭлементОтбора = ЭтаФорма.дсСоответствия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("GUID");
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ; // Опционально
	//ЭлементОтбора.ПравоеЗначение = Объект.GuidХозСубъекта;
	ЭлементОтбора.ПравоеЗначение = Объект.ХозСубъект;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьСоответствия();
КонецПроцедуры

&НаКлиенте
Процедура дсСоответствияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
    Отказ = Истина;
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", Истина, Истина);	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыПодбора, Элементы.дсСоответствия);
КонецПроцедуры

&НаКлиенте
Процедура дсСоответствияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВСД.Установить_Соответствие(ВыбранноеЗначение,Объект.Ссылка);
	Элементы.дсСоответствия.Обновить();
КонецПроцедуры

&НаСервере
Процедура ХозСубъектПриИзмененииНаСервере()
	Объект.GuidХозСубъекта = Объект.ХозСубъект.GUID;
КонецПроцедуры

&НаКлиенте
Процедура ХозСубъектПриИзменении(Элемент)
	ХозСубъектПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Группа1ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ОбновитьСоответствия();
КонецПроцедуры
