&НаКлиенте
Процедура ОбновитьСоответствия()
	
	ЭтаФорма.дсСоответствия.Отбор.Элементы.Очистить();
	ЭлементОтбора = ЭтаФорма.дсСоответствия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ; // Опционально
	ЭлементОтбора.ПравоеЗначение = Объект.ХозСубъект;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьСоответствия();
	ОбновитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура дсСоответствияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", Истина, Истина);	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыПодбора, Элементы.дсСоответствия);
	
КонецПроцедуры

&НаКлиенте
Процедура дсСоответствияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	кб99_ВСД.Установить_Соответствие(ВыбранноеЗначение,Объект.Ссылка);
	Элементы.дсСоответствия.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ХозСубъектПриИзмененииНаСервере()
	Объект.GuidХозСубъекта = Объект.ХозСубъект.GUID;
КонецПроцедуры

&НаКлиенте
Процедура ХозСубъектПриИзменении(Элемент)
	ХозСубъектПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Группа1ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ОбновитьСоответствия();
КонецПроцедуры

&НаКлиенте
Процедура ПерсональныеПараметрыСписанияПартийПриИзменении(Элемент)
	ОбновитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьЭлементов()
	Если Объект.ПерсональныеПараметрыСписанияПартий Тогда 
		ЭтаФорма.Элементы.ПарамЗнакСортировкиУбывание.Видимость = Истина;
		ЭтаФорма.Элементы.ПарамКолонкаСортировкиПартииСписания.Видимость = Истина;		
	Иначе		
		ЭтаФорма.Элементы.ПарамЗнакСортировкиУбывание.Видимость = Ложь;
		ЭтаФорма.Элементы.ПарамКолонкаСортировкиПартииСписания.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры
