
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = кб99_ВСД_Общий.ПолучитьОрганизациюПоУмолчанию();
	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры(Организация);
	
	ПолучательХозсубъект = ПараметрыОрганизации.Отправитель_ХозСубъект;
	ПолучательПлощадка	 = ПараметрыОрганизации.Отправитель_Площадка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЗначенияПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПриИзменении(Элемент)
	
	УстановитьЗначенияПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательХозсубъектПриИзменении(Элемент)
	
	УстановитьЗначенияПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПлощадкаПриИзменении(Элемент)
	
	УстановитьЗначенияПараметров();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияПараметров()
	 
	УстановитьЗначениеПараметра("Владелец",		СписокНоменклатуры, ЗначениеЗаполнено(СписокНоменклатуры));
	УстановитьЗначениеПараметра("Площадка",		ПолучательПлощадка, ЗначениеЗаполнено(ПолучательПлощадка));
	УстановитьЗначениеПараметра("Хозсубъект",	ПолучательХозсубъект, ЗначениеЗаполнено(ПолучательХозсубъект));
		
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПараметра(ИмяПараметра, Значение, Использование = Истина)
	
	ПараметрыОтчета = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	Параметр = ПараметрыОтчета.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	Параметр.Значение = Значение;
	Параметр.Использование = Использование;
	
КонецПроцедуры
