
&НаСервере
Процедура ВыполнитьНаСервере(ПараметрКоманды)
	
	Организация = кб99_ВСД_Параметры.ПолучитьОрганизациюПоУмолчанию();
	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры(Организация);
	
	Для Каждого элемент Из ПараметрКоманды Цикл
		кб99_ВСД_Запросы.Продукция_Элемент_Получить_Инфо(ПараметрыОрганизации, элемент);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Состояние("Выполняем запрос Получение инфо о Продукции",, "Ожидайте...", БиблиотекаКартинок.kb99_wrench);
	
	ВыполнитьНаСервере(ПараметрКоманды);
	
	ПоказатьОповещениеПользователя("Операция завершена");
	
	ПараметрыВыполненияКоманды.Источник.ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры
