&НаСервере
Процедура ВыполнитьНаСервере(ПараметрКоманды)
	Организация = ВСД_Общий.ПолучитьОрганизациюПоУмолчанию();	
	ПараметрыОрганизации = ВСД.ЗагрузитьПараметры( Организация );
	
	Для Каждого элемент Из ПараметрКоманды Цикл
		ВСД_Запросы.Продукция_Элемент_Получить_Инфо( ПараметрыОрганизации, элемент );
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПоказатьОповещениеПользователя("Выполняем запрос Получение инфо о Продукции",,"Ожидайте...",БиблиотекаКартинок.Информация32);
	//ВСД.Получить_Инфо_Продукции_Меркурий(ПараметрКоманды);
	
	ВыполнитьНаСервере(ПараметрКоманды);
	
	ПоказатьОповещениеПользователя("Операция завершена");
КонецПроцедуры
