Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		Если (ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг")) или
			(ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров")) Тогда
			// Заполнение шапки
			ДокументОснование = ДанныеЗаполнения.Ссылка;
			Организация = ДанныеЗаполнения.Организация;
			СписокПараметров = ВСД.ЗагрузитьПараметры( ДанныеЗаполнения.Организация );
			КонтрагентОрганизации = ВСД.НайтиКонтрагентаОрганизации(ДанныеЗаполнения.Организация);
			Отправитель_ХозСубъект = ВСД.НайтиХозСубъект(КонтрагентОрганизации);			
			
			РеквизитГрузополучатель 	= СписокПараметров.Получить("РеквизитГрузополучатель");
			
			Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				Отправитель_Площадка = ВСД.НайтиПлощадкуПоСкладу(ДокументОснование.Склад, Отправитель_ХозСубъект);
				Получатель_ХозСубъект = ВСД.НайтиХозСубъект(ДанныеЗаполнения.Контрагент);				
				номерАвто = ВСД.ПолучитьНомерАвто(ДанныеЗаполнения.Сделка); //Газель
				
				Если РеквизитГрузополучатель = 0 Тогда 
					//контрагент
					Получатель_Площадка = ВСД.НайтиПлощадкуПоКонтрагенту(ДанныеЗаполнения.Контрагент);
				Иначе
					//Адрес доставки
					Получатель_Площадка = ВСД.НайтиПлощадкуПоКонтрагенту(ДанныеЗаполнения.АдресДоставки);
				КонецЕсли;
				
			Иначе //Перемещение
				Отправитель_Площадка = ВСД.НайтиПлощадкуПоСкладу(ДокументОснование.Склад, Отправитель_ХозСубъект);
				Получатель_ХозСубъект = Отправитель_ХозСубъект;
				Получатель_Площадка = ВСД.НайтиПлощадкуПоСкладу(ДокументОснование.СкладПолучатель);
				номерАвто = "Не используется"; 
				Если РеквизитГрузополучатель = 0 Тогда 
					//контрагент
					Получатель_Площадка = ВСД.НайтиПлощадкуПоКонтрагенту(ДанныеЗаполнения.СкладПолучатель);
				Иначе
					//Адрес доставки
					//проверить!!
					Получатель_Площадка = ВСД.НайтиПлощадкуПоКонтрагенту(ДанныеЗаполнения.СкладПолучатель);
				КонецЕсли;

			КонецЕсли;
			
			Перевозчик_ХозСубъект = Отправитель_ХозСубъект;
			
			ТтнНомер = ДанныеЗаполнения.Номер;
			ТтнДата = ДанныеЗаполнения.Дата;
			
			РезультатыИсследований = СписокПараметров.Получить("ВСД_РезультатыИсследований");
			cargoInspected = true;			
			
			Если НЕ(ЗначениеЗаполнено( Отправитель_Площадка )) Тогда 
				Отправитель_Площадка = СписокПараметров.Получить("Отправитель_Площадка");				
			КонецЕсли;			
			
			
			//Экспертиза = СписокПараметров.Получить("ВСД_Экспертиза");
			Местность = СписокПараметров.Получить("ВСД_Местность");
			ОсобыеОтметки = СписокПараметров.Получить("ВСД_ОсобыеОтметки");
			ТермическоеСостояние = 4;
			ПропускатьПустыеСвойства = СписокПараметров.Получить("ПропускатьПустыеСвойства");
			
			Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
				Продукция_Элемент = ВСД.Получить_ВСД_Продукция_Элемент( ТекСтрокаТовары.Номенклатура );
				Если ПропускатьПустыеСвойства Тогда
					Если НЕ ЗначениеЗаполнено(Продукция_Элемент) Тогда
						Сообщить("Не указано соответствие для "+ТекСтрокаТовары.Номенклатура+" -> в параметрах указано Пропускать");
						Продолжить;
					КонецЕсли;
				КонецЕсли;
//				Если НЕ(ЗначениеЗаполнено(Продукция_Элемент)) и (ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг")) Тогда
//					Сообщить("Не сопоставлен ВСД_Продукция_Элемент для "+ТекСтрокаТовары.Номенклатура);
//					Продолжить;
//				КонецЕсли;
//				Партия = ВСД.ВыбратьПартию(Продукция_Элемент, Отправитель_Площадка);
//				Если НЕ(ЗначениеЗаполнено(Партия)) и (ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг")) Тогда 
//					Сообщить("Не найдена Партия для "+ТекСтрокаТовары.Номенклатура);
//					Продолжить;
//				КонецЕсли;
				
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
				НоваяСтрока.Продукция_Элемент = Продукция_Элемент;//ВСД.Получить_ВСД_Продукция_Элемент( НоваяСтрока.Номенклатура );
				НоваяСтрока.Партия = ВСД.ВыбратьПартию(НоваяСтрока.Продукция_Элемент, Отправитель_Площадка, Отправитель_ХозСубъект );
				Если ТекСтрокаТовары.ЕдиницаИзмерения.Вес>0 Тогда 
					НоваяСтрока.Количество = ТекСтрокаТовары.Количество * ТекСтрокаТовары.ЕдиницаИзмерения.Вес;
				Иначе
					НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
				КонецЕсли;

				НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Партия.ЕдиницаИзмерения;	
				
				ТермическоеСостояние = МИН(НоваяСтрока.Продукция_Элемент.ТермическиеУсловияПеревозки,ТермическоеСостояние) ;
			КонецЦикла;
			ТермическоеСостояние = ?(ТермическоеСостояние=0,1,ТермическоеСостояние);
		КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
