&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Попытка	ВыбХозСубъект = Параметры.ВыбХС; Исключение КонецПопытки;
	Попытка	ВыбРегион = Параметры.ВыбРегион;	Исключение 	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.Площадки.Очистить();
	//Необходимо, т.к. иначе Объект будет Пуст
	КопироватьДанныеФормы(ВладелецФормы.Объект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка         = Ложь;
	Объект.Площадки.Очистить();
	Закрыть(Объект);
КонецПроцедуры
//*******************  Открытие/Закрыте формы окончание


&НаКлиенте
Процедура кнОтметитьВсеДокументы(Команда)
	Для Каждого стр Из объект.Площадки Цикл
		Если стр.Активная Тогда
			стр.Отметка = Истина;
		Иначе
			стр.Отметка = Ложь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура кнСнятьОтметкиДокументов(Команда)
	Для Каждого стр Из объект.Площадки Цикл
		стр.Отметка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура кнВыполнитьПоискСервер(СписокУсловий)
	ФОбъект = РеквизитФормыВЗначение("Объект");
	ФОбъект.ПолучитьПлощадкиПоУсловиям(СписокУсловий);
	ЗначениеВРеквизитФормы(ФОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура кнВыполнитьПоиск(Команда)
	ПоказатьОповещениеПользователя("Выполняется загрузка Площадок",,"Ожидайте...",БиблиотекаКартинок.Информация32);
	СписокУсловий = Новый Соответствие;
	СписокУсловий.Вставить( "ХС", ВыбХозСубъект );
	СписокУсловий.Вставить( "Регион", ВыбРегион );
	СписокУсловий.Вставить( "Название", НазваниеПлощадки );	
	кнВыполнитьПоискСервер(СписокУсловий);
	ПоказатьОповещениеПользователя("Выполнено");
КонецПроцедуры

&НаСервере
Процедура кнСохранитьНаСервере()
	Для Каждого стр из Объект.Площадки Цикл
		Если стр.Отметка Тогда 
			Спр = Новый("СправочникМенеджер.ВСД_Площадка");
			Если стр.Площадка = Справочники.ВСД_Площадка.ПустаяСсылка() Тогда 
				Объект_ВСД_Площадка = Справочники.ВСД_Площадка.СоздатьЭлемент();
			Иначе
				Объект_ВСД_Площадка = стр.Площадка.ПолучитьОбъект(); 
			КонецЕсли;
			Объект_ВСД_Площадка.Наименование = стр.Наименование;
			Объект_ВСД_Площадка.Адрес = стр.Адрес;
			Объект_ВСД_Площадка.GUID = стр.GUID;
			Объект_ВСД_Площадка.UUID = стр.uuid;	
			Объект_ВСД_Площадка.GUIDХозСубъекта = ВыбХозСубъект.GUID;
			Объект_ВСД_Площадка.Записать();
			стр.Площадка = Объект_ВСД_Площадка.Ссылка;
			Сообщить("Записан ВСД_Площадка ["+Объект_ВСД_Площадка+"] GUID = "+ стр.Guid);				
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура кнСохранитьОтвет(Ответ,Парам) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПоказатьОповещениеПользователя("Выполняется запись Площадок",,"Ожидайте...",БиблиотекаКартинок.Информация32);
		кнСохранитьНаСервере();
		ПоказатьОповещениеПользователя("Выполнено");
	КонецЕсли;
КонецПроцедуры
 
&НаКлиенте
Процедура кнСохранить(Команда)
    Оповещение = Новый ОписаниеОповещения("кнСохранитьОтвет",ЭтаФорма);	
    ПоказатьВопрос(Оповещение, "Записать отмеченные?", РежимДиалогаВопрос.ДаНет,  0, КодВозвратаДиалога.Да, ""   );
КонецПроцедуры


