
Процедура кб99_ВыполнитьНаСервере(ПараметрКоманды, ВыбКоманда = Неопределено) Экспорт
	
	Для Каждого Элемент Из ПараметрКоманды Цикл
		Если ВыбКоманда = "CREATE" Тогда
			
			Если ЗначениеЗаполнено(Элемент.Площадка) Тогда
				Организация = кб99_ВСД.ПолучитьОрганизациюПоХС(Элемент.Площадка.ХозСубъект);
			Иначе
				кб99_ВСД.СообщитьИнфо("Проверьте заполнение площадки производителя");
				Продолжить;
			КонецЕсли;
		Иначе
			Организация = кб99_ВСД_Общий.ПолучитьОрганизациюПоУмолчанию();
		КонецЕсли;
		
		ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры(Организация);
		кб99_ВСД_Запросы.Продукция_Элемент_Изменить(ПараметрыОрганизации, Элемент, ВыбКоманда);
		
	КонецЦикла;
	
КонецПроцедуры