
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("НомерЗаписи");

КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Данные.НомерЗаписи) Тогда
		Представление = СтрШаблон("%1 %2", Данные.НомерЗаписи, Данные.Наименование);
	Иначе
		Представление = Данные.Наименование;	
	КонецЕсли;

КонецПроцедуры
