
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоказыватьПросроченныеПартии = Истина;
	
	Если Параметры.Свойство("ПоказыватьПросроченныеПартии", ПоказыватьПросроченныеПартии)
		И Не ПоказыватьПросроченныеПартии Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаСрокГодности1");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ЭлементОтбора.ПравоеЗначение = кб99_ВСД_Запросы.ДатаXML(НачалоДня(ТекущаяДатаСеанса()) + 1);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура кнОтключитьОтбор(Команда)
	Список.Отбор.Элементы.Очистить();
КонецПроцедуры