&НаСервере
Функция ПолучитьНоменклатуруПоПродукцияЭлемент(ПродукцияЭлемент, Только1элемент = 0)
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать ВСД_Соответсвия.Номенклатура из РегистрСведений.ВСД_Соответсвия как ВСД_Соответсвия где ВСД_Соответсвия.ПродукцияЭлемент = &Ресурс1";
	Запрос.УстановитьПараметр("Ресурс1", ПродукцияЭлемент);	
	Если Не Только1Элемент Тогда
		ТзВрем = Запрос.Выполнить().Выгрузить();
		ТзВрем.ВыгрузитьКолонку("Номенклатура");
		Возврат ТзВрем.ВыгрузитьКолонку("Номенклатура");		
	Иначе
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Номенклатура;
		Иначе
			Возврат "";
		КонецЕсли;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура УстановитьСоответствие(ВыбНоменклатура,ВСДЭлемент)
	Набор = РегистрыСведений.ВСД_Соответсвия.СоздатьНаборЗаписей();
	Набор.Отбор.Номенклатура.Установить(ВыбНоменклатура);
	Набор.Отбор.Номенклатура.Использование = Истина;
	Набор.Прочитать();
	Набор.Очистить(); // если что и было - подчистим
	НовЗапись = Набор.Добавить();
	НовЗапись.Номенклатура = ВыбНоменклатура;
	НовЗапись.ПродукцияЭлемент = ВСДЭлемент;
	Набор.Записать(true);
КонецПроцедуры

&НаСервере
Процедура ОчиститьСоответствие(ВыбНоменклатура,ВСДЭлемент)
	Набор = РегистрыСведений.ВСД_Соответсвия.СоздатьНаборЗаписей();
	Набор.Отбор.Номенклатура.Установить(ВыбНоменклатура);
	Набор.Отбор.Номенклатура.Использование = Истина;
	Набор.Прочитать();
	Набор.Очистить();
	Набор.Записать(true);
КонецПроцедуры

&НаСервере
Процедура УстановитьСоответствиеСписку(СписокНоменклатуры,ВСДЭлемент)
	Для каждого Элемент из СписокНоменклатуры Цикл
		УстановитьСоответствие(Элемент.Значение,ВСДЭлемент);
	КонецЦикла; 	
КонецПроцедуры

&НаСервере
Процедура УдалитьСоответствиеСписку(СписокНоменклатуры,ВСДЭлемент)
	Для каждого Элемент из СписокНоменклатуры Цикл
		ОчиститьСоответствие(Элемент.Значение,ВСДЭлемент);
	КонецЦикла; 	
КонецПроцедуры

// ********* Команды и события Формы
&НаКлиенте
Процедура кнПрочитать(Команда)
	СзНоменклатура.Очистить();
	Рез = ПолучитьНоменклатуруПоПродукцияЭлемент(ВыбВСДЭлемент);
	СзНоменклатура.ЗагрузитьЗначения(Рез);
КонецПроцедуры

&НаКлиенте
Процедура СзНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если СзНоменклатура.НайтиПоЗначению(ВыбранноеЗначение) = Неопределено Тогда
		СзНоменклатура.Добавить(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура кнДобавитьНоменклатуру(Команда)
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", Ложь, Истина);	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыПодбора, Элементы.СзНоменклатура);
КонецПроцедуры

&НаКлиенте
Процедура кнЗаписатьСоответсвия(Команда)
	Если ВыбВСДЭлемент.Пустая() тогда
		Предупреждение("Укажите Номенклатуру Меркупий");
		Возврат;
	КонецЕсли;
	//Для начала очистим соответствия
	МассивНоменклатуры = ПолучитьНоменклатуруПоПродукцияЭлемент(ВыбВСДЭлемент);
	СписокНоменклатуры = Новый СписокЗначений;
	СписокНоменклатуры.ЗагрузитьЗначения(МассивНоменклатуры);
	УдалитьСоответствиеСписку(СписокНоменклатуры,ВыбВСДЭлемент);
	
	УстановитьСоответствиеСписку(СзНоменклатура,ВыбВСДЭлемент);
	Предупреждение("-> Соответсвия для "+ВыбВСДЭлемент+" Установлены");

КонецПроцедуры

&НаКлиенте
Процедура кнУбратьСоответствия(Команда)
	Если ВыбВСДЭлемент.Пустая() тогда
		Предупреждение("Укажите Номенклатуру Меркупий");
		Возврат;
	КонецЕсли;
	Ответ = Вопрос("Удалить соответствие выбранной номенклатуры 1С Элементу Меркурий?",РежимДиалогаВопрос.ДаНет,0);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
    	Возврат;
	КонецЕсли;
	УдалитьСоответствиеСписку(СзНоменклатура,ВыбВСДЭлемент);
	кнПрочитать(Команда);
КонецПроцедуры



