#Область НемодальныеОкна
&НаКлиенте
Процедура ПредупреждениеПользователю(ТекстПредупреждения) Экспорт
    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждения", ЭтотОбъект);	
    ПоказатьПредупреждение( Оповещение,   ТекстПредупреждения,   0,   "Предупреждение" );
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеЗакрытияПредупреждения(Параметры) Экспорт	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаписатьВСДНаСервере(Знач ДокСсылка)
	Докобъект = ДокСсылка.ПолучитьОбъект();
	ДокОбъект.Записать();
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыОтвет(Ответ, Парам) Экспорт
	
	ДокСсылка = Парам.ПараметрКоманды;//ПараметрыВыполненияКоманды.Источник.Объект; ПараметрыВыполненияКоманды.Источник.ИмяФормы  // = Данные формы.Структура
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПоказатьОповещениеПользователя("Выполняем отправку ВСД",,"Ожидайте...",БиблиотекаКартинок.Информация32);
		// Если из журнала отправляем - закрывать его форму не нужно
		// ПараметрыВыполненияКоманды.Источник.ИмяФормы    есть ФормаСписка
		Если Парам.ЭтоОбъектВСД Тогда
			//Запишем, закроем форму, если это не форма списка
			Если Найти(Парам.ПараметрыВыполненияКоманды.Источник.ИмяФормы,"Списка") = 0 Тогда
				Парам.ПараметрыВыполненияКоманды.Источник.этаФорма.Закрыть();
			КонецЕсли;
			ЗаписатьВСДНаСервере(ДокСсылка);
		КонецЕсли;
		
		ВСД.ОтправитьВСДвГИС(ДокСсылка);
		ПоказатьОповещениеПользователя("Выполняем Гашение ВСД",,"Ожидайте...",БиблиотекаКартинок.Информация32);
		
		Если НЕ (ВСД.ПогаситьВСДПоставщика(ДокСсылка) = "ОК") Тогда
			
		КонецЕсли;
		
		ПоказатьОповещениеПользователя("Выполнено");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДокСсылка = ПараметрКоманды;//ПараметрыВыполненияКоманды.Источник.Объект; ПараметрыВыполненияКоманды.Источник.ИмяФормы  // = Данные формы.Структура
	Если ВСД.ЕстьреквизитОбъекта("Статус",ДокСсылка) Тогда
		Если СокрЛП(ВСД.ПолучитьЗначениеРевизитаОбъекта_НаСервере(ДокСсылка,"Статус")) = "COMPLETED" Тогда
			ПредупреждениеПользователю("Документ уже отправлен");
			Возврат;
		КонецЕсли;
		ЭтоОбъектВСД = Истина;
	Иначе
		ЭтоОбъектВСД = Ложь;
	КонецЕсли;
	//Проверить - не помечен ли на удаление
	
	ТВопроса = "Отправить/Погасить ВСД Поставщика в Меркурий ?";
	Парам = Новый Структура("ПараметрКоманды,ПараметрыВыполненияКоманды,ЭтоОбъектВСД",ПараметрКоманды, ПараметрыВыполненияКоманды, ЭтоОбъектВСД);
    Оповещение = Новый ОписаниеОповещения("ОбработкаКомандыОтвет",ЭтотОбъект,Парам);	
    ПоказатьВопрос(Оповещение, ТВопроса, РежимДиалогаВопрос.ДаНет,  0, КодВозвратаДиалога.Да, ""   );
КонецПроцедуры
