
Функция ПогаситьВСДПоставщика( ДокСсылка, ТаблицаВсдДляГашения) Экспорт
	
	ПараметрыОрганизации = ВСД.ЗагрузитьПараметры( ДокСсылка.Организация );				
	Ответ =  ВСД_Запросы.ПолучитьРезультат_ВСД2( ПараметрыОрганизации, ДокСсылка.applicationID, ДокСсылка, Ложь, Истина, ТаблицаВсдДляГашения );	
	
	Попытка 
		//Отфильтруем только транспортные ВСД
		А=ТаблицаВсдДляГашения.Количество();
		Пока А>0 Цикл
			А=А-1;
			стрВСд = ТаблицаВсдДляГашения[А];
			Если стрВСД.ТипВСД <> "TRANSPORT" Тогда 
				ТаблицаВсдДляГашения.Удалить(А);
				Продолжить;
			КонецЕсли;
			Если стрВСД.Статус <> "CONFIRMED" Тогда 
				ТаблицаВсдДляГашения.Удалить(А);
				Продолжить;
			КонецЕсли;		
		КонецЦикла;
	Исключение 
		ВСД.СообщитьИнфо("Не удалось получить партии для гашения");
		Возврат Ложь;
	КонецПопытки;	
	
	ВСД.СообщитьИнфо("Количество ВСД к гашению = "+ТаблицаВсдДляГашения.Количество());
	
	Если Ответ="COMPLETED" Тогда 
		ПоказатьОповещениеПользователя("Выполняем Гашение ВСД",,"Ожидайте...",БиблиотекаКартинок.Информация32);
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ТаблицаВсдДляГашения", ТаблицаВсдДляГашения);
		//СтруктураПараметров.Вставить("Организация", ДокСсылка.Организация );
		СтруктураПараметров.Вставить("Организация", ДокСсылка.ОрганизацияПолучатель );
		СтруктураПараметров.Вставить("Отправитель_ХозСубъект", ДокСсылка.Получатель_ХозСубъект );
		СтруктураПараметров.Вставить("Отправитель_Площадка", ДокСсылка.Получатель_Площадка );
		ОткрытьФорму("Обработка.Интеграция_ГИС_Меркурий.Форма.ФормаГашениеУФ",СтруктураПараметров,);
		
		ПоказатьОповещениеПользователя("Выполнено");
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
		
КонецФункции