
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			// Заполнение шапки
			ДокументОснование = ДанныеЗаполнения.Ссылка;
			Дата =  ДанныеЗаполнения.Дата;
			КонтрагентОрганизации = ВСД.НайтиКонтрагентаОрганизации(ДанныеЗаполнения.Организация);
			Производитель_ХозСубъект = ВСД.НайтиХозСубъект(КонтрагентОрганизации);
			Отправитель_Площадка = ВСД.НайтиПлощадкуПоСкладу(ДокументОснование.Склад, Производитель_ХозСубъект);
			//ВСД.НайтиПлощадкуПоКонтрагенту(КонтрагентОрганизации);
			ЗавершитьОперацию = true;
			cargoInspected = true;
			РезультатыИсследований = Перечисления.ВСД_РезультатИсследования.VSEFULL;
//			ДатаИзготовления1 = ДанныеЗаполнения.Дата;
//			ДатаСрокГодности1 = ДатаИзготовления1;
			//СписокПараметров = ВСД.ЗагрузитьПараметры( ДанныеЗаполнения.Организация );
			
			//Экспертиза = СписокПараметров.Получить("ВСД_Экспертиза");
			
			Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
				НоваяСтрока = Продукция.Добавить();
				НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
				НоваяСтрока.Продукция_Элемент = ВСД.Получить_ВСД_Продукция_Элемент( НоваяСтрока.Номенклатура );
				
				НоваяСтрока.Продукция = НоваяСтрока.Продукция_Элемент.Продукция ;
				НоваяСтрока.ВидПродукции =  НоваяСтрока.Продукция_Элемент.ВидПродукции;
				НоваяСтрока.НаименованиеПродукции =  НоваяСтрока.Продукция_Элемент.Наименование;
				НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Продукция_Элемент.ЕдиницаИзмерения;	
				
				Если ТекСтрокаТовары.ЕдиницаИзмерения.Вес>0 Тогда 
					НоваяСтрока.Количество = ТекСтрокаТовары.Количество * ТекСтрокаТовары.ЕдиницаИзмерения.Вес;
				Иначе
					НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
				КонецЕсли;

				НоваяСтрока.ДатаИзготовления1 = ДанныеЗаполнения.Дата;
				НоваяСтрока.ДатаСрокГодности1 = НоваяСтрока.ДатаИзготовления1+60*60*24*НоваяСтрока.Продукция_Элемент.СрокГодности;
				
				//ДатаСрокГодности1 = МАКС(НоваяСтрока.ДатаИзготовления1,НоваяСтрока.ДатаИзготовления1+60*60*24*НоваяСтрока.Продукция_Элемент.СрокГодности);
				
			КонецЦикла;
		КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
