// *******Отправка
&НаСервере
Процедура кнОтправитьНаСервере()
	Записать();
	Обработка = ВСД.ИнициализацияОбработки(Объект.Организация);
	Если типЗнч(Обработка) = Тип("Строка") тогда
		Сообщить("Не удалось инициализировать обработку Интеграция");
		Возврат;
	КонецЕсли;
	Обработка.Отправить_ВСД2_транзакция(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура кнОтправить(Команда)
	ПоказатьОповещениеПользователя("Выполняем отправку ВСД",,"Ожидайте...",БиблиотекаКартинок.Информация32);
	ЭтаФорма.Закрыть();	
	кнОтправитьНаСервере();
	ПоказатьОповещениеПользователя("Выполнено");
КонецПроцедуры

// ******* Перемещение/Перезаполнение

&НаКлиенте
Функция МожноПерезаполнять()
	Рез = Истина;
	Если СокрЛП(Объект.Статус = "COMPLETED") Тогда
		Предупреждение("ВСД уже оформлен. Отмена");
		Возврат ложь;
	КонецЕсли;
	
	Если НЕ(ЗначениеЗаполнено(Объект.ДокументОснование)) Тогда
		Предупреждение("Не указан Документ-Основание. Отмена");
		Возврат ложь;
	КонецЕсли;	
	Возврат Рез;	
КонецФункции

&НаСервере
Процедура кнПереместитьНаСервере()
	Обработка = ВСД.ИнициализацияОбработки(Объект.Организация); 
	Если типЗнч(Обработка) = Тип("Строка") тогда
		Сообщить("Не удалось инициализировать обработку Интеграция");
		Возврат;
	КонецЕсли;
	Попытка
		ДокОсн = ?(ЗначениеЗаполнено(Объект.ДокументОснование),Объект.ДокументОснование,Объект.Ссылка);
		Если Обработка.СменаВладельцаВызовИзФормы(ДокОсн) = "ОК" тогда
			Объект.Товары.Очистить();
			Объект.УровниУпаковки.Очистить();
			Объект.Маркировка.Очистить();
			Обработка.ЗаполнитьТЧВСД(Объект.ДокументОснование, Объект);	
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура кнПереместить(Команда)
	Если НЕ МожноПерезаполнять() Тогда
		Возврат;
	КонецЕсли;
	
	ТВопроса = "Перместить недостающе партии от Поставщика?";
	Ответ = Вопрос(ТВопроса,РежимДиалогаВопрос.ДаНет,0);
	Если НЕ (Ответ = КодВозвратаДиалога.Да) Тогда
		Возврат;
	КонецЕсли;
	//Записать();
	ПоказатьОповещениеПользователя("Выполняем Перемещение",,"Ожидайте...",БиблиотекаКартинок.Информация32);
	кнПереместитьНаСервере();
	ПоказатьОповещениеПользователя("Выполнено");
КонецПроцедуры

&НаСервере
Процедура кнЗаполнитьНаСервере()
	Обработка = ВСД.ИнициализацияОбработки(Объект.Организация); 
	Если типЗнч(Обработка) = Тип("Строка") тогда
		Сообщить("Не удалось инициализировать обработку Интеграция");
		Возврат;
	КонецЕсли;
	Объект.Товары.Очистить();
	Объект.УровниУпаковки.Очистить();
	Объект.Маркировка.Очистить();
	Попытка
		Обработка.ЗаполнитьТЧВСД(Объект.ДокументОснование, Объект);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура кнЗаполнить(Команда)
	Если НЕ МожноПерезаполнять() Тогда
		Возврат;
	КонецЕсли;
	ТВопроса = "Табличные части документа будут перезаполнены ?";
	Ответ = Вопрос(ТВопроса,РежимДиалогаВопрос.ДаНет,0);
	Если НЕ (Ответ = КодВозвратаДиалога.Да) Тогда
		Возврат;
	КонецЕсли;
	
	кнЗаполнитьНаСервере();
КонецПроцедуры
//*********Регионализация
&НаСервере
Процедура кнРегионализацияНаСервере()
	Объект.УсловияПеревозки.Очистить();
	Записать();
	Обработка = ВСД.ИнициализацияОбработки();
	Обработка.ПроверитьВозможностьПеремещения(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура кнРегионализация(Команда)
	ТВопроса = "Запросить условия перевозки в Меркурий ?";
	Ответ = Вопрос(ТВопроса,РежимДиалогаВопрос.ДаНет,0);
	Если НЕ (Ответ = КодВозвратаДиалога.Да) Тогда
		Возврат;
	КонецЕсли;
	ПоказатьОповещениеПользователя("Выполняем запрос Регионализации",,"Ожидайте...",БиблиотекаКартинок.Информация32);
	кнРегионализацияНаСервере();
	ПоказатьОповещениеПользователя("Выполнено");
	ЭтаФорма.Закрыть();
КонецПроцедуры
