&НаСервере
Функция ПолучитьИмяОбработкиНаСервере()
	_Организация   = ВСД.ПолучитьОрганизациюПоУмолчанию();
	СписокКонстант = ВСД.ЗагрузитьПараметры( _Организация );
	Возврат СписокКонстант.Получить("ПолноеИмяФайлаОбработки");
КонецФункции

&НаСервере
Функция ПодключитьВнешнююОбработку(АдресХранилища)
    Возврат ВнешниеОбработки.Подключить(АдресХранилища,,Ложь);
КонецФункции  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПолноеИмяФайлаОбработки = ПолучитьИмяОбработкиНаСервере();
	Если НЕ ЗначениеЗаполнено(ПолноеИмяФайлаОбработки) тогда
		Сообщить("Не удалось получить настройки для запуска обработок");
		СтрокаСообщения = "1. Проверьте в Настройках Пользователя 1С значение Организация по Умолчанию
		|2. Запустите Обработку Интеграции через меню Файл - > Открыть, Заполните и сохраните Параметры.
		|3. Повторите попытку.";
		Возврат;
	иначе
	    АдресХранилища = "";
    	Результат = ПоместитьФайл(АдресХранилища, ПолноеИмяФайлаОбработки, , Ложь);           
	    ИмяОбработки = ПодключитьВнешнююОбработку(АдресХранилища);
		Попытка
			ОткрытьФорму("ВнешняяОбработка.Интеграция_ГИС_Меркурий.Форма.ФормаУФ");
			Отказ = Истина;
		Исключение
			СтрокаСообщения = "Не удалось Запустить "+ПолноеИмяФайлаОбработки+"
			|Обратитесь в Техподдержку Kb99.pro";
			Сообщить("Не удалось Запустить "+ПолноеИмяФайлаОбработки);
		КонецПопытки;
	КонецЕсли;	
КонецПроцедуры
