&НаСервере
Функция ПолучитьИмяОбработкиНаСервере()
	_Организация   = ВСД.ПолучитьОрганизациюПоУмолчанию();
	СписокКонстант = ВСД.ЗагрузитьПараметры( _Организация );
	КаталогИнтеграции = Строка(СписокКонстант.Получить("КаталогИнтеграции"));
	Возврат КаталогИнтеграции+"Интеграция_ГИС_Меркурий.epf";
КонецФункции

&НаСервере
Функция ПодключитьВнешнююОбработку(АдресХранилища)
	Попытка
    	Возврат ВнешниеОбработки.Подключить(АдресХранилища,,Ложь);
	Исключение
	    Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецФункции  

#Если ТонкийКлиент Тогда
&НаКлиенте	
Процедура ОткрытьОбработкуОбычноеПриложение(ПолноеИмяФайлаОбработки) 
КонецПроцедуры

#Иначе
&НаКлиенте	
Процедура ОткрытьОбработкуОбычноеПриложение(ПолноеИмяФайлаОбработки) 
	Внешняя = ВнешниеОбработки.Создать(ПолноеИмяФайлаОбработки);
	Внешняя.ПолучитьФорму().Открыть();
КонецПроцедуры
#КонецЕсли

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПолноеИмяФайлаОбработки = ПолучитьИмяОбработкиНаСервере();
	ФайлНаДиске = Новый Файл(ПолноеИмяФайлаОбработки);
	ЕстьФайлОбработки = Истина;
	Если Не ФайлНаДиске.Существует() Тогда
		ЕстьФайлОбработки = Ложь;
        //Сообщить("Не существует обработка печати "+Адресобработки);
    КонецЕсли;	 
	
	Если (НЕ ЗначениеЗаполнено(ПолноеИмяФайлаОбработки)) или  (ПолноеИмяФайлаОбработки = "Интеграция_ГИС_Меркурий.epf") тогда
		Сообщить("Не удалось получить настройки для запуска обработок");
		СтрокаСообщения = "1. Проверьте в Настройках Пользователя 1С значение Организация по Умолчанию
		|2. Запустите Обработку Интеграции через меню Файл - > Открыть, Заполните и сохраните Параметры.
		|3. Повторите попытку.";
		Возврат;
	ИначеЕсли НЕ ЕстьФайлОбработки Тогда
		Сообщить("Отсутствует обработка Интеграции "+ПолноеИмяФайлаОбработки);
		СтрокаСообщения = "1. Проверьте наличие Интеграция_ГИС_Меркурий.epf в указанном каталоге";
		Возврат;
	иначе
		Если ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.ОбычноеПриложение Тогда
			Попытка
				ОткрытьОбработкуОбычноеПриложение(ПолноеИмяФайлаОбработки);
				//Внешняя = ВнешниеОбработки.Создать(ПолноеИмяФайлаОбработки);
				//Внешняя.ПолучитьФорму().Открыть();
				Отказ = Истина;
			Исключение
				СтрокаСообщения = "Не удалось Запустить "+ПолноеИмяФайлаОбработки+"
				|Обратитесь в Техподдержку Kb99.pro";
				Сообщить("Не удалось Запустить "+ПолноеИмяФайлаОбработки);
			КонецПопытки;
		Иначе
		    АдресХранилища = "";
 		   	Результат = ПоместитьФайл(АдресХранилища, ПолноеИмяФайлаОбработки, , Ложь);           
		    ИмяОбработки = ПодключитьВнешнююОбработку(АдресХранилища);
			Попытка
				ОткрытьФорму("ВнешняяОбработка.Интеграция_ГИС_Меркурий.Форма.ФормаУФ");
				Отказ = Истина;
			Исключение
				СтрокаСообщения = "Не удалось Запустить "+ПолноеИмяФайлаОбработки+"
				|Обратитесь в Техподдержку Kb99.pro";
				Сообщить("Не удалось Запустить "+ПолноеИмяФайлаОбработки);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
