
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОчиститьСообщения();
	
	ВСД_Док = ?(кб99_ВСД_Утилиты.ЭтоДокументОтгрузка(ПараметрКоманды), кб99_ВСД.НайтиВсдТранзакцию(ПараметрКоманды), ПараметрКоманды);
	Если ЗначениеЗаполнено(ВСД_Док) Тогда
		Если ТребуетсяУказаниеНомераАвто(ВСД_Док) Тогда
			ПараметрыФормы = Новый Структура("ВСД2_Транзакция", ВСД_Док);
			ОткрытьФорму("ОбщаяФорма.кб99_ФормаВводаНомераАвто", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		Иначе
			кб99_ВСД.СообщитьИнфо(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("В документ %1 не требуется указание номеров автомобиля в точках перегрузки", ВСД_Док));
		КонецЕсли;
	Иначе
		кб99_ВСД.СообщитьИнфо("На основании документа не оформлено ВСД");	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ТребуетсяУказаниеНомераАвто(ВСД2_Транзакция)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	кб99_ВСД2ТочкиМаршрута.НомерТочки КАК НомерТочки
	|ИЗ
	|	Справочник.кб99_ВСД2.ТочкиМаршрута КАК кб99_ВСД2ТочкиМаршрута
	|ГДЕ
	|	кб99_ВСД2ТочкиМаршрута.Ссылка.ДокументОснование = &ДокументОснование
	|	И кб99_ВСД2ТочкиМаршрута.Ссылка.СтатусВСД = ЗНАЧЕНИЕ(Перечисление.кб99_СтатусВСД.CONFIRMED)
	|	И кб99_ВСД2ТочкиМаршрута.Перегрузка
	|	И кб99_ВСД2ТочкиМаршрута.номеравто = """"";
	Запрос.УстановитьПараметр("ДокументОснование", ВСД2_Транзакция);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой() И Не ВСД2_Транзакция.ПометкаУдаления;
	
КонецФункции