&НаКлиенте
Процедура ПредупреждениеПользователю(ТекстПредупреждения) Экспорт
    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждения", ЭтотОбъект);	
    ПоказатьПредупреждение( Оповещение,   ТекстПредупреждения,   0,   "Предупреждение" );
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеЗакрытияПредупреждения(Параметры) Экспорт	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыОтвет(Ответ, Парам) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПоказатьОповещениеПользователя("Выполняем гашение ВСД",,"Ожидайте...",БиблиотекаКартинок.Информация32);
		// Если из журнала отправляем - закрывать его форму не нужно
		// ПараметрыВыполненияКоманды.Источник.ИмяФормы    есть ФормаСписка
		Если Парам.ЭтоОбъектВСД Тогда
			//Запишем, закроем форму, если это не форма списка
			Если Найти(Парам.ПараметрыВыполненияКоманды.Источник.ИмяФормы,"Списка") = 0 Тогда
				Парам.ПараметрыВыполненияКоманды.Источник.этаФорма.Закрыть();
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ (ВСД.ПогаситьВСДПоставщика(Парам.ПараметрКоманды) = "ОК") Тогда
			
		КонецЕсли;
		ПоказатьОповещениеПользователя("Выполнено");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДокСсылка = ПараметрКоманды;//ПараметрыВыполненияКоманды.Источник.Объект; ПараметрыВыполненияКоманды.Источник.ИмяФормы  // = Данные формы.Структура
	Если ВСД.ЕстьреквизитОбъекта("Статус",ДокСсылка) Тогда
		Если СокрЛП(ВСД.ПолучитьЗначениеРевизитаОбъекта_НаСервере(ДокСсылка,"Статус")) <> "COMPLETED" Тогда
			ПредупреждениеПользователю("Документ не отправлен");
			Возврат;
		КонецЕсли;
		ЭтоОбъектВСД = Истина;
	Иначе
		ЭтоОбъектВСД = Ложь;
	КонецЕсли;
	
	ТВопроса = "Погасить ВСД Поставщика ?";
	Парам = Новый Структура("ПараметрКоманды,ПараметрыВыполненияКоманды,ЭтоОбъектВСД",ПараметрКоманды, ПараметрыВыполненияКоманды, ЭтоОбъектВСД);
    Оповещение = Новый ОписаниеОповещения("ОбработкаКомандыОтвет",ЭтотОбъект,Парам);	
    ПоказатьВопрос(Оповещение, ТВопроса, РежимДиалогаВопрос.ДаНет,  0, КодВозвратаДиалога.Да, ""   );
КонецПроцедуры
