
&НаКлиенте
Процедура Применить(Команда)
	
	ТекФильтр = Новый Структура();
	ТекФильтр.Вставить("ВыбНачалоПериода", Период.ДатаНачала);
	ТекФильтр.Вставить("ВыбОкончаниеПериода", Период.ДатаОкончания);
	ТекФильтр.Вставить("ВыбрХозСубъект", Хозсубъект);
	ТекФильтр.Вставить("ВыбрПлощадка", Площадка);
	ТекФильтр.Вставить("НомерТТН", НомерТТН);
	ТекФильтр.Вставить("ГашениеСВХ", ГашениеСВХ);
	
	Закрыть(ТекФильтр);
	
КонецПроцедуры

&НаКлиенте
Процедура ГашениеСВХПриИзменении(Элемент)
	
	Если ГашениеСВХ Тогда
		Площадка = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период.ДатаНачала = Параметры.НачалоПериода;
	Период.ДатаОкончания = Параметры.ОкончаниеПериода;
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "Площадка, Хозсубъект, НомерТТН, ГашениеСВХ");
	
КонецПроцедуры
