&НаСервере
Процедура ВыполнитьНаСервере( ВыбПлощадка )
	
	Организация = ВСД_Общий.ПолучитьОрганизациюПоУмолчанию();	
	ПараметрыОрганизации = ВСД.ЗагрузитьПараметры( Организация );
	
	ВСД_Запросы.Продукция_Элемент_ПолучитьСписокПоПлощадке( ПараметрыОрганизации, ВыбПлощадка );
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПоказатьОповещениеПользователя("Выполняем запрос",,"Ожидайте...",БиблиотекаКартинок.Информация32);
	
	ВыполнитьНаСервере( ПараметрКоманды );
	
	ПоказатьОповещениеПользователя("Операция завершена");
КонецПроцедуры
