
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПутьВеб = кб99_ВСД.ОткрытьВСДвГИС(ПараметрКоманды);
	Если ПутьВеб.Количество() > 0 Тогда
		Для Каждого стрПуть Из ПутьВеб Цикл
			//ЗапуститьПриложение(стрПуть.Значение);	
			Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", ЭтотОбъект);
			НачатьЗапускПриложения(Оповещение, стрПуть.Значение,, Истина);
		КонецЦикла;
	Иначе
		Сообщить("Нечего открывать");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗапускПриложения(КодВозврата, ДополнительныйПараметр) Экспорт

КонецПроцедуры