
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если кб99_ВСД_Общий.ФормироватьДвиженияПартий(Организация) Тогда
		
		// регистр кб99_ОстаткиПартийВСД Приход
		Движения.кб99_ОстаткиПартийВСД.Записывать = Истина;
		
		Движение = Движения.кб99_ОстаткиПартийВСД.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ВСД_Площадка = Получатель_Площадка;
		Движение.Продукция_Элемент = Продукция_Элемент;
		Движение.Количество = КоличествоПринять;
		
	КонецЕсли;
	
КонецПроцедуры