&НаСервере
Процедура ОбновитьНаСервере( ПараметрКоманды )
	Организация = ВСД_Общий.ПолучитьОрганизациюПоУмолчанию();	
	ПараметрыОрганизации = ВСД.ЗагрузитьПараметры( Организация );
	
	Для Каждого ВыбХозСубъект Из ПараметрКоманды Цикл
		ВСД_Запросы.ХозСубъект_ЗагрузитьПоGUID( ПараметрыОрганизации, ВыбХозСубъект.GUID, ВыбХозСубъект );
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПоказатьОповещениеПользователя("Выполняем запрос",,"Ожидайте...",БиблиотекаКартинок.Информация32);
	
	ОбновитьНаСервере(ПараметрКоманды);
	
	ПоказатьОповещениеПользователя("Операция завершена");
КонецПроцедуры
