&НаСервере
Процедура ОбновитьНаСервере( ПараметрКоманды )
	Организация = кб99_ВСД_Общий.ПолучитьОрганизациюПоУмолчанию();	
	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры( Организация );
	
	Для Каждого ВыбХозСубъект Из ПараметрКоманды Цикл
		кб99_ВСД_Запросы.ХозСубъект_ЗагрузитьПоGUID( ПараметрыОрганизации, ВыбХозСубъект.GUID, ВыбХозСубъект );
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Состояние("Выполняем запрос",,"Ожидайте...",БиблиотекаКартинок.kb99_wrench);
	
	ОбновитьНаСервере(ПараметрКоманды);
	
	ПоказатьОповещениеПользователя("Операция завершена");
КонецПроцедуры
