
Процедура кб99_ОбработкаОтвета(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Состояние(ДопПараметры.СтруктураКоманды.ТекстСостояния,, "Ожидайте...", БиблиотекаКартинок.kb99_wrench);
		
		кб99_Команды_Общий_Сервер.кб99_ВыполнитьНаСервере(ДопПараметры.ПараметрФункции.ПараметрКоманды, ДопПараметры.СтруктураКоманды.ВыбКоманда);
		
		ДопПараметры.ПараметрФункции.ПараметрыВыполненияКоманды.Источник.ЭтаФорма.ОбновитьОтображениеДанных();
		ПоказатьОповещениеПользователя("Операция завершена");
	КонецЕсли;
	
КонецПроцедуры

Процедура кб99_ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды, СтруктураКоманды) Экспорт
	
	ПараметрФункции = Новый Структура("ПараметрКоманды, ПараметрыВыполненияКоманды", ПараметрКоманды, ПараметрыВыполненияКоманды);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПараметрФункции" , ПараметрФункции);
	ДопПараметры.Вставить("СтруктураКоманды", СтруктураКоманды);
	
	Оповещение = Новый ОписаниеОповещения("кб99_ОбработкаОтвета", ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(Оповещение, СтруктураКоманды.ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	
КонецПроцедуры