
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НезавершенныеТранзакции") Тогда
		Организация = Параметры.Организация;
		тзНезавершенноеПроизводство = ПолучитьИзВременногоХранилища(Параметры.НезавершенныеТранзакции);
		Для Каждого Стр Из тзНезавершенноеПроизводство Цикл
			нСтр = СписокДокументов.Добавить();
			ЗаполнитьЗначенияСвойств(нСтр, Стр);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаТч = Элемент.ТекущиеДанные;
	
	Результат = Новый Структура;
	Результат.Вставить( "НомерНезавершенногоПроизводства", СтрокаТЧ.НомерОперации);

	ВводДатыПроизводства(Результат);

КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	СтрокаТч = Элементы.СписокДокументов.ТекущиеДанные;
	
	Результат = Новый Структура;
	Результат.Вставить( "НомерНезавершенногоПроизводства", СтрокаТЧ.НомерОперации);
	
	ВводДатыПроизводства(Результат);

КонецПроцедуры

&НаКлиенте
Процедура кнЗавершитьВыбранныеТранзакции(Команда)
	
	ПредставлениеДокументыКЗавершению = "";
	
	Для Каждого Стр Из СписокДокументов Цикл
		Если Стр.Отметка Тогда
			ПредставлениеДокументыКЗавершению = ПредставлениеДокументыКЗавершению +", "+ Стр.НомерОперации;
		КонецЕсли;
	КонецЦикла;
	
	ПервыйСимвол = Лев(ПредставлениеДокументыКЗавершению, 1);
	Если ПервыйСимвол = "," Тогда
		ПредставлениеДокументыКЗавершению = Прав(ПредставлениеДокументыКЗавершению, СтрДлина(ПредставлениеДокументыКЗавершению)-2);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПредставлениеДокументыКЗавершению) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "Будут завершены производственные транзакции №: "+ПредставлениеДокументыКЗавершению+"
					| Продолжить?";
	
	Оповещение = Новый ОписаниеОповещения("кнЗавершитьПроизводствоОтвет", ЭтаФорма);	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,  0, КодВозвратаДиалога.Да, "");
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьНовоеПроизводство(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить( "НомерНезавершенногоПроизводства", Неопределено);
	Результат.Вставить( "ЗавершитьОперацию", Ложь );
	
	ВводДатыПроизводства(Результат);
	
КонецПроцедуры

&НаСервере
Функция кнЗавершитьВыбранныеТранзакцииНаСервере()
	
	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры( Организация );
   	ПараметрыОрганизации.Вставить( "ЗавершитьПроизводство", Истина );
	
	МассивЗавершенных = Новый Массив;
	
	Для Каждого СтрТЧ Из СписокДокументов Цикл
		Если СтрТЧ.Отметка Тогда
			
			ПараметрыЗаполнения = Новый Структура;
			ПараметрыЗаполнения.Вставить("ПараметрыОрганизации", ПараметрыОрганизации);
			ПараметрыЗаполнения.Вставить("Площадка", СтрТЧ.Площадка);
			ПараметрыЗаполнения.Вставить("НомерОперации", СтрТЧ.НомерОперации);
			ПараметрыЗаполнения.Вставить("СписокПродукции", СтрТЧ.СписокПродукции.ВыгрузитьЗначения());
			
			СтрТЧ.Документ = кб99_ВСД_Производство.ОформитьДокументЗавершенияПроизводства(ПараметрыЗаполнения);
			СтрТЧ.СтатусЗапроса = кб99_ВСД_Запросы.ЗавершитьПроизводство( ПараметрыОрганизации, СтрТЧ.Документ );
			
			Если СтрТЧ.СтатусЗапроса = Перечисления.кб99_СтатусЗапроса.COMPLETED Тогда
				МассивЗавершенных.Добавить(СписокДокументов.Индекс(СтрТЧ));	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр Из МассивЗавершенных Цикл
		СписокДокументов.Удалить(Стр);		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ВводДатыПроизводства(ДополнительныеПараметры)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаДатыПроизводства", ЭтаФорма, ДополнительныеПараметры);	
	ВыбДата = ТекущаяДата();
	ПоказатьВводДаты( Оповещение, ВыбДата , "Дата выпуска продукции",  ЧастиДаты.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура кнЗавершитьПроизводствоОтвет(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		кнЗавершитьВыбранныеТранзакцииНаСервере();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДатыПроизводства(ВыбДата, Результат) Экспорт
	
	Если ВыбДата = Неопределено Тогда
		кб99_ВСД.СообщитьИнфо("Отменено");
		Возврат;
	Иначе		
		
		Результат.Вставить("ДатаПроизводства", ВыбДата);
		
		Оповестить( "ВыборНезавершенногоПроизводства", Результат );
	
		Закрыть();
	
	КонецЕсли;
	
КонецПроцедуры
