&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПутьВеб = кб99_ВСД.ПечатьПолнойФормыВСД(ПараметрКоманды);
	
	Если ПутьВеб.Количество() > 0 Тогда
		Для Каждого стрПуть Из ПутьВеб Цикл
			Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", ЭтотОбъект);
			НачатьЗапускПриложения(Оповещение, стрПуть.Значение,, Истина);	
		КонецЦикла;
	Иначе
		Сообщить("Пустой список оформленных ВСД");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускПриложения(КодВозврата, ДополнительныйПараметр) Экспорт

    а = 1;
    
КонецПроцедуры