
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Организация = кб99_ВСД_Общий.ПолучитьОрганизациюПоУмолчанию();
	Объект.Дата = ТекущаяДатаСеанса();
	ЗаполнитьРеквизитыПоОрганизации(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	кб99_ВСД_Клиент.УстановитьОтборыДинамическихСписковПриОткрытии(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗаполнитьРеквизитыПоОрганизации(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПартии(Команда)
	
	ОчиститьСообщения();
	ПолучитьПартииНаСервере();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьРеквизитыПоОрганизации(Объект)
	
	СписокПараметров = кб99_ВСД.ЗагрузитьПараметры(Объект.Организация);
	Объект.ВСД_Хозсубъект = СписокПараметров["Отправитель_ХозСубъект"];
	Объект.ВСД_Площадка = СписокПараметров["Отправитель_Площадка"];
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПартииНаСервере()
	
	ПараметрыФункции = кб99_ВСД.ЗагрузитьПараметры(Объект.Организация);
	ПараметрыФункции.Вставить("ВыбПлощадка", Объект.ВСД_Площадка);
	ПараметрыФункции.Вставить("ПартииСмещение", 0);
	ПараметрыФункции.Вставить("УдалятьПартии", Ложь);
	ПараметрыФункции.Вставить("ТолькоАктуальныеПартии", Ложь);
	ПараметрыФункции.Вставить("ПартияНачПериода", "");
	ПараметрыФункции.Вставить("ПартияКонПериода", Объект.Дата);
	ПараметрыФункции.Вставить("СписокПартий", Новый Массив);
	
	Если ПараметрыФункции.ОтправлятьВФоне Тогда
		ИдентификаторЗадания = Неопределено;
		
		НаименованиеЗадания = НСтр("ru = 'Ветис загрузка партий'");
		Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне( УникальныйИдентификатор,
		"кб99_ВСД_Запросы.Партии2_Запрос_Отправить_ВФоне",
		ПараметрыФункции,
		НаименованиеЗадания);
		
		АдресХранилища = Результат.АдресХранилища;
	Иначе;
		Ответ = кб99_ВСД_Запросы.Партии2_Запрос_Отправить(ПараметрыФункции);
		Результат = Новый Структура;
		Результат.Вставить("ЗаданиеВыполнено", Истина);
	КонецЕсли;
	
	ВСД_Площадка = Объект.ВСД_Площадка.ПолучитьОбъект();
	ВСД_Площадка.ДатаАктуальностиПартий = Объект.Дата;
	ВСД_Площадка.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВСД_Партия.Ссылка КАК Партия,
	|	ВСД_Партия.НомерЗаписи КАК НомерЗаписи,
	|	ВСД_Партия.ДатаИзготовления1 КАК ДатаИзготовления,
	|	ВСД_Партия.ДатаСрокГодности1 КАК СрокГодности,
	|	ВСД_Партия.Количество КАК Количество
	|ИЗ
	|	Справочник.ВСД_Партия КАК ВСД_Партия
	|ГДЕ
	|	ВСД_Партия.Ссылка В (&СписокПартий)";
	Запрос.УстановитьПараметр("СписокПартий", ПараметрыФункции.СписокПартий);
	
	Объект.ПартииРезультат.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры