
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДокСсылка = ПараметрКоманды;
	
	Организация = кб99_ВСД.ПолучитьЗначениеРевизитаОбъекта_НаСервере( ДокСсылка, "Организация" );
	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры( Организация );
	
	Если ПараметрыОрганизации["ПарамРазрешитьВводНаОснованииБолееОдногоВСД"] Тогда 
		
		ОткрытьФорму("Документ.ВСД2_транзакция.ФормаОбъекта", Новый Структура("Основание", ДокСсылка));
		
	Иначе
		// только 1 ВСД
		
		ДокВСД = кб99_ВСД.НайтиВсдТранзакцию(ДокСсылка);
		Если ЗначениеЗаполнено(ДокВСД) Тогда
			
			Если типЗнч(ДокВСД) = Тип("ДокументСсылка.ВСД2_транзакция") Тогда
				ИмяФормыДокумента = "Документ.ВСД2_транзакция.ФормаОбъекта";	
			ИначеЕсли типЗнч(ДокВСД) = Тип("ДокументСсылка.ВСД_транзакция") Тогда
				ИмяФормыДокумента = "Документ.ВСД_транзакция.ФормаОбъекта";
			Иначе
				кб99_ВСД.СообщитьИнфо("Неверный документ нашли", ДокВСД);
				Возврат;
			КонецЕсли;
			
			ОткрытьФорму(ИмяФормыДокумента, Новый Структура("Ключ", ДокВСД));
			
		Иначе
			
			ОткрытьФорму("Документ.ВСД2_транзакция.ФормаОбъекта", Новый Структура("Основание", ДокСсылка));
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
