
&НаКлиенте
Процедура ЗаполнитьАкт(Команда)
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(ОписаниеНесоответствия) Тогда
		кб99_ВСД.СообщитьПользователю("Укажите описание несоответствия",, "ОписаниеНесоответствия",, Отказ);
	ИначеЕсли Не ЗначениеЗаполнено(ПричинаАкта) Тогда
		кб99_ВСД.СообщитьПользователю("Укажите причину составления акта",, "ПричинаАкта",, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;                                          
	Результат.Вставить("флАктНесоответствия", Истина);
	Результат.Вставить("тОписаниеНесоответствия", ОписаниеНесоответствия);
	Результат.Вставить("тПричинаАкта", ПричинаАкта);
	
	Закрыть(Результат);
	
КонецПроцедуры
