
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//ПоказатьОповещениеПользователя("Выполняем запрос Получение инфо о Продукции",,"Ожидайте...",БиблиотекаКартинок.Информация32);
	
	//Организация = ВСД_Общий.ПолучитьОрганизациюПоУмолчанию();	
	//ПараметрыОрганизации = ВСД.ЗагрузитьПараметры( Организация );
		
	СтруктураПараметров = Новый Структура("МассивЗначений", ПараметрКоманды);
	//ОповещениеОВыборе  = Новый ОписаниеОповещения("ОткрытиеФормыЗагрузкаПлощадок", ЭтаФорма, Новый Структура("ИмяКоманды", Команда.Имя));
	ОткрытьФорму("Обработка.Интеграция_ГИС_Меркурий.Форма.ФормаСоздатьВСД_ЭлементыУФ", СтруктураПараметров);
	
	//ПоказатьОповещениеПользователя("Операция завершена");
КонецПроцедуры
