Перем Выбор_ВСД_Площадка;

Процедура кнПолучитьПартииНажатие(Элемент)
	ПолучитьПартии( Отправитель_Площадка )
КонецПроцедуры

Процедура ПриОткрытии(Отказ)
	Если Организация.Пустая() Тогда
		Организация   = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	КонецЕсли;	
	
	Инициализация();	
	Попытка
		Версия = Компонента.Версия;	
	Исключение
		Версия = "Не зарегистрирована";
	КонецПопытки;
	
	
	
	//Если Не ОтбиратьСобытияПоДокументу Тогда
		
	//ДатаНачалаОтбора	= НачалоМесяца(ОбщегоНазначенияЗК.ПолучитьРабочуюДату());
	//ДатаОкончанияОтбора	= КонецМесяца(ОбщегоНазначенияЗК.ПолучитьРабочуюДату());
	ДатаНачалаОтбора = Дата(2017,9,22);
	ДатаОкончанияОтбора = Дата(2017,9,22);
		
	//КонецЕсли;
	//
	//Если Не ЗначениеЗаполнено(ПериодРегистрации) Тогда
	//	ПериодРегистрации = НачалоМесяца(ОбщегоНазначенияЗК.ПолучитьРабочуюДату())
	//КонецЕсли;
			
	Автозаполнение();
	
	//Если ЗначениеЗаполнено(ВСД_транзакция) Тогда
	//	Отправить_ВСД_транзакция( ВСД_транзакция );
	//	ЭтаФорма.Закрыть();
	//КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьПараметры( КлючНастроек )
	
	СписокКонстант=Новый("Соответствие");
	СписокКонстант.Вставить("param_username", param_username);
	СписокКонстант.Вставить("param_password", param_password);
	СписокКонстант.Вставить("param_issuer_id", param_issuer_id);
	СписокКонстант.Вставить("param_service_id", param_service_id);
	СписокКонстант.Вставить("param_api_key", param_api_key);
	СписокКонстант.Вставить("param_intiator_login", param_intiator_login);
	СписокКонстант.Вставить("param_vetdoctor_login", param_vetdoctor_login);
	СписокКонстант.Вставить("param_vetdoctor_fio", param_vetdoctor_fio);	
	СписокКонстант.Вставить("param_vetdoctor_post", param_vetdoctor_post);	
	
	СписокКонстант.Вставить("Отправитель_Площадка", Отправитель_Площадка);
	СписокКонстант.Вставить("Отправитель_ХозСубъект", Отправитель_ХозСубъект );
	
	СписокКонстант.Вставить("Страна", Страна);
	СписокКонстант.Вставить("Регион", Регион);
	СписокКонстант.Вставить("Город", Город);
	СписокКонстант.Вставить("ВСД_Экспертиза", ВСД_Экспертиза);
	СписокКонстант.Вставить("ВСД_Местность", ВСД_Местность );
	СписокКонстант.Вставить("ВСД_ОсобыеОтметки", ВСД_ОсобыеОтметки);
	
	СписокКонстант.Вставить("ПаузаСек", ПаузаСек);	
	//СписокКонстант.Вставить(НазваниеРеквизитаГрузополучатель, "НазваниеРеквизитаГрузополучатель");	
			
	СписокКонстант.Вставить("ОтладкаЗапросовXML", ОтладкаЗапросовXML);	
	
	//СписокКонстант.Вставить(ВСД_Продукция_Свойство, "ВСД_Продукция_Свойство");
	СписокКонстант.Вставить("Перевозчик_ХозСубъект", Перевозчик_ХозСубъект);		
	//СписокКонстант.Вставить(НазваниеРеквизитаКоличествоМест, "НазваниеРеквизитаКоличествоМест");
	//СписокКонстант.Вставить(ПропускатьПустыеСвойства, "ПропускатьПустыеСвойства");		
	//СписокКонстант.Вставить(НазваниеВидаДокументаРеализация, "НазваниеВидаДокументаРеализация");		
	//СписокКонстант.Вставить(НазваниеРеквизитаКоличество, "НазваниеРеквизитаКоличество");
	
	СписокКонстант.Вставить("КаталогЛогов", КаталогЛогов);
	СписокКонстант.Вставить("ПаузаСек", ПаузаСек);		
	
	СписокКонстант.Вставить("ПолноеИмяФайлаОбработки", ПолноеИмяФайлаОбработки);		
	СписокКонстант.Вставить("ТестовыйРежим", ТестовыйРежим);	
	СписокКонстант.Вставить("ВыводитьПодробнуюИнформацию", ВыводитьПодробнуюИнформацию);	
	
	//ИмяФайла = ИмяФайлаНастроек();
	//ЗначениеВФайл(ИмяФайла,СписокКонстант);
	////Предупреждение("Настройки сохранены!",3);
	//Сообщить("Настройки сохранены в "+ИмяФайла);
	
   // ключи могут быть произвольными строками
    КлючОбъекта  = "ВСД";
    //КлючНастроек = "НастройкиВСД";
    // настройки могут быть произвольного типа
	//Настройки    = Новый Структура;
	//Настройки.Вставить("Настройки", "123");

    // имя пользователя - пользователь владелец настроек, если параметр не указать,
    // то настройки будут сохранены для ТЕКУЩЕГО пользователя
    ИмяПользователя = ИмяПользователя();
    ХранилищеОбщихНастроек.Сохранить(КлючОбъекта,  Строка(КлючНастроек), СписокКонстант, , ИмяПользователя);		
	
	Сообщить("Настройки сохранены для "+ИмяПользователя+" - "+КлючНастроек);
КонецПроцедуры

Процедура кнСохранитьПараметрыНажатие(Элемент)
	СохранитьПараметры( Организация );
КонецПроцедуры

Процедура кнХС_ПолучитьGuidНажатие(Элемент)
	ХС_ПолучитьGuid(ВыбХС);
КонецПроцедуры

Функция ПроверитьDll() 
	Попытка
		Инициализация();
		//ВыборВерсии();
		
		//Предупреждение("Библиотека SoapDLL_test.dll зарегистрирована ");
		Попытка 
			Предупреждение("Библиотека "+ИмяDLL+".dll зарегистрирована, версия = "  + Компонента.Версия);
			Возврат 1;
		Исключение 
			Предупреждение("Библиотека "+ИмяDLL+" не зарегистрированна!");
			Возврат 0;
		Конецпопытки;	
	Исключение 
		Предупреждение("Библиотека "+ИмяDLL+" не зарегистрированна!");
		Возврат 0
	Конецпопытки;
КонецФункции

Процедура кнПроверитьDllНажатие(Элемент)
	ПроверитьDll();
КонецПроцедуры

Процедура кнЗагрузитьПлощадкиНажатие(Элемент)
	ЗагрузитьПлощадки(ВыбХС);
КонецПроцедуры

Процедура кнЗагрузитьСтраныНажатие(Элемент)
	ИнициализацияХС_ЗагрузитьСтраны();
КонецПроцедуры

Процедура кнЗагрузитьРегионыНажатие(Элемент)
	ИнициализацияХС_ЗагрузитьРегионы(Страна);
КонецПроцедуры

Процедура кнЗагрузитьГородаНажатие(Элемент)
	ИнициализацияХС_ЗагрузитьГорода(Регион);
КонецПроцедуры

Процедура кнЗагрузитьПродукциюНажатие(Элемент)
	ИнициализацияХС_ЗагрузитьПродукцию(1);
КонецПроцедуры

Процедура кнЗагрузитьЕдИзмНажатие(Элемент)
	ИнициализацияХС_ЗагрузитьЕдиницыИзмерения();
КонецПроцедуры

Процедура кнИнициализацияНажатие(Элемент)
	ИнициализацияХС();
КонецПроцедуры

Процедура кнСоздатьПлощадкуНажатие(Элемент)
	СоздатьПлощадку(ВыбПлощадка)
КонецПроцедуры

Процедура кнПривязатьПлощадкуНажатие(Элемент)
	СоздатьСвязьХозсубъектПлощадка(ВыбПлощадка)
КонецПроцедуры

Процедура кнОтправить_ВСД_транзакцияНажатие(Элемент)  Экспорт
	Отправить_ВСД_транзакция( ВСД_транзакция );
КонецПроцедуры

Процедура кнЗагрузитьПартииНажатие(Элемент)
	ПолучитьПартии();
КонецПроцедуры

Процедура кнЗаполнитьНажатие(Элемент)
	Автозаполнение();
КонецПроцедуры

Процедура кнЗагрузитьПлощадкиТЧНажатие(Элемент)
	ЗагрузитьПлощадкиСписком();	
КонецПроцедуры

//Процедура ТабличноеПоле1ПлощадкаНачалоВыбора(Элемент, СтандартнаяОбработка)
//	// Вставить содержимое обработчика.
//	ПлощадкаНачалоВыбора()
//КонецПроцедуры


// Обработка выбора формы
Процедура ПлощадкаНачалоВыбора(Элемент, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Выбор_ВСД_Площадка = Элемент.Значение; // для последующего удаления привязки
   	ФормаВыбора =  Справочники.ВСД_Площадка.ПолучитьФормуВыбора(, Элемент);
    ФормаВыбора.РежимВыбора = Истина;
    ФормаВыбора.Отбор.GuidХозСубъекта.Установить(ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ХозСубъект.GUID, Истина);
    ФормаВыбора.Открыть();	
КонецПроцедуры

Процедура ТабличноеПоле1ПлощадкаПриИзменении(Элемент)
	
	//Очистим старое значение
	Попытка
		Если НЕ(Выбор_ВСД_Площадка = Справочники.ВСД_Площадка.ПустаяСсылка()) Тогда 
			СпрОб = Выбор_ВСД_Площадка.ПОлучитьОбъект();
			СпрОб.Контрагент = "";
			СпрОб.Записать();
		КонецЕсли;		
	Исключение
	КонецПопытки;
	
	СпрОб = Элемент.Значение.ПОлучитьОбъект();
	СпрОб.Контрагент = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Грузополучатель;
	СпрОб.Записать();
КонецПроцедуры


Процедура кнСоздатьВСДНажатие(Элемент)
	СоздатьВСД();
КонецПроцедуры


Процедура кнЗаполнитьТаблицуПартийНажатие(Элемент)
	ЗаполнитьТаблицуПартий();
	ЭтаФорма.Панель.ТекущаяСтраница = ЭтаФорма.Панель.Страницы.Страница5;
КонецПроцедуры


Процедура ПартииПартияПриИзменении(Элемент)
	ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Количество = Элемент.Значение.Количество;
КонецПроцедуры


Процедура ПартииПартияНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
   	ФормаВыбора =  Справочники.ВСД_Партия.ПолучитьФормуВыбора(, Элемент);
    ФормаВыбора.РежимВыбора = Истина;
    ФормаВыбора.Отбор.Продукция_Элемент.Установить(ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ВСД_Продукция_Элемент, Истина);
    ФормаВыбора.Открыть();	
КонецПроцедуры


Процедура кнОтправитьВСДНажатие(Элемент)
	ОтправитьСписокВСД();
КонецПроцедуры


Процедура ТабличноеПоле1ПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	Если ПустаяСтрока(ДанныеСтроки.ХозСубъект.GUID)Тогда
		ОформлениеСтроки.ЦветФона = Новый Цвет(255,0,0);   //красный
	ИначеЕсли ДанныеСтроки.Площадка = Справочники.ВСД_Площадка.ПустаяСсылка() Тогда
		ОформлениеСтроки.ЦветФона = Новый Цвет(255,255,127);   //желтый
	КонецЕсли;
	
КонецПроцедуры


Процедура ПартииПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	Если ДанныеСтроки.Партия = Справочники.ВСД_Партия.ПустаяСсылка() Тогда
		ОформлениеСтроки.ЦветФона = Новый Цвет(255,255,127);   //желтый
	ИначеЕсли ДанныеСтроки.Количество < ДанныеСтроки.КоличествоСписания Тогда
		ОформлениеСтроки.ЦветФона = Новый Цвет(255,0,0);   //красный
	КонецЕсли;

КонецПроцедуры


Процедура Организация1ПриИзменении(Элемент)
	ЗагрузитьПараметры(Организация);
	Автозаполнение();
КонецПроцедуры


Процедура кнЗагрузитьПлощадкиПоНаименованиюНажатие(Элемент)
	НайтиПлощадкиПоНазванию(ВыбХС, Регион, 1);
КонецПроцедуры


Процедура кнЗагрузитьПлощадкиСпискомПоНаименованиюНажатие(Элемент)
	ЗагрузитьПлощадкиСписком(1);	
КонецПроцедуры


Процедура КнопкаВыбораПериодаНажатие(Элемент)	
	
	Если НП.Редактировать() Тогда
		
		ДатаНачалаОтбора = НП.ПолучитьДатуНачала();
		ДатаОкончанияОтбора = НП.ПолучитьДатуОкончания();
				
		Автозаполнение();
	КонецЕсли;
	
КонецПроцедуры


Процедура ОрганизацияПриИзменении(Элемент)
	Автозаполнение();
КонецПроцедуры


Процедура кнХС_СоздатьНажатие(Элемент)
	ХС_Создать(ВыбХС);
КонецПроцедуры

