
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Попытка
	    ПутьКСправке = кб99_ВСД.ПолучитьПутьКСправкеВИКИ(ПараметрКоманды);
		Если ЗначениеЗаполнено(ПутьКСправке) Тогда
			//ЗапуститьПриложение(ПутьКСправке); 
			Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", ЭтотОбъект);
			НачатьЗапускПриложения(Оповещение, ПутьКСправке,, Истина);		
		КонецЕсли;	
	Исключение КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускПриложения(КодВозврата, ДополнительныйПараметр) Экспорт

    а = 1;
    
КонецПроцедуры

