
&НаСервере
Процедура ВыполнитьНаСервере( ПараметрКоманды )
	Организация = ВСД_Общий.ПолучитьОрганизациюПоУмолчанию();	
	ПараметрыОрганизации = ВСД.ЗагрузитьПараметры( Организация );
	
	//Для Каждого элемент Из ПараметрКоманды Цикл
		ВСД_Запросы.ХозСубъект_Создать( ПараметрыОрганизации, ПараметрКоманды );
	//КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПоказатьОповещениеПользователя("Выполняем запрос",,"Ожидайте...",БиблиотекаКартинок.Информация32);
	//ВСД.Получить_Инфо_Продукции_Меркурий(ПараметрКоманды);
	
	ВыполнитьНаСервере(ПараметрКоманды);
	
	ПоказатьОповещениеПользователя("Операция завершена");
КонецПроцедуры
