
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Отказ = Истина;
		кб99_ВСД.СообщитьИнфо("Запрещено интерактивное добавление условий перевозки. Запросите условия перевозки из документа.")  ;
	Иначе
		
		Если Объект.Решение = 1 Тогда
			Элементы.ДекорацияРешение.Заголовок = "Перемещение разрешено";	
		ИначеЕсли Объект.Решение = 2 Тогда
			Элементы.ДекорацияРешение.Заголовок = "Перемещение разрешено при обязательном соблюдении условий";
		ИначеЕсли Объект.Решение = 3 Тогда
			Элементы.ДекорацияРешение.Заголовок = "Перемещение запрещено";
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры
