
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	// для 8.2 с общим модулем  РаботаСДиалогами
	// Вывести команду в Общий журнал
	
//	РаботаСДиалогами.ПоказатьСтруктуруПодчиненностиДокумента(ПараметрКоманды);
	
//		ОткрытьФорму("ОбщаяФорма.СтруктураПодчиненности",Новый Структура("ОбъектОтбора", ПараметрКоманды),
//				ПараметрыВыполненияКоманды.Источник,
//				ПараметрыВыполненияКоманды.Источник.КлючУникальности,
//				ПараметрыВыполненияКоманды.Окно);	

	//// Управление производственным предприятием, редакция 1.2 (1.2.29.1) 
	//ОткрытьФорму("ОбщаяФорма.ФормаСтруктурыПодчиненности",Новый Структура("ОбъектОтбора", ПараметрКоманды),
	//		ПараметрыВыполненияКоманды.Источник,
	//		ПараметрыВыполненияКоманды.Источник.КлючУникальности,
	//		ПараметрыВыполненияКоманды.Окно);	
КонецПроцедуры
