
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	// для 8.2 с общим модулем  РаботаСДиалогами
	// Вывести команду в Общий журнал
	
	//РаботаСДиалогами.ПоказатьСтруктуруПодчиненностиДокумента(ПараметрКоманды);
	//ФормаСтруктурыПодчиненности = ПолучитьОбщуюФорму("ФормаСтруктурыПодчиненности");
	//Если ФормаСтруктурыПодчиненности.Открыта() Тогда
	//	ФормаСтруктурыПодчиненности.Закрыть();
	//КонецЕсли;
	//ФормаСтруктурыПодчиненности.ДокументСсылка = ДокументСсылка;
	//ФормаСтруктурыПодчиненности.Открыть();
	

	//// "Управление торговлей", редакция 10.3 (10.3.45.2) 
	ОткрытьФорму("ОбщаяФорма.СтруктураПодчиненности",Новый Структура("ОбъектОтбора", ПараметрКоманды),
					ПараметрыВыполненияКоманды.Источник,
					ПараметрыВыполненияКоманды.Источник.КлючУникальности,
					ПараметрыВыполненияКоманды.Окно);	

	//// Управление производственным предприятием, редакция 1.2 (1.2.29.1) 
	//ОткрытьФорму("ОбщаяФорма.ФормаСтруктурыПодчиненности",Новый Структура("ОбъектОтбора", ПараметрКоманды),
	//		ПараметрыВыполненияКоманды.Источник,
	//		ПараметрыВыполненияКоманды.Источник.КлючУникальности,
	//		ПараметрыВыполненияКоманды.Окно);	
	
КонецПроцедуры
