Перем мНеОткрыватьФормуДокумента Экспорт;  //Запрешает открывать форму при вводе на основании, если уже введен ВСД Транзакция

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если кб99_ВСД_Общий.ЭтоДокументОтгрузка(ДанныеЗаполнения) Или
		кб99_ВСД_Общий.ЭтоДокументПеремещение(ДанныеЗаполнения) Тогда
		// Заполнение шапки
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры( ДанныеЗаполнения.Организация );
		Если НЕ ЗначениеЗаполнено(ПараметрыОрганизации.Получить("ПарамРазрешитьВводНаОснованииБолееОдногоВСД")) Тогда
			Сообщить("Проверьте и пересохраните параметры для Организации "+ДанныеЗаполнения.Организация);
			Возврат;
		КонецЕсли;		
		Если НЕ ПараметрыОрганизации.Получить("ПарамРазрешитьВводНаОснованииБолееОдногоВСД") Тогда
			//Найдем уже созданный
			ДокВСД = кб99_ВСД.НайтиВсдТранзакцию(ДанныеЗаполнения.Ссылка);
			Если ЗначениеЗаполнено(ДокВСД) Тогда
				мНеОткрыватьФормуДокумента = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Организация = ДанныеЗаполнения.Организация;
		Обработка = кб99_ВСД.ИнициализацияОбработки(Организация,Ложь);   // воспользуемся ф-цией ЗаполнитьТЧВСД() или РассчитатьКоличествоДляВСД()
		Если типЗнч(Обработка) = Тип("Строка") Тогда
			Сообщить("Не удалось инициализировать обработку Интеграция - документ не будет автоматически заполнен!!!");
			Возврат;
		КонецЕсли;
		Попытка	
			СписокПараметров = Обработка.ПолучитьДанныеДляСозданияВСДТранзакции(ДанныеЗаполнения.Ссылка);
			Обработка.ЗаполнитьШапку_ВСД2_Транзакция(ЭтотОбъект, СписокПараметров, ПараметрыОрганизации);
			Обработка.ЗаполнитьТЧВСД(СписокПараметров.ДокОснование, ЭтотОбъект,,,,СписокПараметров.СтрокиВСД);
		Исключение
			Сообщить("Не удалось заполнить документ");
			Сообщить(ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

мНеОткрыватьФормуДокумента = Ложь;
