
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НезавершенныеТранзакции") Тогда
		Организация = Параметры.Организация;
		Для Каждого Стр Из Параметры.НезавершенныеТранзакции Цикл
			нСтр = СписокДокументов.Добавить();
			ЗаполнитьЗначенияСвойств(нСтр, Стр);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаТч = Элемент.ТекущиеДанные;
	
	Результат = Новый Структура;
	Результат.Вставить( "НомерНезавершенногоПроизводства", СтрокаТЧ.НомерНезавершенногоПроизводства);

	ВводДатыПроизводства(Результат);

КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	СтрокаТч = Элементы.СписокДокументов.ТекущиеДанные;
	
	Результат = Новый Структура;
	Результат.Вставить( "НомерНезавершенногоПроизводства", СтрокаТЧ.НомерНезавершенногоПроизводства);
	
	ВводДатыПроизводства(Результат);

КонецПроцедуры

&НаКлиенте
Процедура кнЗавершитьВыбранныеТранзакции(Команда)
	
	ПредставлениеДокументыКЗавершению = "";
	
	Для Каждого Стр Из Элементы.СписокДокументов.ВыделенныеСтроки Цикл
		ПредставлениеДокументыКЗавершению = ПредставлениеДокументыКЗавершению +", "+СписокДокументов[Стр].Документ;
	КонецЦикла;
	
	//ПозицияЗапятой = СтрНайти(ПредставлениеДокументыКЗавершению, ", ");
	//
	//Если ПозицияЗапятой = 1 Тогда
	//	ПредставлениеДокументыКЗавершению = Прав(ПредставлениеДокументыКЗавершению, СтрДлина(ПредставлениеДокументыКЗавершению)-2);
	//КонецЕсли;
	
	// Для конфигурация ниже 8.3.6
	ПервыйСимвол = Лев(ПредставлениеДокументыКЗавершению, 1);
	Если ПервыйСимвол = "," Тогда
		ПредставлениеДокументыКЗавершению = Прав(ПредставлениеДокументыКЗавершению, СтрДлина(ПредставлениеДокументыКЗавершению)-2);
	КонецЕсли;
	
	ТекстВопроса = "Будут завершены следующие производственные транзакции: "+ПредставлениеДокументыКЗавершению+"
					| Продолжить?";
	
	Оповещение = Новый ОписаниеОповещения("кнЗавершитьПроизводствоОтвет", ЭтаФорма);	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,  0, КодВозвратаДиалога.Да, ""   );
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьНовоеПроизводство(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить( "НомерНезавершенногоПроизводства", Неопределено);
	Результат.Вставить( "ЗавершитьОперацию", Ложь );
	
	ВводДатыПроизводства(Результат);
	
КонецПроцедуры

&НаСервере
Функция кнЗавершитьВыбранныеТранзакцииНаСервере()
	
	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры( Организация );
   	ПараметрыОрганизации.Вставить( "ЗавершитьПроизводство", Истина );
	
	ВыбранныеСтроки = Элементы.СписокДокументов.ВыделенныеСтроки;
	
	Индекс = ВыбранныеСтроки.Количество()-1;
	
	Пока Индекс >= 0 Цикл
		Результат = кб99_ВСД_Запросы.ЗавершитьПроизводство( ПараметрыОрганизации, СписокДокументов[ВыбранныеСтроки[Индекс]].Документ );
		Если Результат = "COMPLETED" Тогда
			СписокДокументов.Удалить(ВыбранныеСтроки[Индекс]);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ВводДатыПроизводства(ДополнительныеПараметры)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаДатыПроизводства", ЭтаФорма, ДополнительныеПараметры);	
	ВыбДата = ТекущаяДата();
	ПоказатьВводДаты( Оповещение, ВыбДата , "Дата выпуска продукции",  ЧастиДаты.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура кнЗавершитьПроизводствоОтвет(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		кнЗавершитьВыбранныеТранзакцииНаСервере();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДатыПроизводства(ВыбДата, Результат) Экспорт
	
	Если ВыбДата = Неопределено Тогда
		кб99_ВСД.СообщитьИнфо("Отменено");
		Возврат;
	Иначе		
		
		Результат.Вставить("ДатаПроизводства", ВыбДата);
		
		Оповестить( "ВыборНезавершенногоПроизводства", Результат );
	
		Закрыть();
	
	КонецЕсли;
	
КонецПроцедуры
