//&НаКлиенте
//Процедура ПредупреждениеПользователю(ТекстПредупреждения) Экспорт
//    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждения", ЭтотОбъект);	
//    ПоказатьПредупреждение( Оповещение,   ТекстПредупреждения,   0,   "Предупреждение" );
//КонецПроцедуры
// 
//&НаКлиенте
//Процедура ПослеЗакрытияПредупреждения(Параметры) Экспорт
//	
//КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтвета(Ответ, Парам) Экспорт
	
	ДокСсылка = Парам.ДокСсылка;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПоказатьОповещениеПользователя("Выполняем гашение ВСД",,"Ожидайте...",БиблиотекаКартинок.Информация32);
		//// Если из журнала отправляем - закрывать его форму не нужно
		//// ПараметрыВыполненияКоманды.Источник.ИмяФормы    есть ФормаСписка
		//Если Парам.ЭтоОбъектВСД Тогда
		//	//Запишем, закроем форму, если это не форма списка
		//	Если Найти(Парам.ПараметрыВыполненияКоманды.Источник.ИмяФормы,"Списка") = 0 Тогда
		//		Парам.ПараметрыВыполненияКоманды.Источник.этаФорма.Закрыть();
		//	КонецЕсли;
		//КонецЕсли;
		
		кб99_ВСД_Клиент.ПогаситьВсдОтИмениПолучателя( ДокСсылка );
		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДокСсылка = ПараметрКоманды;
	Статус = кб99_ВСД_Общий.НайтиПоследнийЗапрос( ДокСсылка ).СтатусЗапроса;
	Если Статус = "COMPLETED" Тогда 
	
		ТВопроса = "Погасить ВСД от имени Получателя ?";
		Парам = Новый Структура("ДокСсылка", ДокСсылка);
	    Оповещение = Новый ОписаниеОповещения("ОбработкаОтвета", ЭтотОбъект, Парам);	
	    ПоказатьВопрос(Оповещение, ТВопроса, РежимДиалогаВопрос.ДаНет,  0, КодВозвратаДиалога.Да, ""   );
	Иначе
		кб99_ВСД.СообщитьИнфо("Статус последнего запросы = "+Статус);
	КонецЕсли
	
КонецПроцедуры
