
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = кб99_ВСД_Общий.ПолучитьОрганизациюПоУмолчанию();
	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры(Организация);
	
	ОтправительХозсубъект = ПараметрыОрганизации.Отправитель_ХозСубъект;
    Период.ДатаНачала	  = НачалоМесяца(ТекущаяДата());
	Период.ДатаОкончания  = КонецМесяца(ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЗначенияПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	УстановитьЗначенияПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательХозсубъектПриИзменении(Элемент)
	
	УстановитьЗначенияПараметров();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияПараметров()
	 
	УстановитьЗначениеПараметра("Период",					Период, ЗначениеЗаполнено(Период));
	УстановитьЗначениеПараметра("ХозсубъектОтправитель",	ОтправительХозсубъект, ЗначениеЗаполнено(ОтправительХозсубъект));
			
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПараметра(ИмяПараметра, Значение, Использование = Истина)
	
	ПараметрыОтчета = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	Параметр = ПараметрыОтчета.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	Параметр.Значение = Значение;
	Параметр.Использование = Использование;
	
КонецПроцедуры
