&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//Парам = Новый Структура("ПараметрКоманды,ПараметрыВыполненияКоманды",ПараметрКоманды,ПараметрыВыполненияКоманды);
	//Оповещение = Новый ОписаниеОповещения("ОбработкаОтвета",ЭтотОбъект,Парам);	
	//ПоказатьВопрос(Оповещение, "Аннулировать ВСД ?", РежимДиалогаВопрос.ДаНет,  0, КодВозвратаДиалога.Да, ""   );
	
	ПоказатьОповещениеПользователя("Выполняем Аннулирование ВСД",,"Ожидайте...",БиблиотекаКартинок.kb99_wrench);
	Если Найти( ПараметрыВыполненияКоманды.Источник.ИмяФормы,"Списка") = 0 Тогда
		ПараметрыВыполненияКоманды.Источник.этаФорма.Закрыть();
	КонецЕсли;		
	
	кб99_ВСД.АннулироватьВСД( ПараметрКоманды);
	
	ПоказатьОповещениеПользователя("Выполнено");
	
	
КонецПроцедуры
