
&НаСервере
Процедура ВыполнитьНаСервере( ВыбПлощадка )

	// Вносить изменения в реквизиты площадки может только владелец
	Если ЗначениеЗаполнено(ВыбПлощадка.ХозСубъект) 	Тогда
		Организация = кб99_ВСД.ПолучитьОрганизациюПоХС(ВыбПлощадка.ХозСубъект);		
	Иначе
		Организация = кб99_ВСД_Общий.ПолучитьОрганизациюПоУмолчанию();	
	КонецЕсли;
	
	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры( Организация );
	
	кб99_ВСД_Запросы.Площадка_Создать( ПараметрыОрганизации, ВыбПлощадка );
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Состояние("Выполняем запрос",,"Ожидайте...",БиблиотекаКартинок.kb99_wrench);
	
	ВыполнитьНаСервере( ПараметрКоманды );
	
	ПоказатьОповещениеПользователя("Операция завершена");
	
КонецПроцедуры
