
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	СформироватьОтчет(ПараметрКоманды, ТабДок);
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.Показать(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Проверка документа ""%1""", ПараметрКоманды));
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет(ПараметрКоманды, ТабДок)
	Документы.ВСД2_Производство.ПроверитьОформление(ПараметрКоманды, ТабДок);
КонецПроцедуры