Процедура ЗаписатьОстаткиПартий(СписокПартий, ДокСсылка) Экспорт

	тзПартии = Новый ТаблицаЗначений;
	тзПартии.Колонки.Добавить("Партия");
	тзПартии.Колонки.Добавить("Количество");
	
	Для Каждого стрПартия Из СписокПартий Цикл
		СтрТЧ = тзПартии.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТЧ, стрПартия);
	КонецЦикла;
	
	тзПартии.Свернуть("Партия", "Количество");
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого Стр Из тзПартии Цикл
		
		МенеджерЗаписи = РегистрыСведений.кб99_ОстаткиПартийВетис.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		МенеджерЗаписи.Партия = Стр.Партия;
		МенеджерЗаписи.ДокументДвижения = ДокСсылка;
		МенеджерЗаписи.Количество = Стр.Количество;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры