&НаСервере
Процедура ВыполнитьНаСервере(ПараметрКоманды)
		Организация = кб99_ВСД_Общий.ПолучитьОрганизациюПоУмолчанию();	
		ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры( Организация );
		
		Для Каждого элемент Из ПараметрКоманды Цикл
			кб99_ВСД_Запросы.Продукция_Элемент_Изменить( ПараметрыОрганизации, элемент, "CREATE" );
		КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтвета(Ответ, ПараметрФункции) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПоказатьОповещениеПользователя("Выполняем запрос Создание Продукции",,"Ожидайте...",БиблиотекаКартинок.Информация32);
		//ВСД.Изменить_Продукцию_Меркурий(,Парам.ПараметрКоманды,"CREATE");
		
		ВыполнитьНаСервере( ПараметрФункции.ПараметрКоманды );
			
		ПараметрФункции.ПараметрыВыполненияКоманды.Источник.ЭтаФорма.ОбновитьОтображениеДанных();	//!!!
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТВопроса = "Создать Продукцию в Меркурий ?";
	ПараметрПроцедуры = Новый Структура("ПараметрКоманды,ПараметрыВыполненияКоманды", ПараметрКоманды, ПараметрыВыполненияКоманды);
    Оповещение = Новый ОписаниеОповещения("ОбработкаОтвета", ЭтотОбъект, ПараметрПроцедуры);	
    ПоказатьВопрос(Оповещение, ТВопроса, РежимДиалогаВопрос.ДаНет,  0, КодВозвратаДиалога.Да, ""   );
КонецПроцедуры
