
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВыбКоманда     = "CREATE";
	ТекстВопроса   = "Создать продукцию в Меркурий?";
	ТекстСостояния = "Выполняем запрос на создание продукции";
	
	СтруктураКоманды = Новый Структура;
	СтруктураКоманды.Вставить("ВыбКоманда"    , ВыбКоманда);
	СтруктураКоманды.Вставить("ТекстВопроса"  , ТекстВопроса);
	СтруктураКоманды.Вставить("ТекстСостояния", ТекстСостояния);
	
	кб99_Команды_Общий_Клиент.кб99_ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды, СтруктураКоманды);
	
КонецПроцедуры
