
&НаКлиенте
Функция ПогаситьВсдОтИмениПолучателя( ДокСсылка ) Экспорт
		
	мВсдВходящие = Новый Массив;
	
	Организация = кб99_ВСД.ПолучитьЗначениеРевизитаОбъекта_НаСервере(ДокСсылка, "Организация");
	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры( Организация );				
	applicationID = кб99_ВСД_Общий.НайтиApplicationID( ДокСсылка );
	Ответ =  кб99_ВСД_Запросы.ПолучитьРезультат_ВСД2( ПараметрыОрганизации, applicationID, ДокСсылка, Ложь, мВсдВходящие );	
	
	Если Ответ="COMPLETED" Тогда 
		
		ПогаситьВсдОтИмениПолучателяСписком( ДокСсылка, мВсдВходящие );
		
	КонецЕсли;
	
	Возврат Ложь;
		
КонецФункции

&НаКлиенте
Функция ПогаситьВсдОтИмениПолучателяСписком( ДокСсылка, СписокВСД ) Экспорт
	
	мВсдВходящие  = СписокВСД;
		
	ТаблицаВсдДляГашения = Новый Массив;
	
	Для Каждого строкаВсдВходящие Из мВсдВходящие Цикл 
		
		Если строкаВсдВходящие.ТипВСД <> "TRANSPORT" Тогда 
			Продолжить;
		ИначеЕсли строкаВсдВходящие.СтатусВСД <> ПредопределенноеЗначение("Перечисление.кб99_СтатусВСД.CONFIRMED") Тогда 
			Продолжить;
		КонецЕсли;			
		ТаблицаВсдДляГашения.Добавить( строкаВсдВходящие );
		
	КонецЦикла;	
	
	Если ТаблицаВсдДляГашения.Количество()=0 Тогда 
		кб99_ВСД.СообщитьИнфо("Количество ВСД к гашению = "+ТаблицаВсдДляГашения.Количество()+" документы НЕ ПОГАШЕНЫ!");
		возврат Ложь;
	Иначе
		кб99_ВСД.СообщитьИнфо("Количество ВСД к гашению = "+ТаблицаВсдДляГашения.Количество());
	КонецЕсли;
	
	ПоказатьОповещениеПользователя("Выполняем Гашение ВСД",,"Ожидайте...",БиблиотекаКартинок.Информация32);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТаблицаВсдДляГашения", ТаблицаВсдДляГашения);
	СтруктураПараметров.Вставить("Организация", ДокСсылка.ОрганизацияПолучатель );
	СтруктураПараметров.Вставить("Отправитель_ХозСубъект", ДокСсылка.Получатель_ХозСубъект );
	СтруктураПараметров.Вставить("Отправитель_Площадка", ДокСсылка.Получатель_Площадка );
	ОткрытьФорму("Обработка.кб99_ГашениеВходящихПартий.Форма.ФормаГашениеУФ",СтруктураПараметров,);
	
	ПоказатьОповещениеПользователя("Выполнено");
	Возврат Истина;
			
КонецФункции


&НаКлиенте
Процедура СоздатьИлиОткрытьВСД2( ДокОснование ) Экспорт
	
	// Найдем уже созданный
	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры( ДокОснование.Организация );
	Если НЕ ЗначениеЗаполнено(ПараметрыОрганизации["ПарамРазрешитьВводНаОснованииБолееОдногоВСД"]) Тогда
		Сообщить("Не заполнены параметры для организации "+ДокОснование.Организация);
		Возврат;
	КонецЕсли;
	Если НЕ ПараметрыОрганизации["ПарамРазрешитьВводНаОснованииБолееОдногоВСД"] Тогда
		ДокВСД = кб99_ВСД.НайтиВсдТранзакцию( ДокОснование.Ссылка );
		Если ЗначениеЗаполнено(ДокВСД) Тогда
			ОткрытьФорму("Документ.ВСД2_транзакция.ФормаОбъекта",Новый Структура("Ключ", ДокВСД));
		Иначе
			ОткрытьФорму("Документ.ВСД2_транзакция.ФормаОбъекта", Новый Структура("Основание", ДокОснование));
		КонецЕсли;
	Иначе
		ОткрытьФорму("Документ.ВСД2_транзакция.ФормаОбъекта", Новый Структура("Основание", ДокОснование));		
	КонецЕсли;
	
КонецПроцедуры