&НаСервере
Процедура ВыполнитьНаСервере( ВыбДок )

	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры( ВыбДок.Организация );
	Если ПараметрыОрганизации["ЗавершатьПроизводство"] Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("По организации %1 не настроена работа с незавершенными производствннными транзакциями",
			 ВыбДок.Организация);
		кб99_ВСД.СообщитьИнфо(ТекстСообщения, ВыбДок);
		Возврат;
	КонецЕсли;
	
	Если кб99_ВСД_Производство.ПроизводственнаяТранзакцияОткрыта(ВыбДок) Тогда
		
		ПараметрыОрганизации.Вставить( "ЗавершитьПроизводство", Истина );
		
		СписокПродукции = Новый Массив;
		тзПродукция = ВыбДок.Продукция.Выгрузить();
		тзПродукция.Свернуть("Продукция_Элемент, ДатаИзготовления1");
		Для Каждого Стр Из тзПродукция Цикл
			СтруктураСтроки = Новый Структура("ПродукцияЭлемент, ДатаПроизводства", Стр.Продукция_Элемент, Стр.ДатаИзготовления1);
		    СписокПродукции.Добавить(СтруктураСтроки);
		КонецЦикла;
		
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("ПараметрыОрганизации", ПараметрыОрганизации);
		ПараметрыЗаполнения.Вставить("Площадка", ВыбДок.Производитель_Площадка);
		ПараметрыЗаполнения.Вставить("НомерОперации", ВыбДок.operationId);
		ПараметрыЗаполнения.Вставить("СписокПродукции", СписокПродукции);
		
		ДокументЗавершенияПроизводства = кб99_ВСД_Производство.ОформитьДокументЗавершенияПроизводства(ПараметрыЗаполнения);
		кб99_ВСД_Запросы.ЗавершитьПроизводство( ПараметрыОрганизации, ДокументЗавершенияПроизводства );
		
	Иначе
		ТекстСообщения = "Выбранный документ уже оформлен.";
		кб99_ВСД.СообщитьИнфо(ТекстСообщения, ВыбДок);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Состояние("Выполняем запрос",,"Ожидайте...",БиблиотекаКартинок.kb99_wrench);
	
	ВыполнитьНаСервере( ПараметрКоманды );
	
	ПоказатьОповещениеПользователя("Операция завершена");
	
КонецПроцедуры
