&НаСервере
Процедура ВыполнитьНаСервере( ВыбДок )
	
	Если Не ВыбДок.ЗавершитьОперацию Тогда
		ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры( ВыбДок.Организация );
		ПараметрыОрганизации.Вставить( "ЗавершитьПроизводство", Истина );
		кб99_ВСД_Запросы.ЗавершитьПроизводство( ПараметрыОрганизации, ВыбДок );
	Иначе
		ТекстСообщения = "Выбранный документ уже оформлен.";
		кб99_ВСД.СообщитьИнфо(ТекстСообщения, ВыбДок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Состояние("Выполняем запрос",,"Ожидайте...",БиблиотекаКартинок.kb99_wrench);
	
	ВыполнитьНаСервере( ПараметрКоманды );
	
	ПоказатьОповещениеПользователя("Операция завершена");
	
КонецПроцедуры
