&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДокСсылка = ПараметрКоманды;//ПараметрыВыполненияКоманды.Источник.Объект; ПараметрыВыполненияКоманды.Источник.ИмяФормы  // = Данные формы.Структура
	Если ВСД.ЕстьреквизитОбъекта("Статус",ДокСсылка) Тогда
		Если СокрЛП(ВСД.ПолучитьЗначениеРевизитаОбъекта_НаСервере(ДокСсылка,"Статус")) <> "COMPLETED" Тогда
			Предупреждение("Документ не отправлен");
			Возврат;
		КонецЕсли;
		ЭтоОбъектВСД = Истина;
	Иначе
		ЭтоОбъектВСД = Ложь;
	КонецЕсли;
	//Проверить - не помечен ли на удаление
	
	ТВопроса = "Погасить ВСД Поставщика ?";
	Ответ = Вопрос(ТВопроса,РежимДиалогаВопрос.ДаНет,0);
	Если НЕ (Ответ = КодВозвратаДиалога.Да) Тогда
		Возврат;
	КонецЕсли;	
	
	ПоказатьОповещениеПользователя("Выполняем гашение ВСД",,"Ожидайте...",БиблиотекаКартинок.Информация32);
	// Если из журнала отправляем - закрывать его форму не нужно
	// ПараметрыВыполненияКоманды.Источник.ИмяФормы    есть ФормаСписка
	Если ЭтоОбъектВСД Тогда
		//Запишем, закроем форму, если это не форма списка
		Если Найти(ПараметрыВыполненияКоманды.Источник.ИмяФормы,"Списка") = 0 Тогда
			ПараметрыВыполненияКоманды.Источник.этаФорма.Закрыть();
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ (ВСД.ПогаситьВСДПоставщика(ДокСсылка) = "ОК") Тогда
		
	КонецЕсли;
	ПоказатьОповещениеПользователя("Выполнено");
	
//	ПараметрыФормы = Новый Структура("", );
//	ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
