&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.Площадки.Очистить();
	//Вызов		ОткрытьФорму("ВнешняяОбработка.Интеграция_ГИС_Меркурий.Форма.ФормаГашениеУФ",, ЭтаФорма,,,, ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//КопироватьДанныеФормы(ВладелецФормы.Объект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка         = Ложь;
	Объект.Площадки.Очистить();
	Закрыть(Объект);
КонецПроцедуры
//*******************  Открытие/Закрыте формы окончание


&НаКлиенте
Процедура кнОтметитьВсеДокументы(Команда)
	Для Каждого стр Из объект.Площадки Цикл
		стр.Отметка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура кнСнятьОтметкиДокументов(Команда)
	Для Каждого стр Из объект.Площадки Цикл
		стр.Отметка = Ложь;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура кнВыполнитьПоиск(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

