Процедура ОбработчикНастройкаПериодаНажатие(ДатаНач, ДатаКон)
	
	НП = Новый НастройкаПериода;
	НП.ВариантНастройки = ВариантНастройкиПериода.Период;
	
	НП.УстановитьПериод(НачалоДня(ДатаНач), ?(ДатаКон = '00010101', ДатаКон, КонецДня(ДатаКон)));
	
	Если НП.Редактировать() Тогда
		
		ДатаНач = НП.ПолучитьДатуНачала();
		ДатаКон = НП.ПолучитьДатуОкончания();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура КнопкаНастройкаПериодаНажатие(Элемент)
	
	ОбработчикНастройкаПериодаНажатие(НачДата, КонДата);
КонецПроцедуры // КнопкаНастройкаПериодаНажатие()

Функция НайтиХозСубъект(Контрагент)
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ВСД_ХозСубъект.Ссылка
	             |ИЗ
	             |	Справочник.ВСД_ХозСубъект КАК ВСД_ХозСубъект
	             |ГДЕ
	             |	ВСД_ХозСубъект.Контрагент = &Контрагент
	             |	И НЕ ВСД_ХозСубъект.ПометкаУдаления"
				 ;
	Запрос.УстановитьПараметр("Контрагент",Контрагент);		
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;	
	Возврат 0;
КонецФункции	

Функция НайтиХозПлощадку(Контрагент)
	Запрос=Новый Запрос;
	Если ТипЗнч(Контрагент)=Тип("СправочникСсылка.Контрагенты") Тогда
		Запрос.Текст="ВЫБРАТЬ
		|	ВСД_ХозСубъект.Ссылка
		|ИЗ
		|	Справочник.ВСД_Площадка КАК ВСД_ХозСубъект
		|ГДЕ
		|	ВСД_ХозСубъект.Контрагент = &Контрагент
		|	И НЕ ВСД_ХозСубъект.ПометкаУдаления"
		;
	Иначе
		Запрос.Текст="ВЫБРАТЬ
		|	ВСД_ХозСубъект.Ссылка
		|ИЗ
		|	Справочник.ВСД_Площадка КАК ВСД_ХозСубъект
		|ГДЕ
		|	ВСД_ХозСубъект.ТорговаяТочка = &Контрагент
		|	И НЕ ВСД_ХозСубъект.ПометкаУдаления"
		;
	КонецЕсли;
	Запрос.УстановитьПараметр("Контрагент",Контрагент);	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;	
	Возврат 0;
КонецФункции	

Функция НайтиПартию(Продукция_Элемент,ДатаПартии)
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ВСД_Партия.Ссылка
	             |ИЗ
	             |	Справочник.ВСД_Партия КАК ВСД_Партия
	             |ГДЕ
	             |	НЕ ВСД_Партия.ПометкаУдаления
	             |	И ВСД_Партия.Продукция_Элемент = &Продукция_Элемент
	             |	И (ВСД_Партия.ДатаИзготовления1 МЕЖДУ &ДатаИзготовления1 И &ДатаИзготовления2
	             |			ИЛИ ВСД_Партия.ДатаИзготовления2 МЕЖДУ &ДатаИзготовления1 И &ДатаИзготовления2)"
				 ;
	Запрос.УстановитьПараметр("Продукция_Элемент",Продукция_Элемент);	
	Запрос.УстановитьПараметр("ДатаИзготовления1",НачалоДня(ДатаПартии));	
	Запрос.УстановитьПараметр("ДатаИзготовления2",КонецДня(ДатаПартии));	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ссылка;
	КонецЦикла;	
	Возврат 0;
КонецФункции	

Процедура СформироватьДокументыВСД(Кнопка)
	Для каждого тч из ТаблицаОтправкиВСД Цикл
		Если не ЗначениеЗаполнено(тч.ДокументВСД) Тогда
			Док=Документы.ВСД2_транзакция.СоздатьДокумент();
		Иначе
			Если сокрлп(тч.ДокументВСД.Статус)="COMPLETED" тОГДА
				Продолжить;
			КонецЕсли;
			Док=тч.ДокументВСД.ПолучитьОбъект();
		КонецЕсли;	
		
		Док.ДокументОснование=тч.Документ1С;
		Док.Отправитель_ХозСубъект=НайтиХозСубъект(ОрганизацияВСД.Контрагент);
		Если не ЗначениеЗаполнено(Док.Отправитель_ХозСубъект) Тогда
			сообщить(строка(тч.Документ1С)+" - не найден хозсубъект отправитель");
			Продолжить;
		КонецЕсли;	
		Док.Отправитель_Площадка=НайтиХозПлощадку(ОрганизацияВСД.Контрагент);
		Если не ЗначениеЗаполнено(Док.Отправитель_Площадка) Тогда
			сообщить(строка(тч.Документ1С)+" - не найдена площадка отправитель");
			Продолжить;
		КонецЕсли;	
		Док.Получатель_ХозСубъект=НайтиХозСубъект(тч.Документ1С.Контрагент);
		Если не ЗначениеЗаполнено(Док.Получатель_ХозСубъект) Тогда
			сообщить(строка(тч.Документ1С)+" - не найден хозсубъект получатель");
			Продолжить;
		КонецЕсли;	
		Док.Получатель_Площадка=НайтиХозПлощадку(тч.Документ1С.ТорговаяТочка);
		Если не ЗначениеЗаполнено(Док.Получатель_Площадка) Тогда
			сообщить(строка(тч.Документ1С)+" - не найдена площадка получатель");
			Продолжить;
		КонецЕсли;	
		Док.ТтнДата=?(ЗначениеЗаполнено(тч.СФ),сокрлп(тч.СФ.Номер),"");
		Док.ТтнДата=тч.Документ1С.Дата;
		Док.Дата=тч.Документ1С.Дата;
		Док.ТермическоеСостояние=1;
		Док.cargoInspected=1;
		Док.ФормаВСД=1;
		Если ЗначениеЗаполнено(тч.КУТ) Тогда
			Док.номерАвто=тч.КУТ.Автомобиль.Код
		КонецЕсли;	
		//Док.Экспертиза="Произ.лабор";
		Док.Местность="местность благополучна по остро инфекционным заболеваниям с\х животных и птиц";
		Док.Товары.очистить();
		ТаблВСД=тч.СписокПродукцииВСД.получить(0).Значение;
		ОшибкиПоПартиям=ложь;
		Для каждого тчПрод из ТаблВСД Цикл
			СтрТабл=Док.Товары.Добавить();
			СтрТабл.Продукция_Элемент=тчПрод.Продукция;
			//СтрТабл.ВидПродукции=СтрТабл.Продукция_Элемент.ВидПродукции;
			//СтрТабл.ФормаУпаковки=СтрТабл.Продукция_Элемент.ФормаУпаковки;
			СтрТабл.ЕдиницаИзмерения=СтрТабл.Продукция_Элемент.ЕдиницаИзмерения;
			СтрТабл.Номенклатура=тчПрод.Номенклатура;
			СтрТабл.Количество=тчПрод.Количество;
			//СтрТабл.КоличествоМест=СтрТабл.Мест;
			СтрТабл.Партия=НайтиПартию(СтрТабл.Продукция_Элемент,тчПрод.Дата);
			Если не ЗначениеЗаполнено(СтрТабл.Партия) Тогда
				сообщить(строка(тч.Документ1С)+" "+строка(тчПрод.Номенклатура));
				сообщить("не найдена партия по дате "+формат(тчПрод.Дата,"ДФ=dd.MM.yyyy"));
				ОшибкиПоПартиям=Истина;
				Продолжить;
			КонецЕсли;	
		КонецЦикла;	
		Если ОшибкиПоПартиям Тогда
			Продолжить;
		КонецЕсли;	
		Док.Записать();
		тч.ДокументВСД=Док.Ссылка;
	КонецЦикла;	
КонецПроцедуры

Процедура ПриОткрытии()
	КонДата=ТекущаяДата();
	НачДата=ТекущаяДата();
	ПризнакРеализации=истина;
КонецПроцедуры

Процедура ЗаполнитьТаблицуВСД(Элемент)
	Если Не ЗначениеЗаполнено(ОрганизацияВСД) Тогда
		Сообщить("Не выбрана организация");
		Возврат;
	КонецЕсли;	
	ТаблицаОтправкиВСД.Очистить();
	Если ПризнакРеализации Тогда
	ЗаполнитьРеализацию();
	КонецЕсли;
	ТаблицаОтправкиВСД.Сортировать("Дата,Номер");
КонецПроцедуры

Процедура ЗаполнитьРеализацию()
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	РеализацияТоваровРомилСерииЯчейки.Ссылка,
	             |	РеализацияТоваровРомилСерииЯчейки.Номенклатура,
	             |	РеализацияТоваровРомилСерииЯчейки.СерияНоменклатуры,
	             |	РеализацияТоваровРомилСерииЯчейки.Количество,
	             |	РеализацияТоваровРомилСерииЯчейки.КоличествоМест,
	             |	РеализацияТоваровРомилСерииЯчейки.Количество * РеализацияТоваровРомилСерииЯчейки.Номенклатура.ЕдиницаХраненияОстатков.Вес КАК Вес,
	             |	ВложенныйЗапрос.ПродукцияЭлемент,
	             |	ВложенныйЗапрос1.Ссылка КАК ВСД,
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(ВложенныйЗапрос2.Количество, 0) = 0
	             |			ТОГДА 0
	             |		ИНАЧЕ РеализацияТоваровРомилСерииЯчейки.Количество * ЕСТЬNULL(ВложенныйЗапрос2.Сумма, 0) / ЕСТЬNULL(ВложенныйЗапрос2.Количество, 0)
	             |	КОНЕЦ КАК Сумма,
	             |	ВложенныйЗапрос3.Ссылка КАК КУТ,
	             |	ВложенныйЗапрос4.Ссылка КАК СФ
	             |ИЗ
	             |	Документ.РеализацияТоваровРомил.СерииЯчейки КАК РеализацияТоваровРомилСерииЯчейки
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			ВСД_Соответсвия.Номенклатура КАК Номенклатура,
	             |			МАКСИМУМ(ВСД_Соответсвия.ПродукцияЭлемент) КАК ПродукцияЭлемент
	             |		ИЗ
	             |			РегистрСведений.ВСД_Соответсвия КАК ВСД_Соответсвия
	             |		
	             |		СГРУППИРОВАТЬ ПО
	             |			ВСД_Соответсвия.Номенклатура) КАК ВложенныйЗапрос
	             |		ПО РеализацияТоваровРомилСерииЯчейки.Номенклатура = ВложенныйЗапрос.Номенклатура
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			МАКСИМУМ(ВСД_транзакция.Ссылка) КАК Ссылка,
	             |			ВСД_транзакция.ДокументОснование КАК ДокументОснование
	             |		ИЗ
	             |			Документ.ВСД2_транзакция КАК ВСД_транзакция
	             |		
	             |		СГРУППИРОВАТЬ ПО
	             |			ВСД_транзакция.ДокументОснование) КАК ВложенныйЗапрос1
	             |		ПО РеализацияТоваровРомилСерииЯчейки.Ссылка = ВложенныйЗапрос1.ДокументОснование
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			РеализацияТоваровРомилТовары.Ссылка КАК Ссылка,
	             |			РеализацияТоваровРомилТовары.Номенклатура КАК Номенклатура,
	             |			СУММА(РеализацияТоваровРомилТовары.Количество) КАК Количество,
	             |			СУММА(РеализацияТоваровРомилТовары.Сумма + ВЫБОР
	             |					КОГДА РеализацияТоваровРомилТовары.Ссылка.СуммаВключаетНДС
	             |						ТОГДА 0
	             |					ИНАЧЕ РеализацияТоваровРомилТовары.СуммаНДС
	             |				КОНЕЦ) КАК Сумма
	             |		ИЗ
	             |			Документ.РеализацияТоваровРомил.Товары КАК РеализацияТоваровРомилТовары
	             |		ГДЕ
	             |			РеализацияТоваровРомилТовары.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	             |			И РеализацияТоваровРомилТовары.Ссылка.Проведен
	             |			И РеализацияТоваровРомилТовары.Ссылка.Организация = &Организация
	             |			И РеализацияТоваровРомилТовары.Ссылка.СтатусНакладной = &СтатусНакладной
	             |		
	             |		СГРУППИРОВАТЬ ПО
	             |			РеализацияТоваровРомилТовары.Ссылка,
	             |			РеализацияТоваровРомилТовары.Номенклатура) КАК ВложенныйЗапрос2
	             |		ПО РеализацияТоваровРомилСерииЯчейки.Ссылка = ВложенныйЗапрос2.Ссылка
	             |			И РеализацияТоваровРомилСерииЯчейки.Номенклатура = ВложенныйЗапрос2.Номенклатура
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			МАКСИМУМ(КартаУчетаТранспортаДокументыРеализации.Ссылка) КАК Ссылка,
	             |			КартаУчетаТранспортаДокументыРеализации.Документ КАК Документ
	             |		ИЗ
	             |			Документ.КартаУчетаТранспорта.ДокументыРеализации КАК КартаУчетаТранспортаДокументыРеализации
	             |		ГДЕ
	             |			КартаУчетаТранспортаДокументыРеализации.Документ.Дата МЕЖДУ &Дата1 И &Дата2
	             |			И КартаУчетаТранспортаДокументыРеализации.Документ.Организация = &Организация
	             |		
	             |		СГРУППИРОВАТЬ ПО
	             |			КартаУчетаТранспортаДокументыРеализации.Документ) КАК ВложенныйЗапрос3
	             |		ПО РеализацияТоваровРомилСерииЯчейки.Ссылка = ВложенныйЗапрос3.Документ
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			МАКСИМУМ(СчетФактураВыданныйДокументыОснования.Ссылка) КАК Ссылка,
	             |			СчетФактураВыданныйДокументыОснования.ДокументОснование КАК ДокументОснование
	             |		ИЗ
	             |			Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	             |		ГДЕ
	             |			СчетФактураВыданныйДокументыОснования.ДокументОснование.Дата МЕЖДУ &Дата1 И &Дата2
	             |			И СчетФактураВыданныйДокументыОснования.ДокументОснование.Организация = &Организация
	             |		
	             |		СГРУППИРОВАТЬ ПО
	             |			СчетФактураВыданныйДокументыОснования.ДокументОснование) КАК ВложенныйЗапрос4
	             |		ПО РеализацияТоваровРомилСерииЯчейки.Ссылка = ВложенныйЗапрос4.ДокументОснование
	             |ГДЕ
	             |	РеализацияТоваровРомилСерииЯчейки.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	             |	И РеализацияТоваровРомилСерииЯчейки.Ссылка.Организация = &Организация
	             |	И РеализацияТоваровРомилСерииЯчейки.Ссылка.Проведен
	             |	И РеализацияТоваровРомилСерииЯчейки.Ссылка.СтатусНакладной = &СтатусНакладной"
				 ;
	Запрос.УстановитьПараметр("Дата1",НачалоДня(НачДата));			 
	Запрос.УстановитьПараметр("Дата2",КонецДня(КонДата));			 
	Запрос.УстановитьПараметр("Организация",ОрганизацияВСД);	
	Запрос.УстановитьПараметр("СтатусНакладной",Перечисления.СтатусНакладной.Отгрузка);	
	
	Табл=Запрос.Выполнить().Выгрузить();
	Свод=Табл.Скопировать();
	Свод.свернуть("Ссылка,ВСД,КУТ,СФ");
	Для каждого тчСвод из Свод Цикл
		Если ЗначениеЗаполнено(тчСвод.ВСД) Тогда
			Если сокрлп(тчСвод.ВСД.Статус)="COMPLETED" тОГДА
				Продолжить;
			КонецЕсли;	
		КонецЕсли;	
		ТаблВСД=Новый ТаблицаЗначений;
		ТаблВСД.Колонки.Добавить("Продукция");
		ТаблВСД.Колонки.Добавить("Номенклатура");
		ТаблВСД.Колонки.Добавить("Дата");
		ТаблВСД.Колонки.Добавить("Количество");
		ТаблВСД.Колонки.Добавить("Мест");
		ТаблВСД.Колонки.Добавить("Сумма");
		Отбор=Новый Структура;
		Отбор.Вставить("Ссылка",тчСвод.Ссылка);
		Мас=Табл.НайтиСтроки(Отбор);
		Для й=0 по Мас.Количество()-1 Цикл
			Стр=Мас.Получить(й);
			Если ЗначениеЗаполнено(Стр.ПродукцияЭлемент) и Стр.Количество>0  Тогда
				Если не ЗначениеЗаполнено(Стр.СерияНоменклатуры) Тогда
					Сообщить(строка(тчСвод.Ссылка)+" "+строка(Стр.Номенклатура)+" - не указана серия в документе");
					Продолжить;
				КонецЕсли;
				Если не ЗначениеЗаполнено(Стр.СерияНоменклатуры.ДатаВыработки) Тогда
					Сообщить(строка(тчСвод.Ссылка)+" "+строка(Стр.Номенклатура)+" - не указана дата выработки в серии");
					Продолжить;
				КонецЕсли;
				Если Стр.Вес=0 Тогда
					Сообщить(строка(тчСвод.Ссылка)+" "+строка(Стр.Номенклатура)+" - не указан вес в единице хранения");
					Продолжить;
				КонецЕсли;
				СтрТаблВСД=ТаблВСД.Добавить();
				СтрТаблВСД.Продукция=Стр.ПродукцияЭлемент;
				СтрТаблВСД.Номенклатура=Стр.Номенклатура;
				СтрТаблВСД.Дата=НачалоДня(Стр.СерияНоменклатуры.ДатаВыработки);
				СтрТаблВСД.Количество=Стр.Вес;
				СтрТаблВСД.Мест=Стр.КоличествоМест;
				СтрТаблВСД.Сумма=Стр.Сумма;
			КонецЕсли;	
		КонецЦикла;	
		Если ТаблВСД.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;	
		ТаблВСД.Свернуть("Продукция,,Номенклатура,Дата","Сумма,Количество,Мест");
		ТаблВСД.Сортировать("Продукция,Дата");
		СтрТаблицаОтправкиВСД=ТаблицаОтправкиВСД.Добавить();
		СтрТаблицаОтправкиВСД.Дата=тчСвод.Ссылка.Дата;
		СтрТаблицаОтправкиВСД.Документ1с=тчСвод.Ссылка;
		СтрТаблицаОтправкиВСД.Номер=тчСвод.Ссылка.Номер;
		СтрТаблицаОтправкиВСД.Получатель=тчСвод.Ссылка.Контрагент;
		СтрТаблицаОтправкиВСД.Грузополучатель=тчСвод.Ссылка.ТорговаяТочка;
		СтрТаблицаОтправкиВСД.ДокументВСД=тчСвод.ВСД;
		СтрТаблицаОтправкиВСД.КУТ=тчСвод.КУТ;
		СтрТаблицаОтправкиВСД.СФ=тчСвод.СФ;
		СтрТаблицаОтправкиВСД.Сумма=ТаблВСД.Итог("Сумма");
		СтрТаблицаОтправкиВСД.Вес=ТаблВСД.Итог("Количество");
		СтрТаблицаОтправкиВСД.Мест=ТаблВСД.Итог("Мест");
		СтрТаблицаОтправкиВСД.ПризнакДляОбработки=истина;
		Список=Новый СписокЗначений;
		Список.Добавить(ТаблВСД);
		СтрТаблицаОтправкиВСД.СписокПродукцииВСД=Список;
	КонецЦикла;	
КонецПроцедуры	

Процедура ОтправитьДокументыВСД(Кнопка)
	Для каждого тч из ТаблицаОтправкиВСД Цикл
		Если тч.ПризнакДляОбработки и ЗначениеЗаполнено(тч.ДокументВСД) Тогда
			 Обр=Обработки.Интеграция_ГИС_Меркурий.Создать();
			 Обр.Отправить_ВСД2_транзакция(тч.ДокументВСД);
		КонецЕсли;	
	КонецЦикла;	
	ЗаполнитьТаблицуВСД(0);
КонецПроцедуры

Процедура КнПометкиСтрокУстановитьПометку(Кнопка)
	ПометитьТаблицу(истина);
КонецПроцедуры

Процедура КнПометкиСтрокСнятьПометку(Кнопка)
	ПометитьТаблицу(ложь);
КонецПроцедуры

Процедура ПометитьТаблицу(Фл)
	Для каждого тч из ТаблицаОтправкиВСД Цикл
		тч.ПризнакДляОбработки=Фл;
	КонецЦикла;	
КонецПроцедуры