
Процедура КнопкаВыполнитьНажатие(Кнопка)
	СписокУсловий = Новый Соответствие;
	СписокУсловий.Вставить( "ХС", ВыбХозСубъект );
	СписокУсловий.Вставить( "Регион", Регион );
	СписокУсловий.Вставить( "Название", НазваниеПлощадки );	
	
	ПолучитьПлощадкиПоУсловиям(СписокУсловий);
КонецПроцедуры

Процедура ПриОткрытии()
	//НазваниеПлощадки = ВыбХозСубъект.Наименование;	
	//Регион = СписокКонстант.Получить("Регион");
	Площадки.Очистить();
КонецПроцедуры

Процедура ОсновныеДействияФормыДействие(Кнопка)
	Для Каждого стр из Площадки Цикл
		Если стр.Отметка Тогда 
			Спр = Новый("СправочникМенеджер.ВСД_Площадка");
			Если стр.Площадка = Справочники.ВСД_Площадка.ПустаяСсылка() Тогда 
				Объект_ВСД_Площадка = Справочники.ВСД_Площадка.СоздатьЭлемент();
			Иначе
				Объект_ВСД_Площадка = стр.Площадка.ПолучитьОбъект(); 
			КонецЕсли;
			Объект_ВСД_Площадка.Наименование = стр.Наименование;
			Объект_ВСД_Площадка.Адрес = стр.Адрес;
			Объект_ВСД_Площадка.GUID = стр.GUID;
			Объект_ВСД_Площадка.UUID = стр.uuid;	
			Объект_ВСД_Площадка.GUIDХозСубъекта = ВыбХозСубъект.GUID;
			Объект_ВСД_Площадка.Записать();
			Сообщить("Записан ВСД_Площадка ["+Объект_ВСД_Площадка+"] GUID = "+ стр.Guid);				
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


Процедура УстановитьПометки()
	////ЖД ТермУсловияПеревозки
	//спМеню = Новый СписокЗначений;
	//спМеню.Добавить("ВыделитьВсе", "Все");
	//спМеню.Добавить("ВыделитьСоздать", "К Созданию ВСД");
	//спМеню.Добавить("ВыделитьНеОтправленные", "НЕ ОТПРАВЛЕННЫЕ");
	//спМеню.Добавить("ВыделитьКрасные", "Красные");	

	//ВыбранныйЭлемент = ВыбратьИзСписка(спМеню, ЭлементыФОрмы.КнВыбратьВсе);	
	//Если ВыбранныйЭлемент = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//ВыбЗн = ВыбранныйЭлемент.Значение;	
	Для Каждого стр Из Площадки Цикл
		стр.Отметка = Ложь;
		//Если ВыбЗн = "ВыделитьСоздать" Тогда
		//	Если ЗначениеЗаполнено(стр.ВСД) или НЕ(ЗначениеЗаполнено(стр.Площадка)) Тогда
		//		Продолжить;
		//	КонецЕсли;	
		//ИначеЕсли ВыбЗн = "ВыделитьНеОтправленные" Тогда
		//	Если ЗначениеЗаполнено(стр.ВСД) и НЕ(СокрЛП(стр.ВСД.Статус) = "COMPLETED") Тогда
		//		стр.Отметка = Истина;
		//		Продолжить;
		//	Иначе
		//		Продолжить;
		//	КонецЕсли;
		//ИначеЕсли (ВыбЗн = "ВыделитьКрасные") и (ЗначениеЗаполнено(стр.ХозСубъект.GUID)) Тогда
		//	Продолжить;
		//КонецЕсли;
		стр.Отметка = Истина;
	КонецЦикла;
КонецПроцедуры

Процедура СнятьПометки()
	Для Каждого стр Из Площадки Цикл
		Если (стр.Отметка) Тогда 
			стр.Отметка = Ложь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
