
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьВСД2Транзакция(Команда)
	
	//ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "СозданиеФормыВСД2Транзакция");//КлючеваяОперация);
	СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	//СтруктураПараметров = ПолучитьСтруктуруПараметровФормы(	ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.Услуги"));
	ОткрытьФорму("Документ.ВСД2_транзакция.ФормаОбъекта", СтруктураПараметров, ЭтаФорма);
КонецПроцедуры


#КонецОбласти

