&НаСервере
Процедура ВыполнитьНаСервере( ПараметрКоманды )
	
	Для Каждого ДокСсылка Из ПараметрКоманды Цикл
		
		ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры( ДокСсылка.Организация );
		
		Если кб99_ВСД.ЕстьРеквизитОбъекта("Отправитель_Площадка", ДокСсылка ) Тогда 
			//ВСД2_транзакция
			ПараметрыОрганизации.Отправитель_Площадка = ДокСсылка.Отправитель_Площадка;
			
		ИначеЕсли кб99_ВСД.ЕстьРеквизитОбъекта("Производитель_Площадка", ДокСсылка ) Тогда 
			//ВСД2_Производство
			ПараметрыОрганизации.Отправитель_Площадка = ДокСсылка.Производитель_Площадка;
			
		ИначеЕсли кб99_ВСД.ЕстьРеквизитОбъекта("Владелец_Площадка", ДокСсылка ) Тогда 
			//ВСД2_Инвентаризация     ВСД2_ОбъединениеПартий
			ПараметрыОрганизации.Отправитель_Площадка = ДокСсылка.Владелец_Площадка;
			
		КонецЕсли;
		
		applicationID = кб99_ВСД_Общий.НайтиApplicationID( ДокСсылка );
		
		ПараметрФункции = Новый Структура();
		ПараметрФункции.Вставить("applicationID", applicationID);
		ПараметрФункции.Вставить("Параметры", ПараметрыОрганизации );
		ПараметрФункции.Вставить("ДокОснование", ДокСсылка );
		ПараметрФункции.Вставить("СделатьПаузу", Ложь );
		
		Ответ =  кб99_ВСД_Запросы.ПолучитьРезультат_ВСД2( ПараметрФункции );	
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Состояние("Выполняем запрос Ответа о состоянии документов",,"Ожидайте...",БиблиотекаКартинок.kb99_wrench);
	
	ВыполнитьНаСервере( ПараметрКоманды );
	
	ПоказатьОповещениеПользователя("Операция завершена");
	
КонецПроцедуры
