&НаСервере
Процедура ВыполнитьНаСервере( ПараметрКоманды )
	Для Каждого ДокСсылка из ПараметрКоманды Цикл
		ПараметрыОрганизации = ВСД.ЗагрузитьПараметры( ДокСсылка.Организация );									
		Ответ =  ВСД_Запросы.ПолучитьРезультат_ВСД2( ПараметрыОрганизации, ДокСсылка.applicationID, ДокСсылка, ложь);	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПоказатьОповещениеПользователя("Выполняем запрос Ответа о состоянии документов",,"Ожидайте...",БиблиотекаКартинок.Информация32);
	
	//ВСД.Получить_Ответ_Меркурий(ПараметрКоманды);	
	ВыполнитьНаСервере( ПараметрКоманды );
	
	ПоказатьОповещениеПользователя("Операция завершена");
КонецПроцедуры
