&НаСервере
Процедура ВыполнитьНаСервере( ПараметрКоманды )
	
	Для Каждого ДокСсылка Из ПараметрКоманды Цикл
		ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры( ДокСсылка.Организация );									
		
		applicationID = кб99_ВСД_Общий.НайтиApplicationID( ДокСсылка );
		
		Ответ =  кб99_ВСД_Запросы.ПолучитьРезультат_ВСД2( ПараметрыОрганизации,, applicationID, ДокСсылка, Ложь);	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПоказатьОповещениеПользователя("Выполняем запрос Ответа о состоянии документов",,"Ожидайте...",БиблиотекаКартинок.kb99_wrench);
	
	ВыполнитьНаСервере( ПараметрКоманды );
	
	ПоказатьОповещениеПользователя("Операция завершена");
	
КонецПроцедуры
