
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//ПоказатьОповещениеПользователя("Выполняем запрос Получение инфо о Продукции",,"Ожидайте...",БиблиотекаКартинок.Информация32);
	//ВСД.Получить_Инфо_Продукции_Меркурий(ПараметрКоманды);
	
	//Организация = ВСД_Общий.ПолучитьОрганизациюПоУмолчанию();	
	//ПараметрыОрганизации = ВСД.ЗагрузитьПараметры( Организация );
		
	СтруктураПараметров = Новый Структура("ВыбХозСубъект", ПараметрКоманды);
	//ОповещениеОВыборе  = Новый ОписаниеОповещения("ОткрытиеФормыЗагрузкаПлощадок", ЭтаФорма, Новый Структура("ИмяКоманды", Команда.Имя));
	ОткрытьФорму("Обработка.Интеграция_ГИС_Меркурий.Форма.ФормаЗагрузкаПлощадокУФ",СтруктураПараметров, ,,,, , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	//ПоказатьОповещениеПользователя("Операция завершена");
КонецПроцедуры
