// Модуль используется для переопределения стандартный функций модуля Интеграции
// чтобы при обновлении изменения сохранились - используйте переопределение в этом модуле


//переопределение функций модуля
Функция НайтиФункцию( ИмяФункции ) экспорт
	
	ПереопределяемыеФункции = новый Структура;
	//ПереопределяемыеФункции.Вставить("ПолучитьНомерАвто", истина);
	//ПереопределяемыеФункции.Вставить("РассчитатьКоличествоДляВСД", истина);
	
	Возврат ПереопределяемыеФункции.Свойство( ИмяФункции );
		
КонецФункции

Функция ПолучитьНомерАвто(ДокОснование) Экспорт
	Возврат "123АА63"
КонецФункции

Функция РассчитатьКоличествоДляВСД(ПараметрыОрганизации, СтрокаТЧДок, Продукция_Элемент = "") Экспорт

	Коэфф = 1;
	
	если СтрокаТЧДок.Номенклатура.ВесИспользовать тогда
		Попытка
			Если СтрокаТЧДок.Номенклатура.ВесЗнаменатель>0 Тогда 
				Коэфф=СтрокаТЧДок.Номенклатура.ВесЧислитель/СтрокаТЧДок.Номенклатура.ВесЗнаменатель;
			Иначе
				Коэфф=1;
			КонецЕсли;
		Исключение
			Коэфф = 1;
		КонецПопытки;
	конецесли;
	
	Рез = СтрокаТЧДок[ ПараметрыОрганизации["НазваниеРеквизитаКоличество"] ]*Коэфф;
	Возврат рез;
КонецФункции