
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТВопроса = "Удалить Продукцию в Меркурий ?";
	Ответ = Вопрос(ТВопроса,РежимДиалогаВопрос.ДаНет,0);
	Если НЕ (Ответ = КодВозвратаДиалога.Да) Тогда
		Возврат;
	КонецЕсли;	
	ПоказатьОповещениеПользователя("Выполняем запрос Удаление Продукции",,"Ожидайте...",БиблиотекаКартинок.Информация32);
	ВСД.Изменить_Продукцию_Меркурий(,ПараметрКоманды,"DELETE");
	ПоказатьОповещениеПользователя("Операция завершена");
//	ПараметрыВыполненияКоманды.Источник.ЭтаФорма.ОбновитьОтображениеДанных();	
КонецПроцедуры
