Функция СведенияОВнешнейОбработке() Экспорт
	ОбъектыНазначенияФормы = Новый Массив;
//	ОбъектыНазначенияФормы.Добавить("Спра.ВозвратТоваровПоставщику");
	               	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид","ДополнительнаяОбработка");
	//ПараметрыРегистрации.Вставить("Назначение",ОбъектыНазначенияФормы);
	ПараметрыРегистрации.Вставить("Наименование","Сверка остатков кб99");
	ПараметрыРегистрации.Вставить("Версия","ГСИ-02");
	ПараметрыРегистрации.Вставить("БезопасныйРежим",Истина);
	ПараметрыРегистрации.Вставить("Информация","Сверка остатков кб99");
	
	ТаблицаКоманд = ПолучитьТаблицу_Команд();
	
	ДобавитьКоманду(ТаблицаКоманд,
	"Сверка остатков кб99",                // Представление команды в пользовательском интерфейсе
	
	"ФормаОтчета",        // Уникальный идентификатор команды или имя макета печати
	
	"ОткрытиеФормы",    // Способ вызова команды: "ОткрытиеФормы", "ВызовКлиентскогоМетода", "ВызовСерверногоМетода"
	
	Ложь,                        // Показывать оповещение
	
	"ФормаОтчета"                 // Модификатор
	
	);
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицу_Команд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры
