
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Партия", Расшифровка.Партия);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "Партия");
	
	ОткрытьФорму(
		"Отчет.кб99_ОстаткиПартий.Форма.ФормаРасшифровки", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Результат = Параметры.ТабДок;
	
	АвтоЗаголовок = Ложь;
	Заголовок = НСтр("ru = 'Отчет Остатки партий меркурий'");

КонецПроцедуры
