
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("Продукция") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация, Партия, ДокументОснование");
		Дата = ТекущаяДатаСеанса();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВСД_Продукция_ЭлементИсследования.Ссылка КАК Продукция,
		|	ВСД_Продукция_ЭлементИсследования.НомерСтроки КАК НомерСтроки,
		|	ВСД_Продукция_ЭлементИсследования.НомерАктаОтбораПроб КАК НомерАктаОтбораПроб,
		|	ВСД_Продукция_ЭлементИсследования.ДатаОтбораПроб КАК ДатаОтбораПроб,
		|	ВСД_Продукция_ЭлементИсследования.НаименованиеЛаборатории КАК НаименованиеЛаборатории,
		|	ВСД_Продукция_ЭлементИсследования.НаименованиеПоказателя КАК НаименованиеПоказателя,
		|	ВСД_Продукция_ЭлементИсследования.ДатаРезультата КАК ДатаРезультата,
		|	ВСД_Продукция_ЭлементИсследования.МетодИсследования КАК МетодИсследования,
		|	ВСД_Продукция_ЭлементИсследования.НомерЭкспертизы КАК НомерЭкспертизы,
		|	ВСД_Продукция_ЭлементИсследования.РезультатИсследования КАК РезультатИсследования,
		|	ВСД_Продукция_ЭлементИсследования.Заключение КАК Заключение
		|ИЗ
		|	Справочник.ВСД_Продукция_Элемент.Исследования КАК ВСД_Продукция_ЭлементИсследования
		|ГДЕ
		|	ВСД_Продукция_ЭлементИсследования.НачалоДействия <= &ТекДата
		|	И ВСД_Продукция_ЭлементИсследования.КонецДействия >= &ТекДата
		|	И ВСД_Продукция_ЭлементИсследования.Ссылка = &Продукция";
		
		Запрос.УстановитьПараметр("ТекДата", НачалоДня(ТекущаяДатаСеанса()));
		Запрос.УстановитьПараметр("Продукция", ДанныеЗаполнения.Продукция);
		
		Исследования.Загрузить(Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры
