
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗагруженныеХозсубъекты") Тогда
		выбКонтрагент = Параметры.ЗагруженныеХозсубъекты.Контрагент;
		Организация = Параметры.ЗагруженныеХозсубъекты.Организация;
		ХозсубъектыСписок.Очистить();
		Для Каждого Хозсубъект Из Параметры.ЗагруженныеХозсубъекты.МассивХозсубъектов Цикл
			НоваяСтрока = ХозсубъектыСписок.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Хозсубъект);
		КонецЦикла;
		Элементы.ПолеИнформация.Заголовок = "По ИНН """ + выбКонтрагент.ИНН + """ 
				| в ГИС Меркурий найдено " + Параметры.ЗагруженныеХозсубъекты.МассивХозсубъектов.Количество() + " хозсубъекта,
				| выберите к какому хозяйствующему субъекту привязать контрагента """ + выбКонтрагент.Наименование + """";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХозсубъектыСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры( Организация );
	СтрокаТч = ХозсубъектыСписок[ВыбраннаяСтрока];
	Если ЗначениеЗаполнено(СтрокаТч.Хозсубъект) Тогда
		ДополнительныеПараметры = Новый Структура("Контрагент, GUID, ПараметрыОрганизации", выбКонтрагент, СтрокаТч.GUID, ПараметрыОрганизации);
		Оповещение = Новый ОписаниеОповещения("ВыбратьХозсубъектОтвет", ЭтаФорма, ДополнительныеПараметры);
		ТекстВопроса = "Уже имеются загруженные хозсубъекты с GUID [ " + СтрокаТч.GUID + " ],
		| открыть список загруженных хозсубъектов для связи с контрагентом: """ + выбКонтрагент + """?";
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, "");
	Иначе
		ВыбраннаяСтрока.ХозСубъект = кб99_ВСД.НайтиХозСубъект(выбКонтрагент);
		кб99_ВСД_Запросы.Площадка_ЗагрузитьПоХозСубъекту(ПараметрыОрганизации, СтрокаТч.ХозСубъект, Истина);
		Оповестить("ХозсубъектЗагружен");
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьХозсубъектОтвет(Ответ,Парам) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораЗагруженногоХозСубъекта", ЭтаФорма.ВладелецФормы, Парам);
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("GUID", Парам.GUID);
		ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора, МножественныйВыбор, Отбор", Истина, Истина, Ложь, СтруктураОтбора);
		ОткрытьФорму("Справочник.ВСД_ХозСубъект.ФормаВыбора", ПараметрыПодбора, ЭтаФорма,,,, ОповещениеОЗакрытии);
		Закрыть();
	Иначе
		ХозСубъект = кб99_ВСД.НайтиХозСубъект(Парам.Контрагент);
		кб99_ВСД_Запросы.Площадка_ЗагрузитьПоХозСубъекту(Парам.ПараметрыОрганизации, ХозСубъект, Истина);
		Оповестить("ХозсубъектЗагружен");
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры