
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Попытка
	    АдресЗагрузкиПриложения = кб99_ВСД.ПолучитьПутьКПриложениюУдаленнойПоддержки();
		Если ЗначениеЗаполнено(АдресЗагрузкиПриложения) Тогда
			Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", ЭтотОбъект);
			НачатьЗапускПриложения(Оповещение, АдресЗагрузкиПриложения,, Истина);		
		КонецЕсли;	
	Исключение КонецПопытки;	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускПриложения(КодВозврата, ДополнительныйПараметр) Экспорт

    а = 1;
    
КонецПроцедуры

