&НаСервере
Процедура ВыполнитьНаСервере( СписокПлощадок )
	
	Организация = кб99_ВСД_Общий.ПолучитьОрганизациюПоУмолчанию();	
	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры( Организация );
	
	Для Каждого ВыбПлощадка Из СписокПлощадок Цикл
		кб99_ВСД_Запросы.Площадка_ЗагрузитьПоGUID( ПараметрыОрганизации, ВыбПлощадка.GUID, ВыбПлощадка.ХозСубъект, ВыбПлощадка );
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПоказатьОповещениеПользователя("Выполняем запрос",,"Ожидайте...",БиблиотекаКартинок.kb99_wrench);
	
	ВыполнитьНаСервере( ПараметрКоманды );
	
	ПоказатьОповещениеПользователя("Операция завершена");
КонецПроцедуры
