
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВСД2_Транзакция = Неопределено;
	
	Если Параметры.Свойство("ВСД2_Транзакция", ВСД2_Транзакция) Тогда
	
		Элементы.НадписьИнфо.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Изменение сведений о транспорте в точках перегрузки по документу %1", ВСД2_Транзакция);
		
		Для Каждого Стр Из ВСД2_Транзакция.ТочкиМаршрута Цикл
			НоваяСтрока = ТочкиПерегрузки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
			НоваяСтрока.UUid = "";
			НоваяСтрока.НомерТочки = Стр.НомерСтроки;
		КонецЦикла;
		
		Элементы.ГруппаПоОдномуВСД.Видимость = Ложь;
		
	Иначе
		Элементы.ГруппаПоДокументу.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)

	Результат = Новый Структура();
	
	Если ЗначениеЗаполнено(ВСД2_Транзакция) Тогда
		ПараметрыФормы = Новый Структура("ВСД2_Транзакция, ТочкиПерегрузки", ВСД2_Транзакция, ТочкиПерегрузки);
		ОткрытьФорму("Обработка.кб99_ИзменениеНомераАвтомобиля.Форма.Форма", ПараметрыФормы);
    Иначе
		Результат.Вставить("НомерАвто", НомерАвто);
		Результат.Вставить("НомерПрицепа", НомерПрицепа);
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры
