#Область НемодальныеОкна
&НаКлиенте
Процедура ПредупреждениеПользователю(ТекстПредупреждения) Экспорт
    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждения", ЭтотОбъект);	
    ПоказатьПредупреждение( Оповещение,   ТекстПредупреждения,   0,   "Предупреждение" );
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеЗакрытияПредупреждения(Параметры) Экспорт	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаписатьВСДНаСервере(Знач ДокСсылка)
	Докобъект = ДокСсылка.ПолучитьОбъект();
	Докобъект.УсловияПеревозки.Очистить();
	ДокОбъект.Записать();
	Возврат;
КонецПроцедуры


&НаСервере
Процедура кнРегионализацияНаСервере(Знач ДокСсылка)
	Обработка = ВСД.ИнициализацияОбработки();
	Если типЗнч(Обработка) = Тип("Строка") тогда
		Сообщить("Не удалось инициализировать обработку Интеграция - не получили условия для "+ДокСсылка);
		Возврат;
	КонецЕсли;
	Обработка.ПроверитьВозможностьПеремещения(ДокСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыОтвет(Ответ, Парам) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Если ВСД.ЕстьреквизитОбъекта("Статус",Парам.ПараметрКоманды) Тогда
			Если СокрЛП(ВСД.ПолучитьЗначениеРевизитаОбъекта_НаСервере(Парам.ПараметрКоманды,"Статус")) = "COMPLETED" Тогда
				ПредупреждениеПользователю("Документ уже отправлен");
				Возврат;
			КонецЕсли;
			ЭтоОбъектВСД = Истина;
			ДокСсылка = Парам.ПараметрКоманды;
			// Транзакция
		Иначе
			ЭтоОбъектВСД = Ложь;
			// Докоснование транзакции
			ДокСсылка = ВСД.НайтиВСД(Парам.ПараметрКоманды);
			Если НЕ ЗначениеЗаполнено(ДокСсылка) Тогда
				Сообщить("Ней найден ВСД по "+Парам.ПараметрКоманды);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ПоказатьОповещениеПользователя("Выполняем запрос Регионализации",,"Ожидайте...",БиблиотекаКартинок.Информация32);
		//// Если из журнала отправляем - закрывать его форму не нужно
		//// ПараметрыВыполненияКоманды.Источник.ИмяФормы    есть ФормаСписка
		//Если ЭтоОбъектВСД Тогда
		//	//Запишем, закроем форму, если это не форма списка
		//	Если Найти(Парам.ПараметрыВыполненияКоманды.Источник.ИмяФормы,"Списка") = 0 Тогда
		//		Парам.ПараметрыВыполненияКоманды.Источник.этаФорма.Закрыть();
		//	КонецЕсли; 		
		//КонецЕсли;
		
		ЗаписатьВСДНаСервере(ДокСсылка);
		ВСД.ПолучитьУсловияПеревозки(ДокСсылка);
		ПоказатьОповещениеПользователя("Выполнено");
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТВопроса = "Запросить условия перевозки ?";
	Парам = Новый Структура("ПараметрКоманды,ПараметрыВыполненияКоманды",ПараметрКоманды,ПараметрыВыполненияКоманды);
    Оповещение = Новый ОписаниеОповещения("ОбработкаКомандыОтвет",ЭтотОбъект,Парам);	
    ПоказатьВопрос(Оповещение, ТВопроса, РежимДиалогаВопрос.ДаНет,  0, КодВозвратаДиалога.Да, ""   );
КонецПроцедуры
